[
    {
        "question_id": "1",
        "solutions": "Learning Objectives:\n1. The candidate will understand and apply U.S. GAAP valuation principles and\nmethods applicable to individual life insurance and annuity products issued by\nU.S. life insurance companies.\nLearning Outcomes:\n(1a) Describe, apply and evaluate the appropriate valuation methods and techniques\nand related accounting treatments for reserves and related items (e.g., DAC), and\nother assets and liabilities for specific insurance products under U.S. GAAP.\nFurther, describe and recommend assumptions and margins appropriate to these\nGAAP reserves.\n(1b) Describe and apply the requirements, calculations, and disclosures related to\nGAAP \"Targeted Improvements\".\nSources:\nLO#1 LFM-856-23: US GAAP for Life Insurers, 2022 - Chapter 11: US GAAP -\nDeferred Annuities\nCommentary on Question:\nThis question tested the candidates’ knowledge of U.S. GAAP valuation principles and\nmethods, particularly around accounting classification of annuity contracts and the\ncalculation of Market Risk Benefits (MRBs) that were introduced as part of the Long\nDuration Targeted Improvements (LDTI). Overall, candidates generally demonstrated an\nunderstanding of the concepts. It was more common for candidates to have challenges\nwith part (a) than on parts (b) and (c).\nSolution:\n(a) Describe the test that XYZ Life needs to perform to determine the new VA\nproduct classification under US GAAP.\nILA LFMU Spring 2024 Solutions Page 1\n\n--- Page 2 ---\n",
        "commentary": ""
    },
    {
        "question_id": "1",
        "solutions": "Continued\nCommentary on Question:\nFew candidates were able to demonstrate a full understanding of the product\nclassification. A common error was focusing on the market risk component and\ndescribing the MRB, rather than the test for VA product classification and the\ninsurance risks associated with it. The key concepts for candidates were\ndescribing how deferred annuities may be classified as either investment\ncontracts or as universal life-type contracts and that the key differentiator\nbetween the two types was the presence of significant insurance risk. Candidates\nthat performed well explained the determination ratio and threshold.\n• Deferred annuities may be classified as either investment contracts or as\nuniversal life-type contracts. The key differentiator is the presence of\nsignificant mortality or morbidity risks.\n• The determination of significance of mortality or morbidity risk shall be based\non a comparison of the following amounts:\nExcess payments. The present value of expected excess payments to be\no\nmade under insurance benefit features—that is, insurance benefit amounts\nand related incremental claim adjustment expenses in excess of the\naccount balances.\nRevenue. The present value of all amounts expected to be assessed against\no\nthe contract holder and the expected investment margin.\n• Based on the applicable guidance, the insurer determines the significance of\nmortality or morbidity risk only on features and provisions exclusive of the\noption to annuitize.\n• Typically, the insurer establishes an accounting policy where mortality or\nmorbidity risk is determined to be significant if the ratio of excess payments\nto revenue, as defined above, exceeds a defined threshold.\n(b) Calculate the GMDB Market Risk Benefit (MRB) liability at the valuation date.\nShow all work.\nCommentary on Question:\nMost candidates were able to demonstrate at least a partial understanding of this\npart of the question. Common mistakes include calculating a different\nsurvivorship than the given persistency (net of decrements), missing one or both\nof mortality and persistency for decremented excess benefit, not flooring excess\nbenefits at zero, not discounting fees to the beginning of year, and not using the\nright discount rate in at issue and/or valuation date. Also, candidates often did\nnot provide both calculations at issue to determine the attributed fee percentage\nand at the valuation date to determine the MRB.\nThe solution for this part of the question is provided in an Excel spreadsheet.\nILA LFMU Spring 2024 Solutions Page 2\n\n--- Page 3 ---\n",
        "commentary": ""
    },
    {
        "question_id": "1",
        "solutions": "Continued\n(c) Calculate the Accumulated Other Comprehensive Income (AOCI) at the valuation\ndate. Show all work.\nCommentary on Question:\nIn general, candidates did well on this part of the question in understanding that\nthe AOCI was a comparison of MRB with respect to the change in own credit\nfrom issue to the valuation date. A common mistake was not using the right\ndiscount rate at valuation date keeping the risk-free portion the same but with at-\nissue own credit.\nThe solution for this part of the question is provided in an Excel spreadsheet.\nILA LFMU Spring 2024 Solutions Page 3\n\n--- Page 4 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Learning Objectives:\n1. The candidate will understand and apply U.S. GAAP valuation principles and\nmethods applicable to individual life insurance and annuity products issued by\nU.S. life insurance companies.\nLearning Outcomes:\n(1a) Describe, apply and evaluate the appropriate valuation methods and techniques\nand related accounting treatments for reserves and related items (e.g., DAC), and\nother assets and liabilities for specific insurance products under U.S. GAAP.\nFurther, describe and recommend assumptions and margins appropriate to these\nGAAP reserves.\nSources:\nLFM-856-23: US GAAP for Life Insurers, 2022 - Chapter 4: US GAAP - Expenses and\nCapitalization\nLFM-856-23: US GAAP for Life Insurers, 2022 - Chapter 8: US GAAP - Long\nDuration Health (only sections 1, 2.8.2, 3-5)\nLFM-858-24: US GAAP for Life Insurers, 2022 - Chapter 15: US GAAP – Reinsurance\nCommentary on Question:\nThis part of the question tested the candidates’ understanding of U.S. GAAP valuation\nprinciples and methods.\nSolution:\n(a) For the new LTC product, you are given:\nClaim projections\nProjection Year\nIncurral Year 1 2 3 4 5\n1 2,500 2,250 - - -\n2 6,063 5,456 - -\nTotal 2,500 8,313 5,456 - -\nCorporate Bond Yield Curve\nMoody's rating Curve 1 2 3 4 5\nPrime Spot 5.00% 5.50% 5.25% 4.50% 4.00%\nHigh Grade Spot 5.25% 5.25% 5.00% 4.75% 4.50%\nUpper Medium Spot 5.50% 6.00% 5.50% 5.00% 4.75%\nPrime Forward 5.00% 6.00% 4.75% 2.25% 2.00%\nHigh Grade Forward 5.25% 5.25% 4.50% 4.00% 3.50%\nUpper Medium Forward 5.50% 6.50% 4.50% 3.50% 3.75%\nILA LFMU Spring 2024 Solutions Page 4\n\n--- Page 5 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Continued\n(i) Calculate the claim reserve under US GAAP for year 1 and 2 using the\nspot rate locked in at issue. Show all work.\n(ii) Calculate the claim reserve under US GAAP for year 1 and 2 using the\nforward rate locked in at issue. Show all work.\nCommentary on Question:\nFor this part of the question, candidates were required to determine GAAP claim\nreserves for a new long-term care product by discounting claims in their year of\nincurred to the beginning of the first two claim projection years using given spot\nand forward interest rates.\nCandidates generally calculated the GAAP claim reserves accurately. However,\ncandidates had difficulty with distinguishing the projection year from year of\nincurred or that claims incurred in a particular projection year may be associated\nwith additional claim payments in a later projection year and would be included\nin the calculation of the GAAP claim reserve for the earlier projection year.\nMany candidates only calculated GAAP claim reserves as of the beginning of\nprojection year 1 and did not calculate the GAAP claim reserve at the beginning\nof projection year 2. Another common error was the derivation of the discounted\ninterest rates. In most cases, candidates derived the projection year 1 values\ncorrectly, but when calculating the projection year 2 values candidates used the\nsame discount rates used in their projection year 1 calculations.\nThe solution is based on the spot and forward rates provided in the question.\nTypically, spot and forward rates are directly related. It is this relationship which\nshould result in identical results. However, that relationship does not exist in the\nspot and forward rates for this question. Candidates who realized and\ndemonstrated this concept received full credit.\nClaim reserves under US GAAP are equal to the present value of future projected\nclaims discounted back to the beginning of the desired claim projection year using\nthe upper medium interest rates.\nCV(x,y) = Claim Reserve at the beginning of projection year x for claims incurred\nin year y associated with claim payments being made in year y and later. Claims\nare assumed to be paid at the end of the year.\n(i) To calculate the claim reserve under US GAAP for year 1 and 2 using the\nspot rate locked in at issue:\nILA LFMU Spring 2024 Solutions Page 5\n\n--- Page 6 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Continued\nTotal Claim Reserve at Beginning of Projection Year 1 = CV(1,1) + CV(1,2)\nCV(1,1) = 2,500 / (1+.055)^1 + 2,250 / (1+.06)^2\n= 2,369.67 + 2,002.49 = 4,372.16\nCV(1,2) = 6,063 / (1+.06)^2 + 5,456 / (1+.055)^3\n= 5,396.05 + 4,646.40 = 10,042.45\nTotal Claim Reserve at Beginning of Projection Year 1 = 4,372.16 + 10,042.45 =\n14,414.61\nTotal Claim Reserve at Beginning of Projection Year 2 = CV(2,1) + CV(2,2)\nCV(2,1) = 2,250 / (1+.06)^1 = 2,122.64\nCV(2,2) = 6,063 / (1+.06)^1 + 5,456 / (1+.055)^2\n= 5,719.81 + 4,901.96 = 10,621.77\nTotal Claim Reserve at Beginning of Projection Year 2 = 2,122.64 + 10,621.77 =\n12,744.41\n(ii) To calculate the claim reserve under US GAAP for year 1 and 2 using the\nforward rate locked in at issue:\nTotal Claim Reserve at Beginning of Projection Year 1 = CV(1,1) + CV(1,2)\nCV(1,1) = 2500 / (1+.055) + 2250 / (1+.065) /(1+.055)\n= 2,369.67 + 2,002.54 = 4,372.21\nCV(1,2) = 6,063 / (1+.065) / (1+.055) + 5,456 / (1+.045) / (1+.065) / (1+.055)\n= 5,396.17 + 4,646.82 = 10,042.99\nTotal Claim Reserve at Beginning of Projection Year 1 = 4,372.21 + 10,042.99 =\n14,415.20\nTotal Claim Reserve at Beginning of Projection Year 2 = CV(2,1) + CV(2,2)\nCV(2,1) = 2,250 /(1+.065) = 2,112.68\nCV(2,2) = 6,063 / (1+.065) + 5,456 / (1+.045) / (1+.065)\n= 5,692.96 + 4,902.40 = 10,595.36\nTotal Claim Reserve at Beginning of Projection Year 2 = 2,112.68 + 10,595.36 =\n12,708.04\n(b) QWE would like to use reinsurance to mitigate GAAP income volatility from the\nrisk of entering the LTC market.\nAssess whether each proposal below meets the objective of QWE.\n(i) Proposal 1: Cede 80% of morbidity risk with a large ceding commission\nto boost surplus at inception. QWE will pay a morbidity premium set at\n500% of best estimate morbidity, and will receive an experience rating\nrefund on ceded premium paid over 0.05% of statutory reserves at the end\nof each year.\nILA LFMU Spring 2024 Solutions Page 6\n\n--- Page 7 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Continued\n(ii) Proposal 2: QWE will pay a quarterly premium at 107% of the industry\nmorbidity rate, with the first-year reinsurance premium being waived for\nall policies. The reinsurer will reimburse all LTC claims after the second\nyear a policy has been on claim.\nCommentary on Question:\nFor this part of the question, candidates were required to evaluate the\nappropriateness of two reinsurance proposals with respect to mitigating GAAP\nincome volatility from the risk of entering the LTC market.\nSome candidates failed to state if either proposal meets QWE’s objective. Some\ncandidates argued that portions of each proposal satisfy QWE’s objective and\nother portions of the same proposal did not satisfy QWE’s objective. Many\ncandidates failed to explain why deposit accounting would be applied to Proposal\n1 and that such accounting has no impact to GAAP income volatility, or that\nreinsurance accounting treatment would be applied to Proposal 2 and that such\naccounting lessens GAAP income volatility. Repeating the proposal was not\nsufficient for a candidate to earn full credit for this part of the question.\n(i) Proposal 1 does not meet the objective of QWE to mitigate GAAP income\nvolatility from the risk of entering the LTC market. QWE paying a\nmorbidity premium equal to 500% of best estimate morbidity is excessive.\nFor QWE to receive an experience rating refund on ceded premium paid\nover 0.05% of statutory reserves at the end of each year limits the\nreinsurance risk and raises risk transfer concerns such that it may be more\ndifficult to assert that substantially all the insurance risk has been assumed\nby the reinsurer. Thus, this proposal does not have sufficient risk transfer.\nLong-duration reinsurance contracts that do not indemnify the ceding\ninsurer or subject the assuming reinsurer to significant mortality or\nmorbidity risk are treated as deposits. In this case, deposit accounting\napplies which has no impact on income volatility due to new risks.\n(ii) Proposal 2 does meet the objective of QWE to mitigate GAAP income\nvolatility from the risk of entering the LTC market. QWE paying a\nquarterly premium at 107% of the industry morbidity rate with the first-\nyear premium being waived seems reasonable and in line with the\nreinsurer reimbursing all LTC claims after the second year a policy has\nbeen on claim. Thus, it appears that QWE is indeed transferring\nsubstantially all the insurance risk on the reinsured portions of the\nunderlying contracts to the reinsurer and therefore, qualifies as a\nreinsurance contract. This reinsurance treaty meets the requirements of\nreinsurance accounting. Such accounting treatment lessens the income\nvolatility induced by the morbidity risk.\nILA LFMU Spring 2024 Solutions Page 7\n\n--- Page 8 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Continued\n(c) To boost competitiveness for the LTC product, QWE’s chief marketing officer\nhas decided to increase the commission on the LTC products. The agents selling\nthe policies have proposed the following commission schedules:\n• Schedule A: 10% commission on first year premium only\n• Schedule B: 1% commission on all premium collected\n• Schedule C: fixed cost per year regardless of sales. Cost is\napproximately 8% of projected first year premium\nThe expected life of the policy is 30 years.\nIdentify the commission schedule that:\n(i) Results in the least statutory surplus strain at issue.\n(ii) Results in the highest GAAP net income.\n(iii) Results in the least mismatch between statutory income and GAAP\nincome.\nJustify your answer.\nCommentary on Question:\nFor this part of the question, candidates were required to evaluate the impact of\nthree proposed commission scales to GAAP and statutory income statements.\nCandidates generally did well on this part of the question. Many candidates\ndemonstrated their knowledge of which commission schedule had expenses which\nwere eligible for deferral into a DAC asset and available for amortization.\nCandidates also demonstrated their understanding how deferability of an expense\nor lack of deferability impacts statutory surplus, GAAP net income, and the\nrelationship between statutory and GAAP income statements. For part (iii)\ncandidates received full credit if they answered Schedule B, Schedule C, or\nSchedules B and C.\n(i) The commission schedule which results in the least statutory surplus strain\nat issue is the commission schedule which produces the least amount of\nexpenses in the first year. Expenses are expensed as incurred in a\nstatutory income statement. Thus, Schedule B with its 1% of commission\non all premium collected will produce the least amount of expenses among\nthe three schedules in the first year.\nILA LFMU Spring 2024 Solutions Page 8\n\n--- Page 9 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Continued\n(ii) The commission schedule which results in the highest GAAP income is\nSchedule A because its commissions are deferrable and amortized over 30\nyears since its commissions are in excess of 0% ultimate commissions.\nAnnually such expenses would be amortized (expensed) in a GAAP\nincome statement as 1/3% of premiums in each year on a straight-line\nbasis for 30 years. The commissions for both Schedules B and C are not\ndeferrable and would be expensed as incurred. The amortized expenses\nfor Schedule A are lower than the expenses incurred by Schedules B and\nC and results in the least expense reduction of the three schedules.\n(iii) The commission schedules that result in the least mismatch between\nstatutory income and GAAP income are Schedules B and C. Schedule B’s\ncommissions are not deferrable since its commission schedule are a level\npercent of premium without a lower ultimate commission and thus, its\nexpenses are identically expensed as incurred in both Statutory and GAAP\nincome statements. Schedule C’s commissions are classified as fixed\nexpenses since they do not directly vary with sales and as a result, are not\ndeferrable and thus, as similar to Schedule B, its expenses are identically\nexpensed as incurred in both Statutory and GAAP income statements.\nThis is not true for Schedule A since its commissions are deferrable and\ntherefore, its expenses in a GAAP income statement will not match the\nexpenses in a Statutory income statement.\nILA LFMU Spring 2024 Solutions Page 9\n\n--- Page 10 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "Learning Objectives:\n2. The candidate will understand and apply U.S. Statutory valuation principles and\nmethods applicable to individual life insurance and annuity products issued by\nU.S. life insurance companies.\nLearning Outcomes:\n(2a) Describe, apply and evaluate the appropriate valuation methods and techniques\nand related accounting treatments for reserves and related items, and other assets\nand liabilities for specific insurance products under the U.S. Statutory rules.\nFurther, describe and recommend assumptions and margins appropriate to these\nstatutory reserves.\nSources:\nPractitioner Considerations for Guideline Excess Spread Attribution Methodology under\nActuarial Guideline LIII (AG53)\nCommentary on Question:\nThis question tested the candidates’ knowledge U.S. Statutory valuation principles and\nmethods, particularly AG53. Part a) asked for a description of Projected High Net Yield\nassets. Part b) asked for a critique of several statements. Part c) asked for a simplified\nattribution.\nSolution:\n(a) Describe Projected High Net Yield assets that are the focus of AG53.\nCommentary on Question:\nMost candidates received partial credit on this part of the question. Some\ncandidates mentioned “equity-like” and “other than equity-like” assets, the two\nmain asset categories mentioned in AG53, and the main point of each. Some\ncandidates mentioned a higher return assumed later in the projection. Almost no\ncandidates mentioned any portion of the points related to weighted average life,\nexclusion of investment expenses, or aggregation consistent with grouping of\nassets.\n• Equity-like investments assumed to have a higher value at projection year 10 or\nlater where before deduction for investment expenses:\n• Return is at least 4% for the first 10 projection years and at least 5% for later\nyears,\n• Assets other than Equity-like instruments where assumed Guideline Excess\nSpread is greater than zero. In addition:\n• Appointed Actuary shall disclose method used to determine WAL for\ncomparing to the Investment Grade New Spread Benchmark for assets without\nan explicit WAL or term to maturity.\nILA LFMU Spring 2024 Solutions Page 10\n\n--- Page 11 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "Continued\n• Exclude investment expenses for purposes of the comparison between the\nassumed Net Market Spread from each asset and the Investment Grade New\nSpread Benchmark.\n• Aggregation is consistent with how assets are grouped. (Credit only once\nwhether mentioned in first main point, second or both)\n(b) Critique the following statements about AG53:\n(i) AG53 will help ensure spread attributions will be consistent across\ncompanies.\n(ii) For the purpose of determining net market spreads, best estimate\ncashflows with margin should be used. However, investment expenses and\ndefaults should not be considered when determining the net market\nspreads.\n(iii) Guideline excess spread attribution is only required for existing asset\nholdings.\n(iv) Guideline excess spread attribution should be performed for fixed rate\ncorporate bonds with no or immaterial callability.\nCommentary on Question:\nMost candidates received partial credit on this part of the question. The expectation\nwas that candidates would indicate the statement was true or false first and explain\nwhy the statement was false. Some candidates did not clearly indicate whether the\nstatement was true or false and partial credit then depended on the rationale.\n(i) False. AG53 will not ensure that spread attributions are consistent across\ncompanies. There may be a wide range of views. Asset holdings may differ by\ncompanies. Certain companies may have less liquid assets which would impact\ndata used for spreads.\n(ii) False. Best estimate cashflows should be used without margins. When\ndetermining net market spreads defaults should be deducted while investment\nexpenses should not be considered.\n(iii) False. Guideline excess spread attribution is required for both existing assets\nand assumed reinvestment asset purchases.\n(iv) False. It depends on whether the bonds are public or private. If public, then\nthe Guideline Excess Spread attribution is not required. If private, then it will be\nrequired.\nILA LFMU Spring 2024 Solutions Page 11\n\n--- Page 12 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "Continued\n(c) Complete Table B given the data in Table A. Show all work.\nTable A: Spread Components Related to Each Risk\nSpread Components Related to Each Risk\nAsset Type Net Factor A Factor B Factor C Factor D Other\nMarket Factors/\nSpread Unallocated\nInvestment 1.5% 1.0% 0.5% 0.0% 0.0% 0.0%\nGrade Net\nSpread\nBenchmark\nAsset Class 1 2.5% 0.3% 0.7% 0.5% 0.8% 0.2%\nAsset Class 2 3.5% 1.8% 0.3% 1.0% 0.0% 0.4%\nTable B: Excess Spread Components Related to Each Risk\nExcess Spread Components Related to Each Risk\nAsset Type Net Investment Guideline Factor Factor Factor Factor Other\nMarket Grade Net Excess A B C D Factors/\nSpread Spread Spread Unallocated\nBenchmark\nAsset Class 1\nAsset Class 2\nCommentary on Question:\nSome candidates received full credit while many candidates received partial credit\non this part of the question. Some candidates correctly completed the first two or\nthree columns of the table while the rest was incorrect. Some candidates showed a\ncorrect Guideline Excess Spread but incorrectly proportionated the factors or\notherwise floored each factor at zero even though these can be negative. Although\nnot required for full credit, a few candidates showed the check where the Guideline\nExcess Spread equals the sum of the excess spread components including A-D and\nother factors/unallocated.\nIG Net Spread Benchmark = 1.50% = Original IG Net Spread Benchmark\nNet Market Spread = Original Market Spread\nAsset Class 1 Net Market Spread = 2.50%\nAsset Class 2 Net Market Spread = 3.50%\nILA LFMU Spring 2024 Solutions Page 12\n\n--- Page 13 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "Continued\nGuideline Excess Spread = Asset Class N Net Market Spread – IG Net Market\nSpread\nAsset Class 1 Guideline Excess Spread = 1.00% = 2.50% - 1.50%\nAsset Class 2 Guideline Excess Spread = 2.00% = 3.50% - 1.50%\nEach Factor = Asset Class Factor – IG Factor\nCompleted Table B:\nAsset Net IG Net Guideline Factor Factor Factor Factor Other\nType Market Spread Excess A B C D\nSpread Benchmark Spread\nAsset 2.50% 1.50% 1.00% -0.70% 0.20% 0.50% 0.80% 0.20%\nClass 1\nAsset 3.50% 1.50% 2.00% 0.80% -0.20% 1.00% 0.00% 0.40%\nClass 2\nCheck Guideline Excess Spread = Sum of the Factor Spreads.\nAsset Class 1: 1.00% = -0.70% + 0.20% +0.50% +0.80% +0.20% \nAsset Class 2: 2.00% = 0.80% - 0.20% + 1.00% + 0.00% + 0.40% \nILA LFMU Spring 2024 Solutions Page 13\n\n--- Page 14 ---\n",
        "commentary": ""
    },
    {
        "question_id": "4",
        "solutions": "Learning Objectives:\n2. The candidate will understand and apply U.S. Statutory valuation principles and\nmethods applicable to individual life insurance and annuity products issued by\nU.S. life insurance companies.\nLearning Outcomes:\n(2a) Describe, apply and evaluate the appropriate valuation methods and techniques\nand related accounting treatments for reserves and related items, and other assets\nand liabilities for specific insurance products under the U.S. Statutory rules.\nFurther, describe and recommend assumptions and margins appropriate to these\nstatutory reserves.\n(2b) Describe, apply and evaluate the Principle-Based Reserves valuation methods and\ntechniques for specific insurance products under U.S. Statutory rules.\n(2c) Describe and evaluate the fundamental features and design of the U.S. Statutory\nregulatory system.\nSources:\nLFM-143-20: Fundamentals of the Principle Based Approach to Statutory Reserves for\nLife Insurance\nValuation of Life Insurance Liabilities, Lombardi, Louis J., 5th Edition, 2018, Chapter 23\n– PBR for Life Products (exclude 23.1)\nReflection of COVID-19 in Life Insurance Mortality Improvement: A Discussion Brief,\nAmerican Academy of Actuaries, May 2022\nCommentary on Question:\nThis question tested the candidates’ knowledge of U.S. Statutory valuation principles and\nmethods.\nSolution:\n(a) Critique the following statements:\nA. The starting assets in the cash flow projection model should be 105% of\nthe modeled reserve.\nB. The Deterministic Exclusion Test is not required as it is designed to\nidentify policies that are insensitive to interest rate and asset return\nvolatility risks.\nC. The Stochastic Reserve is calculated as the sum of the starting assets and\nthe greatest present value of accumulated deficiency.\nILA LFMU Spring 2024 Solutions Page 14\n\n--- Page 15 ---\n",
        "commentary": ""
    },
    {
        "question_id": "4",
        "solutions": "Continued\nCommentary on Question:\nA. Most candidates correctly identified the fallacy of this statement.\nB. This is a composite statement and is best analyzed as such. In discussing the\napplication of the DET, the best-prepared candidates recognized the special\nnature of ULSG; however, this was not required to answer the question\ncorrectly.\nC. Candidates generally did not do well critiquing this statement.\nA. False. The starting assets should be in the range between 98% and 102% of\nthe reported reserve.\nB. False. The DET is not required; however, it is designed to determine whether\npremiums are sufficient to fund the policy’s guarantees, not determine\nwhether the policy is insensitive to interest rate and asset return volatility\nrisks.\nC. False. The sum of starting assets and the greatest present value of accumulated\ndeficiencies defines a scenario reserve, not the Stochastic Reserve.\n(b) Calculate the Scenario Reserve given the projected scenario below. Show all\nwork.\nProjection period 0 1 2 3 4 5 6 7 8 9 10\nStatement Value of\nAssets (000s) 20 11 2 (7) (3) 1 5 9 13 17 21\nOne-Year Treasury\nRate (%) 1.34 0.65 0.14 1.03 1.08 0.74 0.59 1.05 0.57 0.48\nCommentary on Question:\nGiven that the calculation was described in words in the text, the majority of\ncandidates did well on this part of the question.\nCommon mistakes were:\n(a) failing to multiply the Treasury rates by 105%; and\n(b) errors in developing the Accumulative Discount Factors.\nSee spreadsheet for model solution\n(c) Describe the steps to determine the prudent estimate mortality assumption given\nthat ABC’s mortality experience is only partially credible.\nCommentary on Question:\nThis part of the question might be a bit challenging for candidates who never\nexperienced this process. Most candidates failed to mention the requirement to\nadd margins.\nILA LFMU Spring 2024 Solutions Page 15\n\n--- Page 16 ---\n",
        "commentary": ""
    },
    {
        "question_id": "4",
        "solutions": "Continued\nThe actuary must select\n(a) a set of mortality rates (Set 1) representing the company’s mortality\nexperience; and\n(b) a corresponding set of mortality rates (Set 2) representing industry mortality\nexperience.\nA margin for conservatism is added to each of Set 1 and Set 2, to produce MSet 1\nand MSet 2, respectively. The credibility score of the company’s experience data\nis a factor in selecting the respective margins.\nUsing the detailed process defined in VM-20, MSet 1 and MSet 2 are blended\ntogether to produce the final prudent estimate assumption for mortality.\nThe process of grading the company experience rates (with margin) to the\nindustry experience rates (with margin) uses a prescribed grading table that varies\nby the credibility level of the company data as well as the “sufficient data period”.\nThis period is defined as the last policy duration which has 50 or more claims.\nGenerally, the lower the credibility of the company mortality data, the more\nquickly the company experience rates must grade into the industry mortality rates\nafter sufficient data no longer exists, as determined by the sufficient data period.\nIf the actuary does not have sufficient mortality data on which to base the\nselection of Set 1, then Set 2 alone is used for the entire process.\n(d) Describe the factors that can impact ABC Life’s mortality improvement\nassumptions under a significant pandemic, such as COVID-19.\nCommentary on Question:\nMost candidates treated this as a question about COVID-19. Rather, this a\nquestion about the lessons learned from COVID-19. Common errors were:\n(a) discussing the mortality assumption rather than the mortality improvement\nassumption; and\n(b) discussing whether to set a mortality improvement assumption. The question\npresumes that a mortality improvement assumption is being set.\nGeneral: Like COVID-19, the future direction of mortality improvement might\nbe unknown; so conservatism must be considered.\nFactors that might sustain future mortality improvement:\n1. The pandemic might have ended unhealthy lives, leaving behind a population\nthat is healthier than pre-pandemic.\n2. COVID-19 encouraged the use of telemedicine. For a future pandemic, this\napproach may lead to better health outcomes and longer survival.\nILA LFMU Spring 2024 Solutions Page 16\n\n--- Page 17 ---\n",
        "commentary": ""
    },
    {
        "question_id": "4",
        "solutions": "Continued\nFactors that might reduce future mortality improvement:\n3. Latent effects may emerge later and cause unanticipated deaths.\n4. The impact of the pandemic on mental health may have a negative impact on\nmortality improvement by way of increased suicides.\nILA LFMU Spring 2024 Solutions Page 17\n\n--- Page 18 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "Learning Objectives:\n1. The candidate will understand and apply U.S. GAAP valuation principles and\nmethods applicable to individual life insurance and annuity products issued by\nU.S. life insurance companies.\n2. The candidate will understand and apply U.S. Statutory valuation principles and\nmethods applicable to individual life insurance and annuity products issued by\nU.S. life insurance companies.\n6. The candidate will understand the fundamental features of the U.S. and\nInternational regulatory framework.\nLearning Outcomes:\n(1a) Describe, apply and evaluate the appropriate valuation methods and techniques\nand related accounting treatments for reserves and related items (e.g., DAC), and\nother assets and liabilities for specific insurance products under U.S. GAAP.\nFurther, describe and recommend assumptions and margins appropriate to these\nGAAP reserves.\n(2b) Describe, apply and evaluate the Principle-Based Reserves valuation methods and\ntechniques for specific insurance products under U.S. Statutory rules.\n(6c) The valuation methodology specified in IFRS 17.\nSources:\nValuation of Life Insurance Liabilities, Lombardi, Louis J., 5th Edition, 2018, Chapter 23\n– PBR for Life Products (exclude 23.1)\nLFM-143-20: Fundamentals of the Principle Based Approach to Statutory Reserves for\nLife Insurance, Rudolph\nLFM-856-23: US GAAP for Life Insurers, 2022 - Chapter 5: US GAAP - Non-\nparticipating Traditional Life Insurance\nBridging the GAAP: IFRS 17 and LDTI Differences Explored, Financial Reporter, July\n2022\nCommentary on Question:\nThis question tested the candidates’ ability to compare a variety of standards. The\nquestion covers aspects VM-20, US GAAP, and IFRS17. Candidates with knowledge of\nall the standards generally did well on this question.\nSolution:\n(a) Due to the impact of COVID-19, PGY Group has been reviewing and revising\nsome of its best estimate assumptions for a block of term business.\nYou are given:\nILA LFMU Spring 2024 Solutions Page 18\n\n--- Page 19 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "Continued\nAssumption Before After\nMortality 100% of past experience 10% increase\nMaintenance expense 2,000 per policy 2,000 per policy with 3%\ninflation\nClaim expense 1,000 per claim 1,000 per claim, decreasing by\n5% each year, floored at 500\nPGY’s experience is considered fully credible\nAssess the current year directional impact of the assumption update (while\nholding all other assumptions constant) for each of the above assumptions with\nregard to each of the following:\n(i) Deterministic US Statutory Reserve under VM-20\n(ii) US GAAP Reserve\nJustify your answers.\nCommentary on Question:\nCandidates generally did well on this part of the question in identifying the\nimpact due to mortality but struggled on maintenance expenses and claim\nexpenses. For a candidate to receive full credit, they had to ensure to relate their\nanswer back to the standard. Candidates were able to answer the question when it\nrelated to mortality but were not able to tie the concepts back when asked about\nMaintenance Expenses and Claim expenses. This refers to future improvements\nnot being included for VM20, or how maintenance expenses not being considered\na part of US GAAP reserves. To receive full credit candidates had to provide the\ndirectional impact and the justification, which many candidates failed to do.\n(i) Deterministic US Statutory Reserve under VM-20\nMortality – The 10% increase in mortality will increase the reserve. As\nPGY’s experience is fully credible, they are allowed to reflect the\ncompany experience as part of the assumption.\nMaintenance Expenses – Including inflation in the expenses will increase\nthe reserve. As the Deterministic Reserve under VM20 is a Gross\nPremium Valuation, all inflows and outflows are considered.\nClaim expense – There will be no impact to the reserve. Under VM-20,\nfuture improvement is not allowed to be reflected as part of the result until\nit actually realized.\nILA LFMU Spring 2024 Solutions Page 19\n\n--- Page 20 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "Continued\n(ii) US GAAP Reserve\nMortality – The 10% increase in mortality will increase the reserve. US\nGAAP Reserves uses best estimate assumption and allows the unlocking\nof assumptions at each valuation date.\nMaintenance Expenses – There will be no impact to the reserve. US\nGAAP Reserves do not include maintenance expenses,\nClaim expense – There will be a decrease to the US GAAP Reserves.\nGAAP Reserves include claim costs which includes claim expenses. This\nare allowed to be reflected in the projected cash flows.\n(b) Critique the following statements for ULSG under VM-20:\nA. The VM-20 Minimum Reserves for a group of individual life insurance\npolicies that pass both the deterministic and stochastic exclusion tests\nis NPR+Max[0, DR-NPR].\nB. The process for calculating the NPR assumes that at issue, all policies are\nlevel premium permanent plans that will expire on the maturity date with a\nminimum guaranteed benefit.\nC. When calculating the NPR floor, the COI would be determined to the next\npaid-to-date using credibility weighted company experience.\nCommentary on Question:\nCandidates generally did well critiquing statement A, and generally did not do\nwell critiquing statements B and C. Due to the ambiguity about the type of ULSG\nproduct stated, when critiquing statement A full credit was received if the\ncandidate stated the the Reserve would just be the NPR, or that a ULSG will\nalways needed to perform the DET. When critiquing statement B many candidates\nwere unable identify that under NPR the fund value had to mature at a 0 value.\nWhen critiquing statement C, most candidates failed to identify that the COI\nshould be based on the prescribed mortality rate and focused more on the\nweighting. No credit was received if a candidate just provided a True or False\nwithout any justification.\nA. True, under VM-20, a a ULSG will always need to calculate the DR\nregardless of whether both the DET and SET have been passed.\nILA LFMU Spring 2024 Solutions Page 20\n\n--- Page 21 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "Continued\nB. False, when calculating the NPR, the assumption is that the policy will expire\nat a 0 maturity value.\nC. False, when calculating the NPR, the COI would be determined to the next\npaid-to-date using the applicable prescribed mortality rate based on the issue\ndate of the policy.\n(c) PGY Group’s management will strategically assign a legal entity for each block\nof business to be reported through, with the goal of optimizing profit and capital.\nYou are given the following information on a block of whole life business at\nissue:\nPlan PV premium PV claims IFRS 17 Risk PV expenses\n(millions) (millions) Adjustment (millions)\n(millions)\nA 10 5 0.5 0\nB 12 13 1 0\n(i) Calculate the GAAP liability for each plan. Show all work.\n(ii) Calculate the IFRS 17 fulfillment cashflow for each plan. Show all work.\n(iii) Calculate the IFRS 17 contractual service margin for each plan. Show all\nwork.\n(iv) Recommend which entity below should be used for this block:\n• Entity 1: follows IFRS 17 reporting\n• Entity 2: follows U.S GAAP reporting\nJustify your response.\nCommentary on Question:\nCandidates generally did not do well on part (i). Most candidates did not\nappropriately calculate Net Premium Ratio (NPR) and simply set the GAAP\nLiability to the PV of Claims – PV of Premiums. No credit was received for\ncalculating this formula as it missed out a critical component of calculating the\nNPR.\nCandidates generally did do well on part (ii) and (iii). Most candidates calculated\nthese correctly and those who did not performed mostly careless mistakes.\nILA LFMU Spring 2024 Solutions Page 21\n\n--- Page 22 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "Continued\nCandidates performed well on part (iv). Most candidates were able to identify\nseveral appropriate reasons to show that US GAAP would be preferable for this\nentity. Candidates who suggested IFRS17 and provided reasonable justification\nreceived partial credit. For a candidate to receive full credit, they had to make\nreference to the calculations performed within parts (i), (ii) and (iii).\n(i) GAAP Liability\nNPR = min(1, PV Future Benefits/PV future Premiums)\nGAAP Liability = PV Future Benefits – NPR x PV Future Premiums\nProduct A:\nNPR = min(1,5/10) = 0.5\nGAAP Liability = 5 – 0.5 * 10 = 0\nProduct B:\nNPR = min(1,13/12) = 1\nGAAP Liability = 13 – 1* 12 = 1\nTotal GAAP Liability = 0 + 1 = 1\n(ii) Fulfillment cash flow\nFulfillment Cashflow = PV Claims + PV Expenses + Risk Adjustment –\nPV Premiums\nProduct A = 5 + 0 + 0.5 – 10 = -4.5\nProduct B = 13 + 0 + 1 – 12 = 2\n(iii) Contractual Service Margin\nCSM = Max(-Fulfillment Cashflow,0)\nProduct A = Max(-(-4.5),0) = 4.5\nProduct B = Max(-1,0) = 0\nILA LFMU Spring 2024 Solutions Page 22\n\n--- Page 23 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "Continued\n(iv) Entity 2 would be preferred for this block. Under US GAAP, products A\nand B can be aggregated together. Under IFRS17, as product B is\nOnerous they have to be reported separately. Under US GAAP as they can\nbe aggregated gains and be used to subsided losses within the different\nproduct – under IFRS17 there is no subsiding allowed. As there is a lower\nGAAP Liability at issue, there will be higher capital compared to IFRS17\ndue to the initial loss.\nILA LFMU Spring 2024 Solutions Page 23\n\n--- Page 24 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "Learning Objectives:\n2. The candidate will understand and apply U.S. Statutory valuation principles and\nmethods applicable to individual life insurance and annuity products issued by\nU.S. life insurance companies.\n3. The candidate will:\n• Understand the significant impact on individual life insurance and annuity\nproduct design and management of U.S. insurance product taxation rules.\n• Understand and apply the significant rules of U.S. insurance company taxation\nas they apply to U.S. life insurers.\nLearning Outcomes:\n(2a) Describe, apply and evaluate the appropriate valuation methods and techniques\nand related accounting treatments for reserves and related items, and other assets\nand liabilities for specific insurance products under the U.S. Statutory rules.\nFurther, describe and recommend assumptions and margins appropriate to these\nstatutory reserves.\n(3a) Describe and apply the significant US tax regulations relating to the taxation of\nindividual life and annuity insurance products.\n(3b) Describe, apply and evaluate the valuation methods and techniques for specific\ninsurance products under U.S. taxation rules. Further, evaluate and calculate\ndeferred tax items.\nSources:\nValuation of Life Insurance Liabilities, Lombardi, Louis J., 5th Edition, 2018, Chapter 11\n– Valuation Methodologies (exclude 11.3.9 to 11.3.11)\nLFM-845-20 – Chapters 1 and 2 of Life Insurance & Modified Endowments under\nInternal Revenue Code Sections 7702 and 7702A, DesRochers, Adney, King, &\nSpringfield, Second Edition\nLFM-850-22 – Changes to Section 7702 (IRC) and Nonforfeiture Interest Rates\nThe Tax Cuts and Jobs Act of 2017— Effects on Life Insurers, American Academy of\nActuaries, Oct 2020\nCommentary on Question:\nThis question tested the candidate’s knowledge of U.S. Statutory valuation principles and\nmethods and the impact of taxation rules on products and life insurers. Candidates\ngenerally did well on this question. Most candidates received at least partial credit on\neach part of the question.\nILA LFMU Spring 2024 Solutions Page 24\n\n--- Page 25 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "Continued\nSolution:\n(a) You are given the following information on an individual whole life policy as of\n12/31/2023.\nIssue date April 10, 2016\nMean reserve (includes deficiency reserves) 5,000\nValuation premium 1,000\nDeficiency reserve 1,000\nSupplemental benefit reserve 100\nCash surrender value 3,500\nPolicy Mean Reserve Semi Continuous\nReserve Method\nassuming an Annual\nValuation Mode\nPolicy premium mode monthly\nCalculate the tax reserve for the policy as of 12/31/2023. Show all work.\nCommentary on Question:\nVery few candidates received full credit on this part of the question. Most\ncandidates were able to identify that the tax reserve is 92.81% of the stat reserve,\nand that the tax reserve is floored at the cash surrender value. Few candidates\napplied either correctly. Few candidates identified that the final tax reserve,\nincluding the rider reserve, is capped at the statutory reserve. When calculating\nthe deferred premium asset, credit was given to assuming either 3/12 or 4/12\npremium left in the policy year.\nTax Reserve = max(Mean Reserve – Deferred Premium – Deficiency\nReserve)*0.9281, Cash surrender value)\nDeferred premium = (4/12)*Valuation Premium = 333.33\nTax Reserve = max(5,000 – 333.33 – 1000)*0.9281, 3,500) = 3,500\nWaiver Reserve = 100*0.9281 = 92.81\nTotal Tax Reserve is capped at statutory reserve\nTotal Reserve = min(3,500 + 92.81, 5,000 + 100) = 3,592.81\nILA LFMU Spring 2024 Solutions Page 25\n\n--- Page 26 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "Continued\n(b) You are given the following information for a universal life policy:\nFace amount 234,000\nMinimum guarantee rate 2.0%\nIssue age 46\nPremium expense load 3.0%\n2% 4% 6%\nPresent value of death benefits 86,073.58 48,556.15 29,244.58\nPresent value of expenses 131.98 95.02 72.35\n27.40 20.00 15.47\n6.57 6.22 5.89\n𝑎𝑎̈46\nCalculate the\nfollo𝑎𝑎ẅ46 in:7\ng:\n(i) Initial Cash Value Accumulation Test Net Single Premium\n(ii) Guideline Level Premium\n(iii) Guideline Single Premium\n(iv) 7-Pay Premium\nShow all work.\nCommentary on Question:\nMost candidates did well on this part of the question and received full credit. Not\nenough information was given on the issue date of the given contract to determine\nif it was issued pre- or post-2021, which would have determined if the revised\nrates under the Consolidated Appropriations Act of 2021 applied. Full credit was\ngiven to either approach. Additionally, some candidates included the premium\nexpense load as part of the expenses for the GLP and GSP calculations, and other\ncandidate did not. Full credit was received for either approach.\nIf issued pre-2021:\n(i) CVAT NSP = PVDB @ 4% = 48,556\n(ii) GLP = (PVDB + PVExp) / a46 @ 4% = 2,433\n(iii) GSP = (PVDB + PVExp) @ 6% = 29,317\n(iv) 7-pay premium = PVDB / a46:7 @ 4% = 7,806\nILA LFMU Spring 2024 Solutions Page 26\n\n--- Page 27 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "Continued\nIf issued post-2021:\n(i) CVAT NSP = PVDB @ 2% = 86,074\n(ii) GLP = (PVDB + PVExp) / a46 @ 2% = 3,146\n(iii) GSP = (PVDB + PVExp) @ 4% = 48,651\n(iv) 7-pay premium = PVDB / a46:7 @ 2% = 13,101\n(c) Using information from (b), you are given additional information about actual\npremium payments:\nPolicy Year Premium Paid\n1 10,000\n2 5,000\n3 25,000\n4 3,000\n5 2,500\n6 2,000\n7 0\n(i) Determine whether the policy qualifies as life insurance using the\nguideline premium test. Show all work.\n(ii) Determine whether the policy is a modified endowment contract. Show\nall work.\n(iii) Describe how policyholder taxes change when the policy is a modified\nendowment contract.\nCommentary on Question:\nMost candidates were able to receive partial credit on this part of the question. If\ncandidates did not arrive at the correct values in part (b)but used those values\ncorrectly in this part of the question to determine whether or not the contract\nqualifies as life insurance and is a MEC, full credit was received. In order to\nreceive full credit on part (iii), candidates had to state two similarities and two\ndifferences between the tax treatment of MECs and non-MECs. Most candidates\nreceived at least partial credit on part (iii).\nILA LFMU Spring 2024 Solutions Page 27\n\n--- Page 28 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "Continued\nParts (i) and (ii)\nMax\nGSP or\nYear\nAccum Accum Accum Accum 7-Pay\nPaid Prem Paid GLP GLP GSP GLP GPT 7-Pay 7-Pay Test\n1 $10,000 $10,000 $3,146 $3,146 $48,651 $48,651 Pass $13,101 $13,101 Pass\n2 $5,000 $15,000 $3,146 $6,292 $48,651 $48,651 Pass $13,101 $26,202 Pass\n3 $25,000 $40,000 $3,146 $9,439 $48,651 $48,651 Pass $13,101 $39,303 Fail\n4 $3,000 $43,000 $3,146 $12,585 $48,651 $48,651 Pass $13,101 $52,404 Pass\n5 $2,500 $45,500 $3,146 $15,731 $48,651 $48,651 Pass $13,101 $65,505 Pass\n6 $2,000 $47,500 $3,146 $18,877 $48,651 $48,651 Pass $13,101 $78,606 Pass\n7 $0 $47,500 $3,146 $22,023 $48,651 $48,651 Pass $13,101 $91,707 Pass\n(iii)\nSimilarities\n• The death benefit received by the beneficiaries is not taxable for both MECs and\nnon-MECs\n• The inside build-up of cash value within the policy is tax-deferred for both\n• After age 59 ½, full surrenders are treated the same in that any gain is treated as\ntaxable income\nDifferences\n• For non-MECs, contributions are withdrawn from the policy first. For MECs, the\ngain is withdrawn first.\n• If gain is removed from the contract prior to age 59 1/2 , an additional 10%\npenalty tax applies.\n• Policy loans taken two years prior to the MEC effective date are subject to MEC\nrules and could become taxable events.\nILA LFMU Spring 2024 Solutions Page 28\n\n--- Page 29 ---\n",
        "commentary": ""
    },
    {
        "question_id": "7",
        "solutions": "Learning Objectives:\n4. The candidate will understand the fundamental purpose of capital, and its\ndetermination and stakeholders.\nLearning Outcomes:\n(4a) The Candidate will be able to describe and evaluate the theory of capital\n(including economic capital), and evaluate its applicability for various purposes\nand its value to different stakeholders.\nSources:\nLombardi, Chapter 29 – Risk-Based Capital, Valuation of Insurance Liabilities, 5th Ed.\nLFM-854-22:NAIC Own Risk and Solvency Assessment (ORSA) Guidance Manual,\nNational Association of Insurance Commissioners, Dec 2017\nCommentary on Question:\nThis question tested the candidates’ understanding of Risk-Based Capital and ORSA in\nthe context of understanding various viewpoints on risk evaluation.\nSolution:\n(a) The following is an excerpt from SPW Life’s ORSA report:\n• SPW Life has identified its key risk to be disintermediation risk in the\nrising interest rate environment, where SPW Life will incur a large\nloss when selling assets to fund its high amount of lapses.\n• SPW Life’s experience in mortality underwriting has been more\nfavorable than the industry, and it does not view mortality as a key\nrisk.\nYou have been provided the following information about SPW Life’s RBC\ncomponents:\nRBC Capital Amount\nComponent (before diversification)\nC0 0\nC1 4,000,000\nC2 100,000,000\nC3 5,000,000\nC4 0\nExplain why the biggest risk identified from the RBC above may be different\nfrom the ORSA excerpt.\nILA LFMU Spring 2024 Solutions Page 29\n\n--- Page 30 ---\n",
        "commentary": ""
    },
    {
        "question_id": "7",
        "solutions": "Continued\nCommentary on Question:\nCandidates who identified that ORSA is company specific and RBC is an industry-\nwide and factor-based approach received did well on this part of the question.\nCandidates generally did well on this part of the question.\n• RBC is a factor-based calculation set by regulatory standards and application\ndoes not vary company to company.\n• RBC components above are based solely on how regulators perceive risk.\n• C2, representing insurance risk, is a factor applied to NAR to get the capital\namount, so higher NAR on business issued will naturally make this capital\ncomponent higher.\n• ORSA is an own risk and solvency assessment and is the company’s own\nview of risk; it is company specific and describes what is seen as a perceived\nrisk and how to mitigate and monitor it. This positions SPW Life to\nacknowledge their mortality underwriting being more favorable than the\nindustry.\n• Therefore, there’s no requirement the RBC and ORSA would identify the\nsame risk.\n• RBC likely should be a considered input when working through ORSA.\n(b) Evaluate whether each of the following statements from SPW Life’s ORSA report\nis consistent with the ORSA guidance.\nA. SPW Life has performed all its quantitative risk assessments, using\nstochastic analysis and actuarial judgement. All assessments were done\non a quantitative basis.\nB. The stress tests used in ORSA calculations were based on historic worst\ncases experienced by SPW Life in the last 5 years.\nC. SPW Life defines solvency as having enough liquid assets, limited to cash\nand US Treasury bonds, to ensure all obligations will be able to be met\nwithin the next 3 years.\nCommentary on Question:\nCandidates generally did well evaluating statements A and B. Many candidates\ndid not evaluate statement C correctly.\nFor statement A credit was received for identifying the qualitative analysis.\nFor statement B credit was received for identifying that the time horizon is likely\ntoo short and that testing beyond history is likely needed. Credit was also\nreceived for discussing the benefits of varying the stresses by risk category.\nILA LFMU Spring 2024 Solutions Page 30\n\n--- Page 31 ---\n",
        "commentary": ""
    },
    {
        "question_id": "7",
        "solutions": "Continued\nFor statement C it was a common mistake to address what assets should be\nincluded in solvency. Identifying that the question is addressing a life insurance\ncompany and the timeline is likely longer received credit.\nA.\n• ORSA guidance proposes that both qualitative and quantitative analysis be\nperformed.\n• Using stochastic analysis can be appropriate for certain risks.\nB.\n• ORSA doesn’t specifically require sensitivity or testing levels.\n• Stresses can vary by risk category.\n• Judgment will be used to determine what is appropriate to test.\n• Stresses based solely on history may not be adequate, especially only the past\n5 years.\nC.\n• This can be viewed as consistent as the statement includes a definition of\nsolvency and a time horizon.\n• Solvency should be considered over the expected coverage of the block of\nbusiness, until one can deem there is no more material risk.\n• The projected horizon is likely too short for a life insurance product.\n(c) Determine the C-3 Risk Category appropriate for each product below using the\nNAIC RBC rules at the inception of the product. Justify your reasoning.\n(i) Fixed deferred annuity with a 3-year surrender charge period and no\nMarket Value Adjustment (MVA). The first-year surrender charge is 6%.\n(ii) Single premium deferred payout annuity. The single premium cannot be\nwithdrawn for 5 years. Starting in year 6, payments are guaranteed for\nlife.\n(iii) Fixed indexed annuity with a 2% surrender charge for only the first 5\nyears.\nCommentary on Question:\nTo received full credit, candidates had to identify the correct risk level of the\nproduct (low, medium, high) and provide justification. A common mistake was to\nonly identify the risk level.\nILA LFMU Spring 2024 Solutions Page 31\n\n--- Page 32 ---\n",
        "commentary": ""
    },
    {
        "question_id": "7",
        "solutions": "Continued\n(i) Product 1 - Medium risk due to surrender charge >5% threshold.\n(ii) Product 2 - Low risk as it does not allow withdrawals.\n(iii) Product 3 -High risk as surrender charge is <5% threshold.\nILA LFMU Spring 2024 Solutions Page 32\n\n--- Page 33 ---\n",
        "commentary": ""
    },
    {
        "question_id": "8",
        "solutions": "Learning Objectives:\n5. The candidate will understand important insurance company issues, concerns and\nfinancial management tools.\nLearning Outcomes:\n(5a) The candidate will be able to describe, apply and evaluate considerations and\nmatters related to:\n• Insurance company mergers and acquisitions\n• Management of variable deferred annuities\n• Embedded Value determinations\n• VM-20 financial impacts\n• Rating agency considerations\n• Model Audit Rule and Sarbanes-Oxley Section 404 considerations\n• Source of Earnings analysis\nSources:\nLFM-106-07: Insurance Industry Mergers and Acquisitions, Chapter 4 (Sections 4.1-4.6)\nEmbedded Value: Practice and Theory, SOA, Actuarial Practice Forum, March 2009\nCommentary on Question:\nThe question tested the candidates’ knowledge of embedded value and AAV.\nSolution:\n(a) CWY hired an investment bank to use the Comparable Company Analysis\ntechnique to generate a range of appraisal values for ELF.\nYou are given:\n• price-to-book value multiples ranging from 1.1 to 1.8\n• a change of control premium of 15%\n• ELF’s current book value is 1000\n(i) Describe the general guidelines that are useful for peer group selection in\nthe Comparable Company Analysis.\n(ii) Calculate the range of appraisal value of ELF Insurance. Show all work.\nCommentary on Question:\nFew candidates received full credit for this part of the question.\nILA LFMU Spring 2024 Solutions Page 33\n\n--- Page 34 ---\n",
        "commentary": ""
    },
    {
        "question_id": "8",
        "solutions": "Continued\n(i) Some guidelines to consider when selecting peer companies:\n• The peer group must be large enough to be statistically significant\n• Select companies with the same or similar regulatory, accounting and\ntax rules.\n• The peer group should sell in the company’s core or dominant\nsegments\n• Analyze companies that are similar performers in the same LOB\n(ii) Range of appraisal value\n• Lower end of range 1000 X 1.1 X (1 + 0.15) = 1,265\n• Upper end of range 1000 X 1.8 X (1 + 0.15) = 2,070\n(b) You are given the following statutory projection:\n12/2023 12/2024 12/2025 12/2026 12/2027 12/2028\nPremium 500 450 400 350 300\nInvestment Income (all\nassets) 138 131 125 118 112\nBenefits 200 210 220 230 240\nCommissions 10 9 8 7 6\nExpenses 100 90 80 70 60\nStatutory Reserves 2000 1900 1800 1700 1600 0\nTotal Required Capital 300 290 280 270 260 0\nAssuming:\nPre-tax earned rate 6%\nTax rate 21%\nFree surplus 0\nRisk discount rate 10%\nTaxable incomes equal to pre-tax earnings.\nILA LFMU Spring 2024 Solutions Page 34\n\n--- Page 35 ---\n",
        "commentary": ""
    },
    {
        "question_id": "8",
        "solutions": "Continued\nCalculate the following information for all projection years:\n(i) Book profit\n(ii) Cost of Capital\n(iii) Inforce Business Value\n(iv) Embedded Value\nShow all work.\nCommentary on Question:\nMany candidates did not properly handle the change in the statutory reserve in\nthe presentation of income or take into account federal income taxes. Most\ncandidates also missed the adjustment for interest on required capital in the book\nprofit calculation.\n(i) Book Profit\nRevenue = premiums + investment income\nBenefits / expenses = Benefits + Commissions + Expenses – Change in\nReserve\nPre tax Stat Income = Revenue – Benefits\nAfter tax Stat Income = Pre-tax – Taxes\nBook Profit = After Tax Stat Income – int on required capital on after tax\nbasis\nYearly Values\nRevenue 638 581 525 468 412\nBenefits/Exp 210 209 208 207 (1,294)\nPre tax Stat 428 372 317 261 1,706\nTax 90 78 67 55 358\nAfter tax Stat 338 294 250 206 1,347\nReq Capital Charge = Required Capital X Earned Rate X (1-Tax Rate)\n= 14 14 13 13 12\nBook Profit 324 280 237 194 1,335\nILA LFMU Spring 2024 Solutions Page 35\n\n--- Page 36 ---\n",
        "commentary": ""
    },
    {
        "question_id": "8",
        "solutions": "Continued\n(ii) Cost of Capital\nCost of Capital Rate = 10% - 6% X (1 – 0.21) = 5.26%\nCost of Capital = Required Capital (t-1) X COC Rate\n= 15.78 15.25 14.73 14.20 13.68\n(iii) Inforce Business Value\nIBV = PV Book Profit – PV Cost Of Capital using 10% rate\nPV Book Profit = 1,665 1,508 1,378 1,279 1,214\nPV COC = 56 46 35 24 12\nIBV = 1,609 1,462 1,343 1,255 1,201\n(iv) Embedded Value\nEV = AMW + IBV\nANW = Req Capital + Free Surplus\nANW = Required Capital in all years as Free Surplus is always zero.\nANW = 300 290 280 270 260\nEV = 1,909 1,752 1,623 1,525 1,461\n(c) Critique the following statements. Justify your answers.\nA. A going concern valuation captures only the value of all the tangible\nassets that are reflected on the seller’s balance sheet.\nB. For public companies, the actuarial appraisals developed by the seller are\nusually done on a US GAAP accounting basis.\nC. The assumptions underlying the seller’s actuarial appraisal analysis are\nintended to be moderately adverse to be conservative.\nD. If embedded value assumptions are the same as actuarial appraisal\nassumptions and the same discount rates are used for both, then the\nactuarial appraisal value is the sum of embedded value and the value of\nfuture business.\nCommentary on Question:\nCandidates did generally did well on this part of the question.\nILA LFMU Spring 2024 Solutions Page 36\n\n--- Page 37 ---\n",
        "commentary": ""
    },
    {
        "question_id": "8",
        "solutions": "Continued\nA. False. A going concerning valuation captures the value of certain\nintangible assets that are not reflected on the seller's balance sheet.\nB. False. Actuarial appraisals are typically done on a statutory accounting\nbasis rather than GAAP (although the GAAP impact of the transaction\nmay be studied as part of the due diligence work).\nC. False. The assumption underlying the actuarial appraisal analysis are\nintended to be best estimate (i.e., without margin for conservatism).\nD. True. EV and AAV usually differs in three ways: (1) actuarial appraisals\ntypically assign a value to the contribution of future new business whereas\nEV does not, (2) actuarial appraisals are typically calculated using higher\ndiscount rates than EV, and (3) expense assumptions used in calculating\nEV are typically more company specific than those used in actuarial\nappraisals, where the assumptions tend to be more reflective of the\nprevailing sentiment of the market.\nILA LFMU Spring 2024 Solutions Page 37\n\n--- Page 38 ---\n",
        "commentary": ""
    },
    {
        "question_id": "9",
        "solutions": "Learning Objectives:\n6. The candidate will understand the fundamental features of the U.S. and\nInternational regulatory framework.\nLearning Outcomes:\n(6a) The features of the U.S. regulatory regime and the forces which are shaping the\nevolution of the regime.\n(6c) The valuation methodology specified in IFRS 17.\nSources:\nLFM-857-24: Insurance Contracts First Impressions: 2020 Edition IFRS 17, KPMG, July\n2020 (only Sections 1.1-1.2, 3.1, 5.1-5.3, 6.1-6.4, 14.1-14.2, 15.1-15.2, 17.1-17.3, 20.1)\nBridging the GAAP: IFRS 17 and LDTI Differences Explored, Financial Reporter, July\n2022\nCommentary on Question:\nThis question tested the candidates’ understanding of the IFRS17 general measurement\nmodel (GMM).\nSolution:\n(a) You are given the following information on a block of 5-year term life insurance\npolicies:\nAnnual premium 5\nInterest rates 0%\nDecrements 0\nPolicies sold 10\nTotal maintenance expenses per year 25\nTotal claims per year 10\nTotal risk adjustment per year 5\nCalculate the IFRS 17 liability components on initial recognition. Show all work.\nILA LFMU Spring 2024 Solutions Page 38\n\n--- Page 39 ---\n",
        "commentary": ""
    },
    {
        "question_id": "9",
        "solutions": "Continued\nCommentary on Question:\nThis part of the question tested the candidates’ understanding of each liability\ncomponent under the GMM. Candidates had to demonstrate the mechanism of\nCSM that is used to defer profits over the life of the contract and understand that\nno profit will be recognized on initial recognition while losses will be recognized\nimmediately. All calculations were required to receive full credit. Some\ncandidates failed to recognize that the premium provided is an annual premium\nper policy and that the claims, expenses and risk adjustment provided are annual\namounts for all policies, which ended up in an onerous contract. Some candidates\nonly included the risk adjustment for the first year. Also, some candidates failed\nto calculate the total liability of zero on initial recognition for the profitable\ncontract.\n• The contract is a 5-year contract and hence will need to show 5-year\ncashflow stream.\n• The annual premium is per policy and should multiply by 10 to get to the\ntotal annual premium of 50.\n• Since there is no decrement with 0% interest rate, the PV calculation at\ntime 0 is simply the total of 5-year cashflows.\nInflow Outflow Outflow\nYear Premium Maint Exp Claims Risk Adjustment\n1 50 25 10 5\n2 50 25 10 5\n3 50 25 10 5\n4 50 25 10 5\n5 50 25 10 5\n• Best Estimate Liability (BEL) = PV of Outflow – PV of Inflow\nPV of Outflow = 25*5 + 10*5 = 175\no\nPV of Inflow = 50*5 = 250\no\nBEL = 175 – 250 = -75\no\n• Fulfillment Cashflow (FCF) = BEL + Risk Adjustment (RA)\nRA = 5*5 = 25\no\nFCF = -75 + 25 = -50\no\nILA LFMU Spring 2024 Solutions Page 39\n\n--- Page 40 ---\n",
        "commentary": ""
    },
    {
        "question_id": "9",
        "solutions": "Continued\n• Contractual Service Margin (CSM) = max(0, -FCF)\nCSM = max(0, -(-50)) = 50\no\n Optional explanations:\n• If a contract is profitable (ie. FCF < 0), CSM is\nmeant to offset the FCF so that no profit is\nrecognized at time 0.\n• If a contract is onerous (ie. FCF > 0), CSM will be\n0 and a loss component will be established as the\namount of FCF, which will be immediately\nrecognized as a loss at time 0.\n• Insurance Contract Liability (ICL) = BEL + RA + CSM\nICL on initial recognition = -75 + 25 + 50 = 0\no\n(b) Compare and contrast IFRS 17 and LDTI in each of the following areas:\n(i) level of aggregation\n(ii) financial statements presentation\n(iii) earnings emergence for profitable and unprofitable business\nCommentary on Question:\nMost candidates demonstrated a good understanding on the level of aggregation\nand the differences in financial statements presentations between the two\nstandards. However, most candidates failed to identify the similarity on financial\nstatements presentations. Some candidates were able to identify similar or\nuniform earnings emergence on profitable contracts, but failed to comment on the\ndifferences in earnings emergence for unprofitable contracts (particularly first-\nyear versus renewal years). Instead, they commented on the grouping of\nprofitable vs unprofitable contracts, which should have been part of the level of\naggregation differences.\n(i) Level of aggregation\nSimilarities:\n• Under both IFRS 17 and LDTI, contracts are grouped (or cohorted)\nwith like contracts and business that is managed together.\n• Both standards do not allow the grouping of contracts issued more\nthan one year apart.\nILA LFMU Spring 2024 Solutions Page 40\n\n--- Page 41 ---\n",
        "commentary": ""
    },
    {
        "question_id": "9",
        "solutions": "Continued\nDifferences:\n• Under IFRS 17, groups are required to be further divided based on the\npotential to become onerous (i.e., unprofitable); whereas under LDTI,\nthe groupings are not required to be split based on onerousness or\nlikelihood to become onerous.\n• Grouping based on onerousness could have a significant impact on\nfinancials. Unlike IFRS17, LDTI allows the profitable block to\n“subsidize” the unprofitable block. IFRS 17 requirement to split\nonerous contracts from other contracts is more punitive to earnings.\n(ii) Financial statements presentation\nSimilarities:\n• A key focus of both the standards is to increase transparency for users\nof financial statements. Under both LDTI and IFRS 17, additional\ndisclosures have been introduced.\n• Both standards allow reporting of the change in discount rates under\nOther Comprehensive Income (OCI). However, under IFRS17,\ncompanies have the option to elect OCI or to flow through P&L.\nDifference:\n• IFRS 17 income statement aims to improve transparency on sources of\nearnings by splitting profit and losses into two categories, amounts\ndriven by “insurance service” or underwriting results (i.e., premiums,\nclaims, and directly attributable expenses) and amounts driven by\n“financial” or investment/overhead results (i.e., investment income\nand non-directly attributable expenses), not something easily\nachievable under LDTI.\nOR\nUnder IFRS 17, the financial statements presentation is following:\n• Insurance Service Result = Insurance Service Revenue –\nInsurance Service Expense\n• Net Financial Result = Investment Income – Insurance Finance\nExpense\n• Net Income = Insurance Service Result + Net Financial Result\n• Comprehensive Income = Net Income + Other Comprehensive\nIncome\nILA LFMU Spring 2024 Solutions Page 41\n\n--- Page 42 ---\n",
        "commentary": ""
    },
    {
        "question_id": "9",
        "solutions": "Continued\nPremium is not a component of Insurance service revenue. The\namortization of CSM and RA is the component of Insurance service\nrevenue in IFSR17\nUnder LDTI, the financial statements presentation is following:\n• Revenues = Premiums + Investment Income\n• Expenses = Benefits + Expenses + other\n• Net Income = Revenues – Expenses\n• Comprehensive Income = Net Income + Other Comprehensive\nIncome\n(iii) Earnings emergence for profitable and unprofitable business\nSimilarity:\n• For a profitable group of contracts, the net liability run-off and profit\nemergence for IFRS 17 and LDTI are very similar. Both accounting\nmodels set up a reserve for future policyholder benefits and recognize\nupfront costs over the life of the policy as insurance services are\nrendered, leading to largely uniform profit emergence.\nDifferences:\n• Under IFRS 17, profit is attributable to the release of the Risk\nadjustment and CSM as well as investment income earned . Under\nLDTI, profit from insurance cash flows is a function of premiums\n(given the net premium reserve approach) and the amortization of\nDAC .\n• For unprofitable business, earnings emergence diverges between the\ntwo accounting models.\nAll else equal, the initial reserve increase will be more punitive\no\nunder IFRS 17 than that under LDTI, due to the inclusion of\nthe RA as well as (presumably) additional expenses in the\nliability calculation under IFRS 17.\nThe higher initial reserve increase for IFRS 17 leads to a larger\no\nnegative impact to income upfront, with future profits slightly\nhigher under IFRS 17 as the additional liability is released over\ntime.\nILA LFMU Spring 2024 Solutions Page 42\n\n--- Page 43 ---\n",
        "commentary": ""
    },
    {
        "question_id": "9",
        "solutions": "Continued\n(c) Critique the following statements under IFRS 17:\nA. A contract is considered as an insurance contract only if it exposes the\ninsurers to both insurance and financial risks.\nB. An insurance risk is not considered significant if the insured event is\nextremely unlikely to occur and if there is minimal probability of\nsignificant losses for a group of contracts.\nC. Insurance risks are risks that are related to an insurance contract, such as\ndeath, illness, or lapsation.\nD. Contractual service margin (CSM) from a profitable direct contract can\nbe used to offset the losses from another contract that is determined to be\nonerous at initial recognition and in subsequent measurements.\nCommentary on Question:\nCandidates have to state whether the statement is correct, incorrect, or partially\ncorrect to receive full credit.\nCandidates generally did well critiquing statements A and D. For statement B,\nmost candidates failed to comment on the risk significance and instead\ncommented on how a risk will be considered as insurance risk based on the risk\nlikelihood. For statement C, most candidates were able to identify that lapsation\nis not an insurance risk but failed to justify.\nA. The statement is incorrect. A contract is considered as insurance contract\nif it exposes the issuer to significant insurance risks without financial risk,\nor to both financial risk and significant insurance risks. Contracts that\nexpose the issuer only to financial risk but not to significant insurance risk\nare not considered as insurance contracts.\nB. The statement is incorrect. Insurance risk can be significant even if the\ninsured event is extremely unlikely to occur, or if the expected probability-\nweighted present value of the contingent cash flows is a small proportion\nof the expected probability-weighted present value of all of the remaining\ncontractual cash flows.\nILA LFMU Spring 2024 Solutions Page 43\n\n--- Page 44 ---\n",
        "commentary": ""
    },
    {
        "question_id": "9",
        "solutions": "Continued\nOR\nThe significance of insurance risk is assessed on a contract-by-contract\nbasis. Even if there is a minimal probability of significant losses for a\nportfolio or group of contracts, insurance risk can be significant for an\nindividual contract.\nC. The statement is incorrect. Unexpected death or illness are valid\ninsurance risks, as they pose adverse effects on the policyholders.\nHowever, ‘lapse or persistency risk’ is not considered an insurance risk\nbecause the payment to the policyholder is not contingent on an uncertain\nfuture event that adversely affects the policyholder.\nD. The statement is incorrect. At initial recognition, the grouping of\nindividual contracts under IFRS 17 is performed in a way that limits the\noffsetting of profitable contracts against onerous ones. Since profitable\nand onerous contracts won’t be grouped together, no offsetting of profits\nand losses is allowed. The groups are established on initial recognition and\nare not reassessed subsequently.\nHowever, if the two contracts were determined to be profitable at initial\nrecognition and hence grouped together, the CSM established at initial\nrecognition can be used to offset any losses from the same group that arise\nfrom unfavorable change in assumptions or estimates related to future\nservice in subsequent measurements, until the CSM is depleted and the\nexcess will be recorded as loss component.\nILA LFMU Spring 2024 Solutions Page 44\n\n",
        "commentary": ""
    }
]