[
    {
        "question_id": "1",
        "solutions": "Learning Objectives:\n1. The candidate will understand, evaluate and use stochastic, generalized linear,\nmulti-state, projection and transition matrix models. The candidate will\ndemonstrate an understanding of their underlying methodologies, strengths,\nlimitations, and applications.\nLearning Outcomes:\n(1a) With respect to stochastic models:\n• Explain and apply the stochastic modeling methodology, including\nmeasurement metrics (e.g., CTE).\n• Describe and apply the theory and uses of real world versus risk neutral\nassumptions.\n• Describe and apply the techniques of Monte Carlo simulation (including\nvariance reduction and importance sampling).\n• Describe and evaluate Random Number Generator models, and explain their\nuses, advantages, and theory.\n• Describe and evaluate how stochastic models may be used to understand\nmortality and policyholder behavior risks and inform the use of reinsurance.\n• Describe the technique of nested stochastic projections and explain why they\nare needed, and evaluate implementation issues.\nSources:\nStochastic Modeling is on the Rise, Product Matters, Nov 2016\nLAM-135-19: Stochastic Modeling, Theory and Reality from and Actuarial Perspective,\nsections I.A, I.B-I.B.3.a, I.B.4 & I.D-I.D.3\nLAM-138-19: A Practitioner's Guide to Generalized Linear Models, 1.1-1.108, 1.118-\n1.130 & 3.1-3.14\nBeware of Stochastic Model Risk!, Stroman, Risk & Rewards, SoA, Aug 2019\nCommentary on Question:\nThe question was generally answered well by the candidates. Both correct statement and\nsupporting points are required to receive full credits.\nILA LAM Spring 2024 Solutions Page 1\n\n--- Page 2 ---\n",
        "commentary": ""
    },
    {
        "question_id": "1",
        "solutions": "Continued\nSolution:\n(a) Critique the following statements regarding stochastic modeling:\nA. Stochastic models should only be used when it is explicitly required by a\nregulatory standard.\nB. Real-world scenarios cannot be connected with risk-neutral scenarios due\nto different usage of expected cash flows and a discount rate.\nC. For nested stochastic modeling, real-world scenarios and risk-neutral\nscenarios should be used for inner-loop and outer-loop, respectively.\nD. When using a random number generator, a true random number\ngenerator is more efficient than a pseudo random number generator.\nCommentary on Question:\nFull credits are given for candidates providing reasonable support for their\nanswers.\nA. False\nStochastic models can also be used to perform tail risk analysis, calculation of\ndiversification effects, risk adjusted strategies.\nB. False\nRisk-adjusted cash flows are adjusted in such a way as to ensure that the\nexpected PV of CF's between two are consistent, Two scenarios can be\nconnected via the use of deflators.\nC. False\nThe fund returns and interest rates driving the fixed and variable account\nbalances of the policy should be generated with real-world outer scenario.\nThe fair-market value of liabilities under market-consistent risk-neutral inner\npaths must be determined at selected periods.\nD. False\nIt is more desirable to use Pseudo Random Number Generator (PRNG) than\nTrue Randon Number Generator (TRNG) when one is doing stochastic\nsimulations, PRNGs are much more efficient, meaning that the amount of\ntime required for them to generate large sets of numbers is small compared to\nTRNGs.\nILA LAM Spring 2024 Solutions Page 2\n\n--- Page 3 ---\n",
        "commentary": ""
    },
    {
        "question_id": "1",
        "solutions": "Continued\n(b) A Generalized Linear Model (GLM) is due for an update. The following data is\nprovided regarding claim severity:\nSmoker Non-smoker\nMale 900 500\nFemale 600 400\nThe form of the GLM is:\nY = β X + β X +β X + ε\n1 1 2 2 3 3\nWhere:\nβ= Parameter for Male\n1\nβ= Parameter for Female\n2\nβ= Parameter for Smoking Status\n3\n(i) Solve for parameters β, β and βassuming the error term is normally\n1 2 3\ndistributed with mean zero and variance .\n2\n(ii) Evaluate the limitations of the use of a noσrmal error structure.\nCommentary on Question:\n(i)This part is generally not answered well. Full credits were granted to candidate\nwhere the formula was shown and calculated correctly. Few candidates showed\nfinal answers without description or formula and received partial credits. Partial\ncredits were granted to candidates who described the methodology correctly but\ndid not calculate correctly.\n(ii)Most candidates could answer some limitation of using normal error structure\nto receive partial credits.\n(i)\nY: Parameter Value\nX : Indicator for Male\n1\nX : Indicator for Female\n2\nX : Indicator for Smoking Status where 1 for smoker and 0 for non-smoker\n3\nY = 900 = β+0+β+ ε\n1 1 3 1\nY = 700 = 0+β+β+ ε\n2 2 3 2\nY = 500 = β+0+0+ ε\n3 1 3\nY = 400 = 0+β+0+ ε\n4 2 4\nILA LAM Spring 2024 Solutions Page 3\n\n--- Page 4 ---\n",
        "commentary": ""
    },
    {
        "question_id": "1",
        "solutions": "Continued\nSum of squared errors\n= ε2+ ε2+ ε2+ ε2\n1 2 3 4\n= (900 – β – β)2+ (600 – β – β)2+ (500 – β)2+ (400 – β)2\n1 3 2 3 1 2\nDifferentiate β β and β and solve when setting to zero\n1, 2, 3\nDifferentiate β\n1\nβ +β+β= 1400\n1 3 1\n2β +β= 1400\n1 3\nDifferentiate β\n2\nβ +β+β= 1000\n2 3 2\n2β +β= 1000\n2 3\nDifferentiate β\n3\nβ +β+β+β = 1500\n1 3 2 3\nβ +β+2β= 1500\n1 2 3\nThen\nβ – β= 200\n1 2\nβ = β– 200\n2 1\nβ = 1400 – 2β\n3 1\nβ + β– 200 + 2(1400 – 2β) = 1500\n1 1 1\n-2β = 1500 – 2600 = -1100\n1\nThus,\nβ = 550\n1\nβ = 350\n2\nβ = 300\n3\n(ii)\nThe limitations of the use of a normal error structure:\n• It is difficult to assert Normality and constant variance for response variables.\n• The values for the response variable may be restricted to be positive. The\nassumption of Normality violates this restriction.\n• The variable is a function of the mean. If the response variable is strictly non-\nnegative then intuitively the variable of Y tends to be zero as the mean of Y\ntends to be zero.\nILA LAM Spring 2024 Solutions Page 4\n\n--- Page 5 ---\n",
        "commentary": ""
    },
    {
        "question_id": "1",
        "solutions": "Continued\n(c) Your company uses a normal distribution with constant volatility to project equity\nreturns.\n(i) Describe a drawback of using the normal distribution with constant\nvolatility to project returns.\n(ii) Recommend two possible alternatives to using constant volatility. Justify\nyour answer.\nCommentary on Question:\n(i) The candidate should describe that economic variables have fatter tails and a\nstronger central peak to receive full credits. Partial credits were granted to\ncandidates to answer fatter tails or stronger central peak only.\n(ii) This part is generally done well by the candidates. Most candidates provided\ntwo (different) alternative methods with descriptions to receive full credits.\n(i)\nThe actual variability of most economic variables is better characterized by a\ndistribution with both fatter tails and a stronger central peak than the Normal bell-\nshaped curve.\n(ii)\nStochastic Volatility\nThe Normal distribution is still used, but the volatility parameter is made to\nfollow its own mean-reverting stochastic process over time. When the volatility is\nlower than average in the scenario, values clump toward the center of the\ndistribution. When the volatility is higher than average, relatively more tail values\nare generated. Overall, the ultimate distribution has longer tails and a stronger\ncentral peak.\nRegime Switching\nThe Normal distribution is still used but the model switches between two regimes,\nwhich are characterized by different sets of parameter values for both the\nvolatility and the mean. There is a high-volatility regime and a low-volatility\nregime, typically with different mean values. Switching between regimes results\nin an ultimate blended distribution that can have longer tails and a stronger central\npeak.\nDifferent Underlying Distribution\nThe Normal distribution is abandoned as a model of variability within each time\nstep. A different distribution that has longer tails is used instead. There are many\nchoices for such a distribution.\nILA LAM Spring 2024 Solutions Page 5\n\n--- Page 6 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Learning Objectives:\n2. The candidate will understand and be able to assess issues and concerns common\nto actuarial models and their development and management.\nLearning Outcomes:\n(2a) Describe, explain, and apply the following Model Efficiency concepts:\n• Representative scenarios / Scenario reduction\n• Replicating liabilities\n• \"Cluster Analysis Spatial Approach\"\n(2b) Describe and evaluate the following actuarial modeling best practices:\n• Model risk management\n• Model validation techniques and methods\n• Best practices for assumptions governance\n• Application of Actuarial Standards of Practices\n• Reliance on expert judgment in actuarial modelling\n(2c) Describe, evaluate, and compare implications on modeling organizations,\nprocesses, and best practices because of:\n• Use of open code and closed code models\n• Centralized vs. De-centralized actuarial modeling function\nSources:\nActuarial Modeling Systems: How Open We WANT Them to be vs. How Closed We\nNEED Them to be, The Modeling Platform, Nov 2017;\nReviewing, Validating and Auditing Actuarial Models, Rabin, Cantor, and Marco, Aug\n2015;\nModel Efficiency Study Results, Nov 2011\nCommentary on Question:\nThis question assesses candidates’ ability to assess issues and concerns common to\nactuarial models and their development and management.\nIn part a and part b, most candidates were able to provide their stances and opinions on\nthe questions asked with some level of justifications. Candidates who provided more\nthorough justifications were awarded full credits.\nIn part c, the second statement can be interpreted differently by different candidates.\nAgain, candidates who provided more thorough justifications to their answers received\nfull credits, as compared to candidates who only briefly stated whether they think the\nstatement is correct or incorrect.\nIn part d, most candidates did well as they are able to list out the steps to conduct the\nTransfer Scenario Order technique and calculate runtime reduction % correctly.\nILA LAM Spring 2024 Solutions Page 6\n\n--- Page 7 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Continued\nSolution:\n(a) Critique the following statements about the modeling system at company AH:\nA. The robust documentation the vendor provides should provide sufficient\ndetails for the company to gain understanding of the actuarial calculation\nmethodology programed in the system.\nB. Since the calculations are controlled and locked in, risk of illogical\ncalculation is minimal, and the company can rely heavily on the integrity of\nthe system.\nC. Since vendor coders are professional programmers, they have deep expertise\nin code optimization that results in faster model runs. This gives the company\nvery good control over model efficiency and runtime.\nD. Key-person risk is increased with the platform since only a small group of\nmodelers have a detailed understanding of the model and the history of code\ndevelopment. Parameters can sometimes be cryptic, and workarounds\nincorporated to accommodate rigid aspects of the system.\nCommentary on Question:\nPart a. of the question tests candidates’ knowledge on key aspects of Open vs\nClosed code modeling platforms. Each statement talks about more than one\naspect of the locked-down modeling system provided in the case, and successful\ncandidates were able to identify both aspects and provide reasonable justification\nfor their stances on both aspects. Partial credits were awarded to candidates who\nprovided justifications to only one aspect of their critique. Little credit was\nawarded to candidates who only expressed agreement/disagreement without much\njustification.\nA.\nIt is true that vendor-provided documentation usually provides insights into\ncalculations of actuarial components and technical details for the system’s\nfunctionalities, which is robust and comprehensive.\nHowever, such details may not always be sufficient for users, as it is nearly\nimpossible to document every interaction between variables and calculations for\nthe system. In cases where items that are extremely obscure or rare, it may\nrequire direct communication with the vendor for supporting documentation.\nILA LAM Spring 2024 Solutions Page 7\n\n--- Page 8 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Continued\nB.\nIt is true that risk of illogical calculations for closed systems is low as logics have\nbeen tested across industry users, and closed systems usually have built-in\nfunctions which will warn users when illogical operations are performed.\nOn the other hand, given the lack of transparency behind calculations in the\nclosed system, risk of human error may increase if over-reliance is placed on the\nsystem.\nC.\nIt is true that closed system vendors will hire professional coders who have deep\nexpertise in code and run-time optimizations. This is an advantage of closed\nsystems. The first statement is accurate.\nHowever, a drawback is that customers will not have much control over the model\nefficiency outside of what is available in the user interface. The second statement\nis not accurate.\nD.\nClosed models would be less prone to key-person risk and are easier to\nunderstand due to their standardized features, user interfaces, and modeling\napproaches across the industry, which makes them easier to maintain and modify\nby others who have prior knowledge using the modeling platform. The first\nstatement is not accurate.\nHowever, due to the rigid nature of closed models, workarounds may likely be\nimplemented to accommodate companies’ specific needs. In which case,\nparameters can sometimes be cryptic, and this poses additional institutional\nknowledge risk, and which increases key person risk for closed models.\n(b) Identify three areas where additional investigation may be required based on the\nliability static validation result summary above. Justify your answer.\nCommentary on Question:\nPart b. of the question addresses the application of static validation techniques on\na given case.\nMost candidates were able to identify three areas for investigation and speak to\ntheir low validation %’s. Successful candidates were able to provide additional\ncontext on the implication of potential issues and make hypotheses on what might\nbe the causes.\nILA LAM Spring 2024 Solutions Page 8\n\n--- Page 9 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Continued\nOne area of investigation is the policy values for the Fixed Indexed Annuity\n(FIA). Policy values such as count, and premiums are usually expected to be close\nto 100% validation. The fact validation %’s are in the low 90% range may signal\nsome policy data or plans are missing. Missing data will have downstream impact\nto reported values.\nAnother area of investigation is the reported amount for the FIA. Validation %’s\nare in the low 80% for stat and tax reserves and only 78.5% for target surplus.\nWhile the issue with policy values could explain some of the low validation %’s,\nit is also worth investigating why validation %’s are even lower than policy\nvalues. It is possible there are additional issues with calculations, or a more\nmaterial plan is being excluded. Reported amount like reserves and target surplus\nwill influence decisions so it is definitely an area worth investigating.\nFor the Variable Annuity (VA), while validation %’s are close to 100% in tested\nareas, the fact that tax reserves are higher than stat reserves may suggest some\nmodeling errors, given tax reserve should typically be lower than stat reserves.\nVA tax reserve methodology should be further investigated to avoid populating\nmisleading post-tax profit metrics.\n(c) Critique the following statements regarding static validation:\nA. Desired tolerance % should be determined first and be used consistently\nacross all bases.\nB. It is reasonable to expect a model to represent the entire block of business\nwell.\nCommentary on Question:\nPart c. of the question also addresses the application of static validation techniques more\nin terms of setting expectations up front.\nCandidates generally did well for statement A where they recognize the importance to\nestablish some tolerance thresholds upfront but not necessarily at the same level for\nevery aspect.\nFor statement B, different candidates had different interpretations of the statement in\nwhich answers on both sides were observed. Full credits were awarded to candidates\nwho were able to provide sufficient support on their stance for the statement.\nILA LAM Spring 2024 Solutions Page 9\n\n--- Page 10 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Continued\nA. Determining tolerance %s upfront can help to prevent expectation being\ninfluenced by the results. Threshold does not necessarily need to be the same\nacross all bases. Tolerance level for certain items such as counts and units\nshould be tight (close to 100%) and more flexible tolerance %s should be used\nto for larger or more significant plans.\nB. One may expect the model to represent the entire block of business well in the\nmost ideal situation. In reality, there are often edge cases due to complex and\nobscure product features, special case policies which a subset of the business\ncannot be modelled accurately and requires manual approximations. It is more\npractical to have an expectation that some plans might not be well represented\nby the model in static validation, and that is when different validation\nthreshold across different bases become useful.\n(d) Company AH uses a stochastic model to model the asset risk for this annuity\nblock. Management is implementing the Transfer Scenario Order model\nefficiency technique to reduce runtime on a CTE 70 calculation.\n(i) List the steps needed to use this technique.\n(ii) Calculate the runtime reduction percentage achieved based on the data\nprovided below:\nPolicies Scenarios Runtime (h)\nOriginal 25,000 1,000 380\nNew Run 1 1,250 1,000 19\nNew Run 2 20,000 400 152\nCommentary on Question:\nPart d of the question tests candidates’ knowledge on establishing and measuring\nmodel efficiency through the Transfer Scenario Order technique. Candidates\ngenerally did well in (i) where they could clearly lay-out the steps of applying\nsuch technique.\nMost candidates also did well in (ii) which they recognize how much runtime the\nnew Run1 and Run2 cost, how much runtime can be saved compared to the\noriginal run, and what’s the runtime saving as a percentage of the original\nruntime. Candidates who only calculated new runtime as a % of the original\nruntime instead of % reductions were only awarded partial credits. Some\ncandidates recognized that Run2 did not run on all 25,000 policies and scaled-up\nRun2’s runtime proportionally. Full credits were also awarded in this case to\ncandidates who were able to properly compare the new runtime vs original\nruntime and accurately calculate % runtime savings.\nILA LAM Spring 2024 Solutions Page 10\n\n--- Page 11 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Continued\ni.\nNew Run 1 is to select potential most adverse scenarios to approximate the CTE\n70 calculation.\n1. Select a random 5 percent (or 10 precent, or small subset) of policies.\n2. Run these policies through the full set of scenarios (1,000 in this case).\n3. Order the results, and identify the worst 40% of scenarios (or worst 400\nscenarios) The 400 scenarios is a mix of 300 worst scenarios plus small buffer of\n100 additional scenarios in case worst scenarios might switch when running full\nlist of policies.\nNew Run 2 is to approximate the CTE 70 measure with all policies using the\nworst 400 scenarios identified.\n4. Run the full set of policies through the 400 scenarios identified.\n5. Order the results and calculate the final CTE70 based on the worst 300 out of\nthe 400 scenarios that were run (this can be viewed as a CTE25 of the new\nscenario set).\nii.\n1 - (Total runtime using new technique) / Original = Runtime Reduction\nwhere Total runtime using new technique = New Run 1 + New Run 2\nRuntime reduction % = 1 - ( 19 + 152 ) / 380 = 0.55 or 55%\nILA LAM Spring 2024 Solutions Page 11\n\n--- Page 12 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "Learning Objectives:\n3. The candidate will understand the principles of Asset-liability Management\n(\"ALM\"), and be able to describe and evaluate various techniques for addressing\nthe mitigation of risk.\n5. The candidate will understand the role of the Investment Actuary and the\nPortfolio Management Process in the Life Insurance company context, as well as\nthe common forms of Fixed income securities and their uses, and the methods and\nprocesses used for evaluating portfolio performance and asset allocation.\nLearning Outcomes:\n(3a) With respect to Asset-Liability Models:\n• Describe and apply the fundamental elements of the theory and practice of\nALM in an insurance company, including assessing the dangers of\nmismatched assets and liabilities.\n• Describe and demonstrate how ALM can be used to identify and manage\nproduct and asset risks, including:\nMajor product risks for which ALM can be a useful tool for their\no\nmanagement.\nUsing ALM as a means to manage interest rate risk, equity risk, and risks\no\nfrom optionality.\n• Describe how common insurance contracts and variations generate embedded\noptions in an insurer's balance sheet, and assess basic strategies for managing\nexposures created by such embedded options.\n• Describe and apply the basic concepts of cash flow matching, immunization,\nduration/convexity matching, segmentation.\n• Describe and apply Key Rate Durations (KRD) and their use in evaluating\ninterest rate sensitivities of portfolios, including understanding the derivation\nof KDRs, the profiles of KDRs for selected major asset types, and assessing\nKRDs in a portfolio context.\n• Describe and evaluate the Goldman Sachs' ALM/Strategic Asset Allocation\napproach for integrating ALM into an enterprise's risk and financial\nmanagement framework.\n• Describe and evaluate ALM modeling considerations in the context of\nmodeling risk aggregation, dependency, correlation of risk drivers and\ndiversification.\n(3b) With respect to asset adequacy analysis and cash flow testing, describe and\nevaluate actuarial practice with respect to:\n• Modeling and selecting assets and related assumptions (incl. modeling assets\nwith contingent cash flow risks).\n• Handling liability cash flow contingencies and risks.\n• Setting up projection model parameters and assumptions.\n• Describe how Interest Rate Forwards and Futures and Swaps can be used in\nALM, and apply the mathematics in given situations.\nILA LAM Spring 2024 Solutions Page 12\n\n--- Page 13 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "Continued\n(5f) Describe and apply methods and processes for evaluating portfolio performance,\nincluding performance attribution, sources of earnings analysis on investment\nincome, benchmarks, metrics, and risk adjusted performance appraisals (including\ntotal return vs reported earnings).\n(5k) Describe the role of LIBOR and SOFR in an insurance company investment\nmanagement context.\nSources:\nLAM-146-19: ALM Management of Financial Institutions Ch 16, Tilman, 2003\nLAM-155-23: Secured Overnight Financing Rate (SOFR)\nManaging Investment Portfolios, Maginn, John L. and Tuttle, Donald L., 3rd Edition,\n2007 - Ch.12: Evaluating PortfoliPerformance (section 4)\nManaging Investment Portfolios, Maginn, John L. and Tuttle, Donald L., 3rd Edition,\n2007 - Ch. 3: Managing Institutional Investor Portfolios (section 4.1)\nLAM-156-23: Managing Liquidity Risk, Industry Practices and Recommendations for\nCROs, CRO Forum, 2019\nCommentary on Question:\nThis question is to test students are able to identify the embedded options from an\ninsurance product & the risk arising from such options. They should be able to suggest\nALM strategy accordingly to manage the risk.\nThe last part of the question is to assess whether students are able to calculate investment\nreturn using different metrics.\nSolution:\n(a) Explain how a life insurance product is viewed differently by capital market\npractitioners and actuaries.\nCommentary on Question:\nStudents did quite well on this question. Majority of the students were able to\ndescribe how capital market and actuaries view insurance products differently.\nCapital markets' practitioners view insurance products as a bundle of options\ngranted by the insurance company to its policyholders in exchange for a fee.\nActuarial approach looks at life insurance products as a series of future benefit\npayments / cash outflows.\nILA LAM Spring 2024 Solutions Page 13\n\n--- Page 14 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "Continued\n(b)\n(i) Identify the option(s) granted to policyholders in this annuity product.\nJustify your answer.\n(ii) Assess how changes in the interest rate environment can trigger\npolicyholders to exercise the options described in (i).\nCommentary on Question:\nMost of the students are able to identify how interest rate environment can change\npolicyholders’ behaviour to exercise the options. Full mark is only given if the\nstudent can correctly identify the option associated with each of the product\nfeatures as well as when each option will be exercised\n(i) - The right to deposit additional premium constitutes a call on the value of\nfuture annuity payments. Policyholder have the right to purchase future\ngrowth on fund value at the guaranteed rate.\n- The withdrawal option can be viewed as a put on the value of the policy.\nPolicyholder have the right to sell the policy back to the insurer at fund value.\n(ii) - When interest rates are low, policyholders can deposit additional premiums\nfor the purposes of earning a guaranteed return on their premium payment that\nis higher than the prevailing market interest rates.\n- When interest rates are high, policyholders can surrender their policies for a\nreturn of fund value (minus a surrender charge), and reinvest the money in a\nnewer policy that credits a higher rate.\n(c) In response to the volatile interest rate environment, RXZ seeks to better manage\ntheir embedded option risk. As a risk mitigant, RXZ decides to change the fixed\ncrediting rate to a floating rate based on SOFR.\n(i) Describe how LIBOR and SOFR are determined.\n(ii) Contrast the advantages of using LIBOR and SOFR. Justify your answer.\n(iii) Propose two changes in product design RXZ can make to mitigate the\nembedded option risk.\nCommentary on Question:\nPart (i) and part (iii) are done better than part (ii) in general. Full mark is only\ngiven to part (ii) if student can specify the difference between LIBOR and SOFR\nin terms of maturity and currency associated with each. They also need to\nmention SOFR is based on actual transaction and is not easily manipulated.\nILA LAM Spring 2024 Solutions Page 14\n\n--- Page 15 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "Continued\n(i) LIBOR: Determined by calculating the average interest rate at which\nmajor banks around the world borrow from one another.\nSOFR: Determined based on transactions in the Treasury repurchase\nmarket, where investors offer banks overnight loans backed by their bond\nassets\n(ii) LIBOR covers 5 currencies where SOFR is US dollar based only\nLIBOR covers 7 maturities where SOFR is over-night rates only\nSOFR is actual transaction-based with extensive trading data where\nLIBOR is based on surveying global banks instead of using actual data\nand can be easily manipulated.\n(iii) - Adjust / increase surrender charge schedule. This will discourage\npolicyholders from surrendering in exchange for fund value when maker\ninterest rate is higher than the credited rate.\n- Limit the amount of additional deposits each policyholder can make.\nThis will cap XYZ's exposure to unwanted interest rate exposure /\ncommitting to crediting a higher than current interest rate.\n(d) Below is a summary of monthly transactions and account values for a newly\nissued annuity policy:\nTransaction Item Day Value\nInitial deposit 1 100,000\nPolicy charges / fees 1 150\nInterest credited 15 165\nAdditional deposit (after interest crediting) 15 10,000\nInterest credited 30 250\nEnd of period account value 30 110,265\n(i) Calculate the time-weighted investment return on the account for this\nmonth. Show all work.\n(ii) Estimate the money-weighted investment return on the account for this\nmonth. Show all work.\nCommentary on Question:\nVery few students got full mark on this question. Some were not able to\ndifferentiate between time-weighted investment return vs money-weighted\ninvestment return. Some students didn’t use the right period for calculation and\nfailed to identify there are only 2 periods to be used in part (i)\nILA LAM Spring 2024 Solutions Page 15\n\n--- Page 16 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "Continued\n(i)\nDetermine Day 15 fund value: 100,015 before addt'l deposit\n110,015 after addt'l deposit\nApplying formula 12-2, subperiod 1 TWR = [100,015-(100,000-150)]/(100,000-150) = 0.165%\nApplying formula 12-2, subperiod 2 TWR = (110,265-110,015)/110,015 = 0.227%\nChain link: TWR for the period = (1+subperiod 1 return)*(1+subperiod 2 return)-1 = 0.393%\n(ii)\nApply formula 12-5:\n110,265 = (100,000-150)*(1+r)^1 + 10,000*(1+r)^(1/2)\nDetermined by trial & error or using IRR function is excel, r is approximately 0.396%.\nILA LAM Spring 2024 Solutions Page 16\n\n--- Page 17 ---\n",
        "commentary": ""
    },
    {
        "question_id": "4",
        "solutions": "Learning Objectives:\n3. The candidate will understand the principles of Asset-liability Management\n(\"ALM\"), and be able to describe and evaluate various techniques for addressing\nthe mitigation of risk.\nLearning Outcomes:\n(3a) With respect to Asset-Liability Models:\n• Describe and apply the fundamental elements of the theory and practice of\nALM in an insurance company, including assessing the dangers of\nmismatched assets and liabilities.\n• Describe and demonstrate how ALM can be used to identify and manage\nproduct and asset risks, including:\nMajor product risks for which ALM can be a useful tool for their\no\nmanagement.\nUsing ALM as a means to manage interest rate risk, equity risk, and risks\no\nfrom optionality.\n• Describe how common insurance contracts and variations generate embedded\noptions in an insurer's balance sheet, and assess basic strategies for managing\nexposures created by such embedded options.\n• Describe and apply the basic concepts of cash flow matching, immunization,\nduration/convexity matching, segmentation.\n• Describe and apply Key Rate Durations (KRD) and their use in evaluating\ninterest rate sensitivities of portfolios, including understanding the derivation\nof KDRs, the profiles of KDRs for selected major asset types, and assessing\nKRDs in a portfolio context.\n• Describe and evaluate the Goldman Sachs' ALM/Strategic Asset Allocation\napproach for integrating ALM into an enterprise's risk and financial\nmanagement framework.\n• Describe and evaluate ALM modeling considerations in the context of\nmodeling risk aggregation, dependency, correlation of risk drivers and\ndiversification.\n(3b) With respect to asset adequacy analysis and cash flow testing, describe and\nevaluate actuarial practice with respect to:\n• Modeling and selecting assets and related assumptions (incl. modeling assets\nwith contingent cash flow risks).\n• Handling liability cash flow contingencies and risks.\n• Setting up projection model parameters and assumptions.\n• Describe how Interest Rate Forwards and Futures and Swaps can be used in\nALM, and apply the mathematics in given situations.\nILA LAM Spring 2024 Solutions Page 17\n\n--- Page 18 ---\n",
        "commentary": ""
    },
    {
        "question_id": "4",
        "solutions": "Continued\nSources:\nLAM-153-23: Managing your Advisor: A Guide to Getting the Most Out of the Portfolio\nManagement Process\nLAM-140-19: Asset Adequacy Analysis Practice Note, 2004 , questions: 3, 5, 10-16, 18-\n20, 27, 29-31, 39, 42-60, 65-68, 71-82, 85 & 89\nLAM-147-19: ALM Management of Financial Institutions Ch 2, Tilman, 2003\nCommentary on Question:\nCommentary listed underneath question component.\nSolution:\n(a) Evaluate if the bullet structure is appropriate for managing asset liability\nmismatch risk. Recommend changes if needed. Justify your answer.\nCommentary on Question:\nThe question tested candidates’ understanding of different asset allocation\nstrategies and their ability to recommend an appropriate portfolio structure for a\nfixed deferred annuity product. Most candidates understood the bullet structure\nand its limitations. However, many did not fully recognize that fixed deferred\nannuities have uncertain liability cash flows, making a laddered portfolio\nstructure more appropriate.\nABC is currently using a \"bullet\" structure. It is a cashflow-matching technique\nwhere asset cashflows are concentrated at the point of liability cashflows. A\n\"bullet\" structure is only appropriate to support products with fixed benefit\npayments such as GIC's or payout annuities.\nBullet structure is not appropriate for fixed deferred annuity because the liability\ncashflows are uncertain. Therefore, cash matching does not eliminate asset\nliability management mismatch risk.\nThe \"laddered\" strategy is better for the fixed deferred annuity because the\nliability cashflows are uncertain due to the existence of policyholder behavior.\nSince the liability cashflows are uncertain, cash-matching cannot eliminate\nasset/liability mismatch risk\nILA LAM Spring 2024 Solutions Page 18\n\n--- Page 19 ---\n(b) Critique the following proposals from ABC’s management:\nA. Given ABC’s high credit rating, the annuities we sell also carry the same\nhigh rating. By investing the annuity premiums in junk bonds, we have\neffectively arbitraged a spread on the transaction.\nB. For modeling simplicity, we can use the same credit rating transition to\nproject default losses for both investment-grade and high-yield bonds.\nC. We should include defaulted bonds in asset modeling.\nD. We can take advantage of falling interest rates by selling older, higher\nyielding bonds to realize the gains and help boost our reported earnings.\nCommentary on Question:\nThis question aimed to test candidates understanding of general principles of\nasset liability management and asset adequacy analysis, requiring them to\nprovide evaluations under different proposals. For Part C, both Yes and No\nanswers will receive full credit as long as correct justification is provided. While\ncandidates generally performed well on Part A and C, but struggled with Part B\nand D. Some common mistakes include:\nA. failed to provide a specific definition of arbitrage as risk free profit\nB. not clearly differentiated the rate transition of default loss for high-quality\nbonds and junk bonds\nC. lacked the correct justification for including or excluding default bonds in\nCFT\nD.\noverlooked the constraints on asset sales from accounting considerations\nA) The proposal is incorrect.\nArbitrage is risk free profit. This strategy does not achieve arbitrage. Instead the\nrisk of the short AAA/long junk position is amplified by numerous options\noffered to holders of the deferred annuities and the option to default on the low\ngrade bond. There is no free lunch and there is no free spread margin. ABC must\naccept increased risk in the form of variance of returns or otherwise in order to\nachieve the spread.\nB) The proposal is incorrect.\nThe default loss trend is different between high-quality bonds and junk bonds. For\nhigh-quality bonds, this transition effect will increase default losses over time. For\nlow-quality bonds, default loss rates may actually decrease over time for the\nremaining bonds that survived the higher default rates of the earlier years of a\nprojection.\nILA LAM Spring 2024 Solutions Page 19\n\n--- Page 20 ---\n",
        "commentary": ""
    },
    {
        "question_id": "4",
        "solutions": "Continued\nC) The proposal is correct to include defaulted bonds.\nFor bonds in default, no coupon payments are typically included in cash flow\ntesting. The market value of bonds in default is indicative of the recovery\nexpected and reflects the expected amount of recovery, as well as the uncertainty\nin the recovery amount, through the implied discount rate.\nThe proposal is correct not to include defaulted bonds.\nFor practical purposes, a defaulted instrument is akin to an equity investment and\nis subject to the modeling difficulties that are present in equities—factors that are\nreflected in the volatility of market values for defaulted bonds and their sensitivity\nto economic conditions. For the same reasons that many actuaries do not include\nequities in their cashflow testing, they sometimes do not include defaulted bonds.\nD) The proposal is incorrect.\nUnder US statutory accounting, realized capital gains are spread over the\nremaining life of the original asset via the Interest Maintenance Reserve (IMR).\nThe original intent of the IMR was to prevent insurers from taking advantage of\nfalling interest rates to boost reported profits by selling older, high yielding bonds\nat a gain and reinvesting at a lower rates, in a way \"fronting\" the profits of that\nblock of business.\n(c) ABC is considering reinsuring a few large blocks of business via a modified\ncoinsurance agreement.\n(i) Assess whether CFT should be performed on the reinsured blocks. Justify\nyour answer.\n(ii) Recommend whether the reserves of the reinsured blocks should be\nincluded in the asset adequacy analysis when preparing the Actuarial\nOpinion and Memorandum Regulation (AOMR) for ABC.\nCommentary on Question:\nThe question evaluated candidates’ comprehension of how modified coinsurance\nis treated in asset adequacy analysis and cash flow testing. Overall, candidates\nstruggled with this question. Many failed to recognize that actuaries do not have\nto perform CFT on ceded modified coinsurance blocks due to minimal risk.\nHowever, most candidates did acknowledge the importance of including the\nreserves of the reinsurance blocks in the asset adequacy analysis.\nILA LAM Spring 2024 Solutions Page 20\n\n--- Page 21 ---\n",
        "commentary": ""
    },
    {
        "question_id": "4",
        "solutions": "Continued\n(i) Even though ABC still holds the reserve balance and assets on its balance\nsheet there is no risk (or minimal asset risk) present for the ceded block.\nTherefore recommend that ABC not perform CFT on the ceded modified\ncoinsurance block. Although the ceding company does not have to\nperform CFT on ceded modified coinsurance, actuaries should review the\nCFT work done by the assuming company to confirm that the risk to the\nceding company is indeed minimal.\n(ii) Regardless of whether ABC performs CFT on the ceded modified\ncoinsurance blocks, the reserves should be reported in asset adequacy\nanalysis as part of the AOMR. They might be reported in the opinion as\nbeing included in the analysis but as representing minimal asset risk\n(because the risks have been ceded to another company)\nILA LAM Spring 2024 Solutions Page 21\n\n--- Page 22 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "Learning Objectives:\n4. The candidate will understand the basic design and function of Economic\nScenario Generators and Equity Linked Insurance Models.\nLearning Outcomes:\n(4a) With respect to Economic Scenario Generators:\n• Describe the need for ESGs and explain the structure of ESG models and\ncomponents.\n• Describe and apply basic default free interest rate models, including one-\nfactor continuous time models.\n• Assess the propriety of a particular ESG model and related assumptions for\nparticular applications.\n(4b) With respect to Equity-Linked models:\n• Describe and apply methods for modeling long-term stock returns and certain\nguarantee liabilities (GMMB, GMDB, GMAB).\n• Describe and evaluate the Actuarial and Hedging risk metrics for GMAB and\nGMDB models.\n• Describe and apply methods for modeling Guaranteed annuity options and\nGuaranteed Minimum Income Benefits (GMIB), and EIA guarantees.\nSources:\nEconomic Scenario Generators: A Practical Guide, 2016, Ch . 1, 2, 4.1, 5, 6, 9, 10, 11.1\n& 11.3; LO#4-6 Investment Guarantees Ch 12, Hardy, 2003; LO#4-4 Investment\nGuarantees Ch 7 (pg 115-125), Hardy, 2003.\nCommentary on Question:\nCommentary listed underneath question component.\nSolution:\n(a) Critique the following statements:\nA. Interest rate modeling is not as complex as stock price modeling as the\nterm structure of interest rates only requires modeling a single variable.\nB. It is not sufficient to treat the risk-free rate as a fixed parameter. An ESG\nthat is being used for the management of variable annuity risk would need\nto include model dynamics that capture the path wise features of interest\nrates.\nC. Arbitrage-free models are a necessary requirement when one wants to\napply an ESG to real-world scenarios. If the scenarios are not arbitrage-\nfree, then one cannot consistently price derivatives.\nD. Only risk-neutral scenarios are used for hedging variable annuities.\nILA LAM Spring 2024 Solutions Page 22\n\n--- Page 23 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "Continued\nCommentary on Question:\nThis question tested the candidate’ knowledge of interest rate and stock price\nmodeling under real-world and risk neutral scenarios. Candidates generally\nperformed well across all four parts.\nA) Not correct - Interest rate modeling is more complex than stock price\nmodeling. The reason is that the term structure of interest rates requires\nmodeling a curve rather than a single variable, and the no-arbitrage principle\nconstrains the possible outcomes.\nB) Correct - The path-wise nature of interest rates and equity market returns are\nimportant considerations in hedging risks associated with underwriting\ninvestment guarantees.\nC) Partially Correct - If ESG models are applied in real-world modeling contexts,\nthen these models should be able to capture return behavior and market\ndynamics but do not necessarily have to be technically arbitrage-free.\nArbitrage-free models are a necessary requirement when one wants to apply\nan ESG to risk-neutral pricing problems. If the scenarios are not arbitrage-\nfree, then one cannot consistently price derivatives.\nD) Not correct - Hedging of variable annuities is a standard example in which\nreal-world and risk-neutral scenarios are applied together. The real-world\nsimulation is used to assess the overall risk of the variable annuity book and to\nmeasure the effectiveness of the hedging strategy. Since the liabilities\nassociated with the variable annuity book are complicated, closed-form\nformulas are not available, and risk-neutral scenarios must be used to price the\nvariable annuity book at each node of the real-world simulation.\n(b) Describe the purpose of establishing Stylized Facts prior to the development of\nthe ESG.\nCommentary on Question:\nThis question tested the candidates’ knowledge of stylized facts. To receive full\ncredit, candidates were required to demonstrate an understanding of stylized facts\nand clearly indicate reasons for establishing stylized facts prior to the\ndevelopment of the ESG. A common mistake was to list benefits of stylized facts\nbut neglect to mention how they are used in the development of the ESG.\nStylized facts refer to generalized interpretations of empirical findings that\nprovide a basis for consistent understanding of markets or economic drivers\nacross a wide range of instruments, markets and time periods. Stylized facts are\nimportant in guiding the design of an ESG in that they help establish and\nprioritize the properties that the ESG model must have to be useful for a given\napplication. Detailed knowledge of these dynamics is essential for setting ESG\nmodel calibration targets and understanding strengths and weaknesses of various\nESG model frameworks.\nILA LAM Spring 2024 Solutions Page 23\n\n--- Page 24 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "Continued\n(c) Management is not convinced about the use of an ESG and recommends using\nanalytical solutions which do not require intensive computation.\nCritique management’s recommendation.\nCommentary on Question:\nCandidates were required to specifically address the recommendation and justify\ntheir position. Many candidates neglected to directly respond to the\nrecommendation and instead simply listed benefits of using an ESG.\nManagement’s recommendation is not reasonable. While utilizing an analytical\nsolution can save time and resources, they can present many limitations.\nImpediments and limitations to analytical solutions:\n• An underlying distribution must be identified and this is often unknown\nor unknowable.\n• The problem involves the use of complex joint distributions.\n• Discontinuities must be incorporated into the analysis.\n• Results require translation or mapping to the desired output.\n• Multiperiod projections are required.\nGiven the complex nature of a variable annuity product and substantial amount of\ntail risk embedded in potential GMxBs, I recommend that the company continue\nto utilize an ESG.\n(d) Calculate the risk neutral probability of the account value increasing by 8% in a\ngiven year.\nCommentary on Question:\nThis question required candidates to demonstrate how to correctly use the risk\nneutral probability formula. Candidates generally did well on this question with\nthe most common mistake being to confuse the probability of an up-move with the\nprobability of a down move.\n• S(0) = 10000\n• S(1)u = 10800\n• S(1)d = 9200\n• R = 3%\n• Prob(Up) + Prob(Down) = 1\n• S(0) * exp(r) = Prob(Up) * S(1)u + Prob(Down) * S(1)d\n• 10000 * exp(.03) = Prob(Up) * 10800 + (1- Prob(Up)) * 9200\n• Prob(Up) = 69.03%\nILA LAM Spring 2024 Solutions Page 24\n\n--- Page 25 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "Continued\n(e) State if the following concepts are illustrated in the model used in part (d). Justify\nyour answer.\n(i) Replication\n(ii) No-arbitrage assumption\n(iii) Risk neutral probability distribution\n(iv) Dynamic hedging\nCommentary on Question:\nCandidates were required to identify that all 4 concepts are illustrated in the risk\nneutral model presented in part (d). Candidates did well on parts (ii) and (iii) but\nstruggled with (i) and (iv)\n(i) Replication is illustrated in the model. Replication is the process of\nfinding a portfolio that exactly replicates the option payoff. I.e. the market\nvalue of the replicating portfolio at maturity exactly matches the option\npayoff at maturity whatever the outcome of the asset. The model in part\n(d) replicates an option payoff through a portfolio of risky and risk-free\nassets.\n(ii) No-arbitrage is illustrated in the model. The no-arbitrage assumption\nstates that 2 identical cash flows must have the same value. As illustrated\nby the model in part (d), the portfolio and option have the same payout.\nBy definition, risk neutral models must adhere to an arbitrage free\nassumption.\n(iii) Risk neutral probability distribution is illustrated in the model. Under the\nrisk-neutral framework, the model is indifferent between two investment\nchoices that have the same expected payoff. These investment choices\nwill always have the same price as evident in the model in part (d).\n(iv) Dynamic Hedging is illustrated in the model. Dynamic hedging involves\ninvesting and rebalancing in risky and risk-free assets to meet potential\nGMxB liabilities at future points in time. In the model in part (d) a\ncombination of risky and risk-free assets can be combined to meet the\nliability of the guarantee.\nILA LAM Spring 2024 Solutions Page 25\n\n--- Page 26 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "Learning Objectives:\n5. The candidate will understand the role of the Investment Actuary and the\nPortfolio Management Process in the Life Insurance company context, as well as\nthe common forms of Fixed income securities and their uses, and the methods and\nprocesses used for evaluating portfolio performance and asset allocation.\nLearning Outcomes:\n(5a) Describe the portfolio management process in an insurance company, and the role\nof Investment Policy, the Investment Actuary, and external portfolio managers.\n(5b) Describe and evaluate how a company's objectives, needs and constraints affect\ninvestment strategy and portfolio construction (including capital, funding\nobjectives, risk appetite and risk return tradeoff, tax and accounting, accounting\nconsiderations, and constraints such as regulation, rating agency ratings and\nliquidity.\n(5c) Describe and assess the role of and significant considerations related to the design\nand function of asset allocation strategies.\n(5h) Describe and apply conventional yield metrics used in bond performance\nevaluation.\n(5i) Describe the attributes of US Treasuries, Agency Debt Securities, Municipal\nbonds, Corporate bonds, Private Money Market securities, Floating Rate\nAgreements, Agency Mortgage Backed securities, Agency Collateralized\nMortgage securities, Interest Rate Swaps and Swaptions, Credit Derivatives and\nHigh Yield Bonds, and the markets they are traded in.\nSources:\nManaging Investment Portfolios, Maginn, John L. and Tuttle, Donald L., 3rd Edition,\n2007 - Ch. 3, Ch. 5 and Ch. 6)\nHandbook of Fixed Income Securities, Fabozzi, Frank J., 9th Edition, 2021 - Ch. 4, Ch.\n7, Ch. 10, Ch. 13, and Ch. 64\nCommentary on Question:\nCommentary listed underneath question component.\nSolution:\n(a)\n(i) Describe the return objectives and risk tolerance for the company’s\ninvestment policy statement.\n(ii) Identify four investment constraints the company should consider when\nmanaging their portfolio.\nILA LAM Spring 2024 Solutions Page 26\n\n--- Page 27 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "Continued\nCommentary on Question:\nFor part (i), candidates generally were able to list return objectives and risk\ntolerances but commonly did not provide any justification and application.\nPartial credit was giving for just listing return objective and risk tolerance\ncorrectly.\nFor part (ii) many students only received partial credit by only listing general\nconstraints and failing to apply and provide an explanation why the company\nshould consider them.\n(i) Return objectives: 1. Earn a sufficient return to fund all policyholder\nliabilities and exceed the expected return used in pricing, including the\nminimum interest guarantee. 2. Increase the value of the company's\nsurplus through capital appreciation to fund future expansion\nRisk tolerance: Needs to ensure all policyholder liabilities can be met.\nBased on recent difficulties senior management is more concerned with\nsolvency than aggressive growth, so risk appetite is fairly low. Consider\ntough competitive environment, capital considerations, asset ratings,\ninterest rate risk, credit risk\n(ii) Liquidity: All policyholder obligations must be met. This includes death\nbenefit, but also timing of possible lapses, policy loans, or universal life\nwithdrawals\nTime horizon: Long term, will establish duration targets for assets in line\nwith liabilities\nRegulatory: Comply with all insurance code in governing location. This\nincludes build up of value within universal life contract\nTax: Monitored to provide most favourable after-tax returns\nReview schedule: reviewed annually by board of directors\nAsset allocation: Asset allocation designed to achieve objectives stated\nabove. Should recognize constraints listed. Need to set asset allocation\nranges and ensure these are met at all times\nRebalancing: Moderate rebalancing frequency (to minimize costs while\nstill address market movement) is required.\nILA LAM Spring 2024 Solutions Page 27\n\n--- Page 28 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "Continued\n(b) The following is the company’s current asset allocation strategy:\nTarget Permissible\nAsset Class\nAllocation Range\nTreasury bonds 25% 20% - 40%\nBonds (municipal and corporate) 25% 20% - 40%\nEquities (domestic, international, and mortgages) 20% 10% - 30%\nCommercial paper 15% 5% - 25%\nCash 15% 5% - 25%\nYour manager believes the asset allocations should be adjusted over time as the\nmarket shifts.\nAssess the asset allocation strategy.\nCommentary on Question:\nCandidates generally performed well on this section. Partial marks were awarded\nfor commenting on overall portfolio allocation, and full marks for those\ncommenting on different assets as well.\nThis allocation breaks one of the key rules of asset allocation, which is that assets\nwithin a class should be homogenous. Need to set separate allocation for each\nunique asset, grouping them reduces effectiveness.\nAn ideal asset allocation should provide sufficient liquidity to ensure that the\npolicyholder obligations can be met.\nTreasury bonds are long term and with disintermediation risk, as their value drops\nwith rising interest rates. This poses a problem when used to back long-term\nliabilities.\nAlthough commercial paper is generally short-term, it is not a reliable source of\nfunding as it is unsecured and lack of secondary market. 15% allocation of CP in\nthe portfolio is too high for the risks they pose.\nWhile cash is very liquid, holding large amount of cash will jeopardize the goal of\nearning more than the expected return as it provides no earning potential\nWhile the overall asset allocation should be reviewed periodically, the goal is not\nto constantly refine the allocations based on short-term market movements. The\nportfolio must be rebalanced if an asset class weight moves outside the\npermissible range. Setting permissible ranges mitigate against systemic risk. By\nallowing them to move frequently it increases the risk faced by the company.\nILA LAM Spring 2024 Solutions Page 28\n\n--- Page 29 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "Continued\n(c) Critique each of the following statements for structuring a portfolio:\nA. You can evaluate and identify assets with misaligned credit ratings to\nbuild a portfolio that will outperform a benchmark.\nB. The assets purchased should be matched to the average duration of the\nliabilities. By doing this, it will protect against all changes in the market\nyield curve.\nC. A portfolio should be built to track a benchmark index. This can reduce\nfees compared to investing in the assets that are part of the index directly.\nGiven it is unlikely the portfolio will perfectly track the index, the focus for\nselecting assets should be on expected returns.\nD. Interest rate swaps can help reduce interest rate risk and improve returns.\nYou can also consider buying forwards for specific points in the future as\nan alternative.\nCommentary on Question:\nCandidates generally performed well on this section. To received full credit,\ncandidates needed to explain why the statement was correct or incorrect.\nA. It's true that you can perform your own credit analysis and potentially beat\nmarket expectations this way. However, leveraging this strategy requires\nactuary with experiences and could be costly to set up without the appropriate\nexpertise\nB. It has been shown that matching the duration of the portfolio to the average\nduration of liabilities is not sufficient to immunize multiple liabilities. Each\nliability should be separately immunized. This strategy, even if employed\ncorrectly, only mitigates against parallel shifts in the yield curve. This will not\nmitigate the risk of a non-parallel shift (twist) of the yield curve\nC. Correct, full replication of an index is costly, so by putting together a simpler\nportfolio it will save on costs\nD. Earnings from an interest rate swap can only happen if you are betting on the\ndirection of the interest rate market. Given the investment actuary believes\nrates will rise this could be leveraged to sell swaps for a gain, but only if that\ninformation is not already known in the market. It could also be costly with\ntransactions fees compared to other approaches. Purchasing forwards is a way\nto replicate an interest rate swap but come with much higher costs and is not a\ngood strategy\nILA LAM Spring 2024 Solutions Page 29\n\n--- Page 30 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "Continued\n(d) The company is evaluating bonds to add to the portfolio that backs a 10-year\nliability. Prevailing market interest rates are increasing and expected to continue\nto rise. You are given the following information:\nCoupon Coupon Term Yield to Maturity\nBond\nRate Frequency (years) Maturity Value\nBond 1 11% Semi-annual 10 5.0% $1,000\nBond 2 7% Semi-annual 20 6.1% $1,000\nBond 3 0% N/A 15 2.2% $1,000\nBond 4 6% Semi-annual 5 8.4% $1,000\n(i) Calculate the price of each bond.\n(ii) Recommend a bond to add to the portfolio from the options above. Justify\nyour answer.\nCommentary on Question:\nMost students did well on the calculation. The most common mistake was not\ncorrectly converting the given annual rates into semi-annual rates for both the\ncoupon and yield to maturity.\n(i)\n𝑇𝑇𝑇𝑇𝑇𝑇𝑇𝑇∗2\n𝐶𝐶𝐶𝐶𝐶𝐶𝐶𝐶𝐶𝐶𝐶𝐶 𝑅𝑅𝑅𝑅𝑅𝑅𝑃𝑃∗ .5∗𝑀𝑀𝑅𝑅𝑅𝑅𝐶𝐶𝑃𝑃𝑃𝑃𝑅𝑅𝑀𝑀 𝑉𝑉𝑅𝑅𝑉𝑉𝐶𝐶𝑃𝑃 𝑀𝑀𝑅𝑅𝑅𝑅𝐶𝐶𝑃𝑃𝑃𝑃𝑅𝑅𝑀𝑀 𝑉𝑉𝑅𝑅𝑉𝑉𝐶𝐶𝑃𝑃\n𝑃𝑃𝑃𝑃𝑃𝑃𝑃𝑃𝑃𝑃 = � 𝑡𝑡 + 𝑇𝑇𝑇𝑇𝑇𝑇𝑇𝑇∗2\n𝑡𝑡=1 (1+𝑌𝑌𝑌𝑌𝑀𝑀∗ .5) (1+𝑌𝑌𝑌𝑌𝑀𝑀∗ .5)\nCalculation for bond 1:\n∑2 𝑡𝑡=0 10. (0 15 .5 0∗ 21 50 )𝑡𝑡00 +(1.1 00 20 50\n)20\n= 1,467.67\nRepeat for bonds 2 through 4.\nILA LAM Spring 2024 Solutions Page 30\n\n--- Page 31 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "Continued\n(ii)\nNormally, the higher the coupon rate and the higher the YTM, the higher the\nreinvestment risk. However, these are less significant in a rising interest rates\nenvironment. Since the yield is expected to rise, it is the most beneficial to invest\nin the short-term asset and reinvest later at a higher rate.\nBased on above, make recommendation on Bond 4\nILA LAM Spring 2024 Solutions Page 31\n\n",
        "commentary": ""
    }
]