[
    {
        "question_id": "1",
        "solutions": "Learning Objectives:\n2. The candidate will understand U.S. financial and valuation standards, principles\nand methodologies applicable to life insurance and annuity products.\nLearning Outcomes:\n(2a) The Candidate will be able to describe U.S. valuation and capital frameworks, and\nexplain their impact on the valuation of reserves, capital and financial statements.\nSources:\nLFM-143-20: Fundamentals of the Principle Based Approach to Statutory Reserves for\nLife Insurance, Rudolph\nLFM-149-21: Insurance Contracts Accounting Guide, PWC, Oct 2019 (Sections 1.1, 3.5,\n5.1-5.4, 5.6; Figures IG 2-1, 2-2)\nCommentary on Question:\nThis question tested the candidates’ knowledge of statutory and GAAP reserving\napproaches through the description of assumptions and calculation of a scenario reserve.\nSolution:\n(a) Describe the assumptions used for the reserve methodologies by completing the\ntable:\nMortality Mortality Lapse\nImprovement\nVM-20 Net Premium\nReserve\nVM-20 Deterministic\nReserve\nLiability for Future\nPolicyholder Benefits\nunder Long Duration\nTargeted Improvements\n(LDTI)\nILA LFMC Spring 2024 Solutions Page 1\n\n--- Page 2 ---\n",
        "commentary": ""
    },
    {
        "question_id": "1",
        "solutions": "Continued\nCommentary on Question:\nThis part of the question requires candidates to describe assumptions that are\nused for various reserve methodologies for universal life with secondary\nguarantee insurance policies under U.S. statutory and U.S. GAAP. To do well on\nthis part, candidates must demonstrate understanding of:\n• the framework of the principle-based approach to statutory valuation\nunder VM-20, and\n• the net premium approach under U.S. GAAP for nonparticipating\ntraditional, long-duration contract liabilities, for which assumptions are\noutlined under ASC- 944-40-30-8\nand be able to apply the frameworks to the assumptions under the respective\napproaches.\nThe key aspects of the various approaches that candidates are expected to identify\nare as follows:\nVM-20 Net Premium Reserve – the assumptions are prescribed, and for lapse the\nlevel of funding of the secondary guarantee must be considered\nVM-20 Deterministic Reserve – the actuary may use their own company\nexperience if credible, otherwise a blend of industry/company data. Mortality\nimprovement is not allowed beyond the valuation date.\nLDTI Liability – the assumptions should reflect the company’s current\nexpectations, which may include use of their own data where credible.\nCandidates were generally able to identify these key aspects and generally did\nwell on this part of the question.\nModel Solution to part (a):\nVM-20 Net Premium Reserve\nMortality\n• Valuation mortality rates are prescribed as the 2017 Commissioner’s\nStandard Ordinary Mortality Table (or later mortality tables adopted by\nthe NAIC)\nMortality Improvement\n• Similar to mortality in that it's prescribed\nILA LFMC Spring 2024 Solutions Page 2\n\n--- Page 3 ---\n",
        "commentary": ""
    },
    {
        "question_id": "1",
        "solutions": "Continued\nLapse\n• Certain universal life policies may utilize prescribed lapse rates where the\nrate of lapse is determined by the level of funding of the secondary\nguarantee\n• Otherwise, no lapses are assumed\nVM-20 Deterministic Reserve\nMortality\n• Assumptions prescribed within VM-20 are limited to certain aspects of the\nmortality assumption, specifically the definition of the industry mortality\ntable, the method used to grade in to this table, the margins to be applied\nto mortality rate to form the prudent estimate mortality assumption\n• If the company’s mortality experience is limited or not available, the\ncompany must use an applicable industry basic table in lieu of company\nexperience\nMortality Improvement\n• VM-20 prohibits use of mortality improvement for periods beyond the\nvaluation date\n• Company experience mortality rates and industry mortality rates can be\nbrought current to the valuation date using mortality improvement factors\nLapse\n• Certain aspects of the lapse rate assumption for universal life with\nsecondary guarantee policies are prescribed, specifically the definition of\nthe industry lapse table\nLiability for Future Policyholder Benefits under Long Duration Targeted\nImprovements (LDTI)\nMortality / Mortality Improvement\n• Mortality assumptions comprise an integral component of the calculation\nof long-duration life insurance contract liabilities and should be based on\nthe company’s view of expected mortality\n• Companies may use their own experience for the mortality assumption,\nwhere credible\nLapse\n• ASC 944-40-30-14 provides that termination assumptions should be based\non estimates of expected terminations and nonforfeiture benefits, using\nexpected termination rates and contractual nonforfeiture benefits e.g., cash\nvalue, paid-up insurance value, or extended-term insurance value\nILA LFMC Spring 2024 Solutions Page 3\n\n--- Page 4 ---\n",
        "commentary": ""
    },
    {
        "question_id": "1",
        "solutions": "Continued\n• Termination rates may vary by plan of insurance, age at issue, year of\nissue, frequency of premium payment, and other factors\n• Composite rates may be used, but only if the rates are representative of the\nentity's actual mix of business\n(b) Calculate the Scenario Reserve given the projected scenario below. Show all\nwork.\nProjection period 0 1 2 3 4 5 6 7 8 9 10\nStatement Value of\nAssets (000s) 20 11 2 (7) (3) 1 5 9 13 17 21\nOne-Year Treasury\nRate (%) 1.34 0.65 0.14 1.03 1.08 0.74 0.59 1.05 0.57 0.48\nCommentary on Question:\nThis part of the question requires candidates to use a cash flow projection model\nto determine a scenario reserve under VM-20. The correct solution follows the\nexample provided in the Fundamentals of the Principle Based Approach to\nStatutory Reserves for Life Insurance. The scenario reserve is determined\nthrough a multi-step process as the greatest present value of the negative of\nprojected statement value of assets.\nCandidates generally did well on this part of the question. Common mistakes\nincluded omission of the 105% multiplier on the treasury rate, neglecting to take\nthe negative of the statement value of assets, and/or assuming a constant interest\nrate across all years instead of calculating the cumulative discount factor as the\nproduct of the previous years’ discount factors. A few candidates calculated the\ndiscount factor as 1-i instead of 1 / (1+i), which is considered an acceptable\nalternate solution with no penalty applied.\nThe excel workbook provided has the detailed calculations for the solution below.\nILA LFMC Spring 2024 Solutions Page 4\n\n--- Page 5 ---\n",
        "commentary": ""
    },
    {
        "question_id": "1",
        "solutions": "Continued\nModel Solution to part (b):\nProjection period 0 1 2 3 4 5 6 7 8 9 10\n(1) Statement Value\n20 11 2 (7) (3) 1 5 9 13 17 21\nof Assets\n(2) Negative\nStatement Value of (20) (11) (2) 7 3 (1) (5) (9) (13) (17) (21)\nAssets\n(3) One-Year\n1.34 0.65 0.14 1.03 1.08 0.74 0.59 1.05 0.57 0.48\nTreasury Rate (%)\n(4) Treasury Rate x\n1.41 0.68 0.14 1.308 1.13 0.78 0.62 1.10 0.60 0.50\n105% (%)\n(5) Discount Factor\n1 0.986 0.993 0.999 0.989 0.989 0.992 0.994 0.989 0.994 0.995\n1 / (1 + (4) )\n(6) Cumulative\n1 0.986 0.979 0.978 09.68 0.957 0.949 0.944 0.933 0.928 0.923\nDiscount Factor\n(7) Discounted\nNegative\nAccumulated (10.85) (1.96) 6.85 2.90 (0.96) (4.75) (8.49) (12.13) (15.77) (19.38)\nDeficiency = (2) x\n(6)\nGreatest Present Value of Accumulated Deficiency (GPVAD) is the maximum of\nthe Discounted Negative Accumulated Deficiencies (7), which is the value from\nperiod 3 = 6.85\nScenario Reserve = Starting Assets + GPVAD = 20 + 6.85 = 26.85\nILA LFMC Spring 2024 Solutions Page 5\n\n--- Page 6 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Learning Objectives:\n1. The candidate will understand and apply pre-IFRS 17 valuation principles to\nindividual life insurance and annuity products issued by Canadian life insurance\ncompanies.\nLearning Outcomes:\n(1a) The Candidate will be able to:\n• The Candidate will be able to describe, apply and evaluate the appropriate\nIFRS 17 accounting and valuation standards for life insurance and annuity\nproducts\n• Compare and apply methods for life and annuity product reserves\n• Evaluate, calculate, and interpret liabilities\n• Recommend and justify appropriate valuation assumptions\nSources:\nCIA Educational Note - Discount Rates for Life and Health Insurance Contracts\nCommentary on Question:\nThis question tested the candidates’ understanding of IFRS 17 discount rates for life and\nhealth insurance contracts.\nSolution:\n(a) Evaluate the impact of each of the following changes to the product features of an\nannual renewable term (ART) product with respect to liquidity characteristics:\n(i) Replace the ART premium structure with a level premium structure\n(ii) Add a term conversion option\n(iii) Add a waiver of premium benefit\n(iv) Add a return of premium rider that refunds 100% of the last three years of\npremiums upon termination\nCommentary on Question:\nCandidates generally did well on this part of the question. To receive full credit,\ncandidates had to identify what the change will do to the exit costs, the inherent\nvalue and the liquidity characteristics of the insurance contract. Many candidates\nprovided accurate comments on how liquidity would change but did not\nconsistently explain the cause by describing changes to exit costs.\nILA LFMC Spring 2024 Solutions Page 6\n\n--- Page 7 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Continued\n(i) A level premium structure and guaranteed premium feature would build\nup the contract's inherent value. This would decrease the liquidity\ncharacteristics of the contract\n(ii) The conversion option and removal of underwriting requirements would\nbuild up the contract's inherent value. This would decrease the liquidity\ncharacteristics of the contract\n(iii) The inclusion of the waiver of premium would build up the contract's\ninherent value. This would decrease the liquidity characteristics of the\ncontract\n(iv) Inclusion of return of premium would create an exit value and increase\nliquidity characteristic of the policy\n(b) A company’s liabilities are backed by a portfolio of 50% Government of Canada\nbonds and 50% corporate A bonds. You are given the following information:\nYield on Government of Canada Bond 5.00%\nCorporate A spread 0.40%\nMortgage-backed securities spread 0.70%\nYield on credit default swaps 5.40%\nAverage market risk premium for equities and real estate 0.50%\nYield on mortgage-backed securities insured by Canada\nMortgage and Housing Corporation 5.30%\nYield on mortgage-backed securities not insured by Canada\nMortgage and Housing Corporation 6.00%\nCalculate the discount rate under the following approaches. Show all work.\n(i) Top-down approach\n(ii) Hybrid approach\nCommentary on Question:\nCandidates generally did not do well on this part of question. Many candidates\nunderstood the correct general formulas to calculate the discount rate under top-\ndown approach, but many candidates calculated the market risk premium and\ncredit premium incorrectly. Many candidates applied incorrect formulas to\ncalculate the discount rate under the Hybrid approach.\nILA LFMC Spring 2024 Solutions Page 7\n\n--- Page 8 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Continued\n(i) Top-down approach\nDiscount Rate = Reference Portfolio Yield - Credit Risk Premium - Market\nRisk Premium\nUse own asset as Reference Portfolio (no other options based on available\ninformation)\nReference Portfolio yield =50% *(Yield on Government of Canada Bond) +\n50% *(Yield on Government of Canada Bond + Corporate A spread) = 50% *\n5.00% + 50% * (5.00% + 0.40%) = 5.20%\nMarket risk premium=0.00%\nLiquidity premium = Yield on mortgage-backed securities less risk-free-rate =\n5.30%- 5.00%= 0.30%\nTotal spread = Corporate A spread = 0.40%\nCredit premium = Total spread - Liquidity premium = 0.40% -0.30%= 0.10%\nDiscount rate = 5.20% - 0.10% -0.00% = 5.10%\n(ii) Hybrid approach\nYield on Government of Canada Bond= 5.00%\nLiquidity premium = 0.30%\nDiscount rate = Risk free + liquidity premium = 5.00% + 0.30% = 5.30%\n(c)\n(i) Explain why an ultimate risk-free rate is needed.\n(ii) Describe the key principles and desirable characteristics when setting the\nultimate risk-free rate.\nCommentary on Question:\nCandidates did well in part (i). but had difficulty with part (ii).\n(i) Duration of cash flows will extend beyond observable period.\nRisk free rates are only observable up to about 30 years.\nBeyond that point, actuary needs to develop an ultimate risk-free rate. (URFR)\nActuary would interpolate from last observable point to URFR\n(ii) Key Principles:\n• Maximize use of observable inputs\n• Reflect current market conditions from the perspective of a marker\nparticipant\n• Use best information available to develop unobservable inputs\n• Place more weight on long term estimates than short-term fluctuations\nILA LFMC Spring 2024 Solutions Page 8\n\n--- Page 9 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Continued\nCharacteristics:\n• Stability: URFR should have less variability than short term rates\n• Smoothness: Interpolation from the observable point to URFR should\nbe smooth\n• Simplicity: easy to understand, implement and forecast\nILA LFMC Spring 2024 Solutions Page 9\n\n--- Page 10 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "Learning Objectives:\n1. The candidate will understand and apply pre-IFRS 17 valuation principles to\nindividual life insurance and annuity products issued by Canadian life insurance\ncompanies.\nLearning Outcomes:\n(1a) The Candidate will be able to:\n• The Candidate will be able to describe, apply and evaluate the appropriate\nIFRS 17 accounting and valuation standards for life insurance and annuity\nproducts\n• Compare and apply methods for life and annuity product reserves\n• Evaluate, calculate, and interpret liabilities\n• Recommend and justify appropriate valuation assumptions\nSources:\nLFM-658-23: Risk Adjustments For Insurance Contracts Under IFRS 17, Chapter 2\n“Principles Underlying Risk adjustments”\nLFM-649-22: IAN 100 Application of IFRS 17 (exclude Section C Chapter 11 and\nSection D), Jan 2019\nCIA Educational Note: Risk Adjustment under IFRS 17\nCommentary on Question:\nThis question tested the candidates’ knowledge on IFRS 17. Candidates generally did\nwell in part a, as they were able to provide explanation and justifications on the\nstatements. Many candidates had difficulty with the calculation for part b.\nSolution:\n(a) Critique the following statements with respect to IFRS 17:\nA. All liability cash flows should be discounted at a rate that reflects the\nvariability of cash flows.\nB. The risk adjustment reflects impacts of aggregation and therefore may\nreduce liability cash flows after accounting for diversification benefits.\nC. Insurance profits under IFRS 17 are calculated and earned at initial\nrecognition.\nD. When the underlying contract uses the variable fee approach (VFA), the\nassociated reinsurance contracts held must also use the VFA to avoid\nmeasurement mismatches.\nILA LFMC Spring 2024 Solutions Page 10\n\n--- Page 11 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "Continued\nE. The premium allocation approach is a simplified alternative to the general\nmeasurement model and can only be used for contracts with coverage\nperiods 12 months or less.\nCommentary on Question:\nCandidates generally did well on this part of the question.\nA. Cashflows that do not vary should be discounted at rates that do not reflect\nvariability.\nCashflows that do vary based on returns on the any financial underlying items,\nshould be discounted at :\n1) Discount rates that reflect the variability\n2) Or cashflows should be adjusted for the effect of the variability and\ndiscounted at a rate that reflects the adjustment made\nNominal cashflows are to be discounted at rates that include the effect of\ninflation. Real cashflows are to be discounted at rates that exclude the effect\nof inflation.\nB. The Risk Adjustment (RA) only adjusts valuation of liabilities where the\nadjustment is positive, otherwise the risk adjustment would be zero. So the\nRA would never reduce liability cash flows. Aggregation does impact the RA.\nDiversification does impact RA.\nC. Expected profits are calculated at initial recognition. Expected profits are\ncalculated at initial recognition. Positive profits are earned over time (not at\ninitial recognition). If profits are negative, the loss is recognized immediately.\nD. Underlying contracts may use the Variable Fee approach, while associated\nreinsurance held contracts are not eligible to use the Variable Fee approach.\nThis can create measurement mismatches due to significant differences in\ntreatment of investment related impacts.\nAn area of possible economic mismatch: For reinsurance contracts held, the\ncontract boundary definition means that the measurement of reinsurance\ncontracts held will typically extend to include cash flows associated with\nfuture projected cessions up to the point at which the reinsurance contract can\nbe exited for new business. The valuation of underlying insurance contracts\nwill not include any cash flows related to these future projected cessions,\nsince the underlying insurance contracts are only valued as written. This\ncreates a mismatch in terms of timing of recognition of cessions versus\nunderlying contracts.\nILA LFMC Spring 2024 Solutions Page 11\n\n--- Page 12 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "Continued\nAn area of possible economic mismatch: For underlying contracts, losses are\nrecognised at inception when contracts are onerous at inception, whereas any\noffsetting net gain on related reinsurance contracts held will be reflected in the\nCSM and recognised over the lifetime of the reinsurance contract held. This\ncan create a mismatch in terms of timing of profit and loss on contracts that\nmay be economically linked (e.g., pricing of underlying contracts frequently\nreflects impact of associated reinsurance, particularly for proportionate\ncoverages).\nE. The described main approach of IFRS 17 is referred to as General\nMeasurement Approach (GMA). IFRS17 allows for a simplified alternative\napproach to be used for contracts of short coverage period (typically not more\nthan 12 months), known as the Premium Allocation Approach (PAA). The\nPAA is similar to the unearned premium method in that the measurement of\nthe liability for remaining coverage of short duration contracts might be\nsimplified by distributing premiums over the coverage period in line with\npassage of time or in proportion to expected benefits. The PAA only applies to\nthe part of the total measurement of the contract referred to as liability for\nremaining coverage, with the liability of incurred claims following the GMA.\n(b) You are given the following about DJS, a Canadian life insurance company:\n• DJS uses the cost-of-capital approach to determine its risk adjustment\n• There are two product lines: life insurance and life annuities.\n• The risk adjustment is calculated from annual cash flows.\nTarget rate of return on capital for life business 6%\nTarget rate of return on capital for annuity business 10%\nDiscount rate 5%\n• Required capital for both life insurance and annuities is given on a quarterly\nbasis over four years in the Excel spreadsheet.\n(i) Calculate the risk adjustment for DJS.\n(ii) Describe the disadvantages of using the cost-of-capital approach for\ndetermining the risk adjustment.\n(iii) Explain why the target return on capital may be different for life insurance\nand annuity contracts.\nILA LFMC Spring 2024 Solutions Page 12\n\n--- Page 13 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "Continued\nCommentary on Question:\nCandidates generally had difficulty with this part of the question. Many\ncandidates did not reflect the weighted average cost of capital and did not\nproperly reflect discount rates.\nPart (i)\nThe solution to this part of the question is in Excel.\nPart (ii)\nRequired Capital for a Canadian insurer is LICAT. LICAT uses a total asset\nrequirement, which may increase complexity in the calculation of Ct. Ct may rely\non the Risk Adjustment, which it’s trying to calculate.\nPart (iii)\nRisk aversion = Risk aversion can be described as the preference to avoid or\nmitigate the impact of unfavourable outcomes as compared to favourable\noutcomes.\nRisk appetite = Risk appetite can be described as the decision-making preferences\nfor taking risk to achieve a return.\nRisk tolerance = Risk tolerance considers the measure of unfavourable results and\nthe probabilistic measure of risk.\nLevel of Risk aversion could be different for the two products in question.\nILA LFMC Spring 2024 Solutions Page 13\n\n--- Page 14 ---\n",
        "commentary": ""
    },
    {
        "question_id": "4",
        "solutions": "Learning Objectives:\n3. The candidate will understand Canadian taxation applicable to life insurance\ncompanies and products.\nLearning Outcomes:\n(3a) The Candidate will be able to describe and apply the taxation regulations\napplicable to Canadian life insurance companies and life insurance products.\nSources:\nCanadian Insurance Taxation, Swales, et. Al., 4th Ed, 2015, Chapters 4, 5, and 11\nCommentary on Question:\nThis questions tested the candidates’ understanding of Canadian taxation applicable to\nlife insurance companies and products.\nSolution:\n(a) Critique the following statements:\nA. Any business income earned by a non-resident insurer in Canada will\nalways be treated as taxable income in Canada.\nB. A Canadian resident insurance company is subject to income tax on all\nworldwide income.\nCommentary on Question:\nTo receive full credit, the candidates must clearly state whether the statement is\ncorrect or incorrect, and provide appropriate justification. Candidates generally\ndid better critiquing statement A. A common mistake for candidates with\nstatement B was stating that a Canadian resident insurance company is only\nsubject to income tax on earnings in Canada.\nStatement A: This statement is partially true.\nThe business income of a non-resident insurer in Canada will be taxable if the\nfollowing conditions satisfied:\n1. The non-resident insurer is carrying-on business in Canada.\n2. Either a tax-treaty between Canada and the non-resident insurer’s home\ncountry does not apply or the non-resident insurer has a permanent\nestablishment in Canada.\nStatement B: This statement is partially true.\nA Canadian insurer is subject to income tax on all insurance business earned in\nCanada as well as subject to income tax on all non-insurance business earned\nworldwide.\nILA LFMC Spring 2024 Solutions Page 14\n\n--- Page 15 ---\n",
        "commentary": ""
    },
    {
        "question_id": "4",
        "solutions": "Continued\n(b) A Canadian resident life insurer only does business in Canada and acquired a\nproperty on July 1, 2023.\nYou are given:\nCost of the property 10,000\nExpenditures during the year 1,500\nIncome earned during the year 50\nAverage annual rate of interest 5%\nCalculate the imputed cost for income tax reporting in 2023. Show all work.\nCommentary on Question:\nMost candidates were able to come up with the general formula as the Imputed\nCost for Income Tax = Net Cost during the year * Annual rate – Income earned\nduring the year.\nHowever, many candidates could not correctly calculate all components in the\nformula. Common mistakes included:\n1) Subtracting (instead of adding) the Expenditures from the Cost of the property\nwhen calculating the Net Cost during the year.\n2) Including a full year of interest on the Net Cost even though the question\nindicated that the property was acquired on July 1, 2023.\nPartial credit was received if candidates could identify (but not necessarily\naccurately calculate) the key components of the Imputed Cost for Income Tax.\nA. Identify the interest rate to be used: i = 5%\nB. Calculate the average net cost during the year (July 1 – Dec 31):\nNet Cost = 10000 + 1500/2 = $10750\nC. Calculate the number of days during the year from July 1 to Dec 31.\n183/365 = 0.5014\nD. Calculate the Gross Benefit = A × B × C = $10750 × 5% × 0.5014 = $269.49\nE. Identify the Income derived during the period = $50\nF. Calculate the final imputed cost for income tax = D – E = $269.49 - $50 =\n$219.49\nILA LFMC Spring 2024 Solutions Page 15\n\n--- Page 16 ---\n",
        "commentary": ""
    },
    {
        "question_id": "4",
        "solutions": "Continued\n(c) Explain how an insurance company would classify and treat each of the following\nfor taxable income reporting:\n(i) A corporate bond with fixed semi-annual coupons that will be held to\nmaturity.\n(ii) A corporate bond with fixed semi-annual coupons held at fair value.\n(iii) A share of a corporation where the insurer holds an immaterial interest.\n(iv) Property acquired with the intent of generating rental income.\nCommentary on Question:\nThis question requires candidates to not only identify the treatment of each listed\ntaxable income but also provide proper explanation to the treatment. For\nexample, simply stating that “this type of income is treated as Special Debt\nObligation” is not sufficient to receive full credit. Candidates also need to\nprovide some explanation that under SDO, the asset is held to maturity and its\nincome will be carried at amortized cost, etc.\n(i) Corporate bond with fixed semi-annual coupons held to maturity\nCorporate bond will be treated as Specified Debt Obligation (SDO). Since\nthe corporate bond will be held to maturity, it is considered SDO that is\nnot marked to market. This asset is carried at amortized cost. Income from\nthis asset (fixed semi-annual coupons) is determined using a level yield\nmethod.\n(ii) Corporate bond with fixed semi-annual coupons held at fair value\nSince the corporate bond is held at fair value, it is treated as SDO that is\nmarked to markets. The value of this assets is determined on a fair value\nbasis. All changes in the value will flow through income and be taxed\nimmediately.\n(iii) Share of a corporation where insurer holds an immaterial interest\nShare where the insurer does not hold a material interest should be treated\nas marked to market. The value of the share is carried at fair value and any\nchanges in the value of the share will flow through income and be taxed\nimmediately.\n(iv) Property acquired with the intent of generating rental income\nSince the property was acquired with the intent of generating rental\nincome, it will be treated as a capital property. Income will be determined\non a realized basis, and only 50% of the capital gain will be subject to\nincome tax.\nILA LFMC Spring 2024 Solutions Page 16\n\n--- Page 17 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "Learning Objectives:\n1. The candidate will understand and apply pre-IFRS 17 valuation principles to\nindividual life insurance and annuity products issued by Canadian life insurance\ncompanies.\n4. The candidate will understand how to explain and apply the methods, approaches\nand tools of financial management in a life insurance company context.\nLearning Outcomes:\n(1a) The Candidate will be able to:\n• The Candidate will be able to describe, apply and evaluate the appropriate\nIFRS 17 accounting and valuation standards for life insurance and annuity\nproducts\n• Compare and apply methods for life and annuity product reserves\n• Evaluate, calculate, and interpret liabilities\n• Recommend and justify appropriate valuation assumptions\n(4a) The Candidate will be able to:\n• Explain and apply methods in determining regulatory capital and economic\ncapital\n• Explain and evaluate the respective perspectives of regulators, investors,\npolicyholders and insurance company management regarding the role and\ndetermination of capital\n• Explain Canadian regulatory capital framework and principles\n• Explain and apply methods in capital management\nSources:\nLFM-659-24: Understanding IFRS 17: Solving for New Challenges, Fiera Capital, Oct\n2021\nLFM-645-23: OSFI LICAT Guideline, Chapters 1 - 11, excluding Sections 4.2-4.4 and\n7.3-7.11\nCommentary on Question:\nThis question tested the candidates’ knowledge of IFRS 17 and LICAT. In general,\ncandidates did well on this question.\nSolution:\n(a) Critique the following proposed actions.\nA. Moving a portion of the portfolio from provincial to investment grade\ncorporate bonds will increase returns. ABC can still maintain the same\nasset liability matching policy so net income volatility will not be affected.\nILA LFMC Spring 2024 Solutions Page 17\n\n--- Page 18 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "Continued\nB. Acquiring private debt would decrease the IFRS 17 discount rates to\nreflect the illiquid nature of these assets, which would increase liabilities.\nC. High yield bonds are highly correlated with other fixed income assets and\nwould introduce additional interest rate sensitivity.\nD. Acquiring preferred shares will increase yields in a low interest rate\nenvironment. However, in a rising and volatile interest rate environment,\nthey do not offer any advantages over higher yielding bonds.\nE. Changing the investment strategy will change the length of the observable\nperiod of the IFRS 17 discount rate due to changes in the asset portfolio\nduration.\nF. Moving a portion of the portfolio from provincial bonds to investment\ngrade corporate bonds will have no impact on LICAT required capital if\nthe assets and liabilities remain duration matched.\nG. Establishing stable long-term assumptions for the ultimate period will\ndecrease the liability duration and allow assets and liabilities to be\nduration matched without the need for derivatives.\nCommentary on Question:\nFor this part of the question, candidates needed to provide appropriate\njustification to receive full credit. Most candidates were able to apply their\nknowledge of IFRS 17 and LICAT to assess the proposed actions with\njustification.\nStatement A\n• Use of corporate bonds will increase expected yield related to the\nadditional credit exposure;\n• Magnitude of credit spread changes tends to be larger in corporate bonds\nvs provincial bonds;\n• Volatility of results will increase because IFRS 17 Liabilities are not\naffected by credit risk spreads (not included in discount rates).\nStatement B\n• Liquidity premium in IFRS 17 discount rates reflects liquidity\ncharacteristics of insurance contracts, not assets;\n• IFRS 17 discount rates would not decrease due to use of private debt.\nStatement C\n• High yield bonds can be a good option to increase investment returns;\n• High yield bonds have a low to negative correlation to other fixed income\nassets\nILA LFMC Spring 2024 Solutions Page 18\n\n--- Page 19 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "Continued\n• Liabilities with cash flows in the 10-20 year range are highly sensitive to\ninterest rate changes;\n• To minimize volatility high yield bonds should be used for liabilities that\nhave low interest rate sensitivity. (cash flows at the short and long end of\nthe curve)\nStatement D\n• Preferred shares are a higher yielding asset class offering a significant\nsource of income in a low-yield environment;\n• Portfolio diversification is an advantage - preferred shares have a negative\ncorrelation with traditional bonds; (preferred share price can rise in an\nincreasing interest environment when bond price fall);\n• Preferred shares can reduce volatility relative to other high yielding assets.\nStatement E\n• The general consensus in Canada is that the observable period is 30 years.\nThis would not be affected by changes in asset strategy;\n• Using long-term historical averages of nominal Government bonds is one\napproach to setting the ultimate rate. However, other approaches may also\nbe appropriate.\nStatement F\n• While there would be no impact on interest rate risk, there would be\nimpacts to market risk (asset risk) as corporate bonds would have a\ndifferent factor than provincial bonds.\nStatement G\n• True. If the ultimate rate is stable, the liability duration is decreased\nbecause the discount rate would not change as much in response to change\nin interest rates, lowering the liability duration.\nILA LFMC Spring 2024 Solutions Page 19\n\n--- Page 20 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "Continued\n(b) You are given:\nABC is evaluating 3 proposed investment portfolios:\nCurrent Portfolio Proposed Portfolio 1 Proposed Portfolio 2 Proposed Portfolio 3\nAsset Expected Expected Expected Expected\nAllocation Allocation Allocation Allocation\nClass Return Return Return Return\nProvincial\n100% 2.60% 60% 2.60% 30% 2.60% 20% 2.60%\nbonds\nCorporate\n0% 3.40% 40% 3.40% 50% 3.40% 30% 3.40%\nbonds\nHigh yield\n0% 4.30% 0% 4.30% 20% 4.30% 25% 4.30%\nbonds\nPrivate\n0% 4.25% 0% 4.25% 0% 4.25% 25% 4.00%\ndebt\nTotal 100% 2.60% 100% 2.92% 100% 3.34% 100% 3.62%\nStandard\ndeviation\n10.00% 10.80% 11.40% 11.80%\nof asset\nreturns\nRecommend which one of the 3 proposed portfolios should be implemented by\nABC. Justify your response.\nCommentary on Question:\nTo receive full credit on this part of the question candidates needed to calculate\nthe return per unit of risk correctly, and to appropriately justify their\nrecommendation. Candidates may make a different recommendation than the one\nin the model solution as long as adequate justification was provided. Most of the\ncandidates gave the correct calculation of return per unit of risk and\nrecommended portfolio 3 based on the calculation.\nReturn per unit of risk = Portfolio Return / Standard Deviation of Returns\n• Current portfolio = 26.00\n• Proposed Portfolio 1 = 2.92% / 10.8% = 27.04\n• Proposed Portfolio 2 = 3.34% / 11.4% = 29.30\n• Proposed Portfolio 3 = 3.62% / 11.8% = 30.64\nProposed Portfolio 3 maximizes return per unit of risk\nILA LFMC Spring 2024 Solutions Page 20\n\n--- Page 21 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "Continued\nRecommendation\nRecommend Portfolio 2; Return per unit of risk is significantly higher than\nportfolio 1.\nPortfolio 3 has slightly higher return per unit of risk but other factors weigh in:\n• Private debt has low volatility but is short duration. Suitable for portfolio\nwhere interest rate exposure is to be limited.\n• Allocation to private debt in portfolio likely exceeds short-term liabilities -\nprobably excessive for this liability portfolio. May be difficult to maintain\nduration matching with this allocation.\n• Volatility of financial results for portfolio 3 may exceed volatility of\nreturns captured in return per unit of risk measure due to asset liability\nmismatches and due to differences in asset returns and effect of discount\nrate changes on liabilities.\nILA LFMC Spring 2024 Solutions Page 21\n\n--- Page 22 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "Learning Objectives:\n5. The candidate will understand important insurance company issues, concerns and\nfinancial management tools.\nLearning Outcomes:\n(5a) The candidate will be able to describe, apply and evaluate considerations and\nmatters related to:\n• Insurance company mergers and acquisitions\n• Embedded Value determinations\n• Climate risk management\nSources:\nEmbedded Value: Practice and Theory, SOA, Actuarial Practice Forum, March 2009\nWill IFRS 17 replace EV, Milliman, Sep 2018\nLFM-106-07: Insurance Industry Mergers and Acquisitions, Chapter 4 (Sections 4.1-4.6)\nCommentary on Question:\nThis question tested the candidates’ understanding of insurance company issues,\nconcerns and financial management tools.\nSolution:\n(a) Describe the treatment for each of the following items under Market Consistent\nEmbedded Value (MCEV), fulfilment value (IFRS 17) and fair value (IFRS 13)\nby completing the table below:\nMarket Fulfillment Value Fair Value\nConsistent (IFRS17) (IFRS 13)\nEmbedded\nValue\nFuture Renewal of\nIn-force Business\nFuture New\nBusiness\nExpense\nAssumption\nProfit Emergence\nILA LFMC Spring 2024 Solutions Page 22\n\n--- Page 23 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "Continued\nCommentary on Question:\nCandidates showed good understanding of the treatment for Future Renewal of IF\nbusiness and Expense Assumption. Many candidates pointed out whether Future\nNB is included/excluded without providing more clarification, such as future NB\nis included to some extent in case of M&A, and thus partial marks were received.\nFor Profit Emergence, only a few candidates were able to point out the variance\nfrom expected values which are recognized in subsequent period under MCEV.\nMarket Fulfillment Fair Value\nConsistent EV Value (IFRS17) (IFRS 13)\nFuture Renewal Included. Excluded if out- Included.\nof IF business of-boundary\nconditions such as\nfully repriceable\nare met.\nFuture NB Excluded, but Excluded, but In the case of\nNBV in past year change of M&A, future new\nis separately elements due to business value is\ncalculated. new business included to some\nacquisition in the extent (based on\nreporting period ability to acquire\nis disclosed. NB.)\nExpense All overhead Only directly All overhead is\nAssumption included. attributable included,\nexpenses are economic\nincluded. efficiency of 3rd\nparty reflected.\nProfit Recognized when Profits due to NB n/a\nEmergence NB is acquired. acquisition are\nVariance from deferred as CSM,\nexpected values and recognized\nare recognized in over insurance\nsubsequent period. If losses\nperiods. are expected, they\nare recognized\nimmediately.\nILA LFMC Spring 2024 Solutions Page 23\n\n--- Page 24 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "Continued\n(b) Using the financial information for the block of business given in the Excel\nspreadsheet:\n(i) Calculate the actuarial appraisal value. Show all work.\n(ii) Calculate embedded value. Show all work.\nCommentary on Question:\nFew candidates received full credit for this part of the question. Many candidates\nknew that the difference between AAV and EV. Some candidates were not able to\nuse the data provided in the questions correctly. Partial marks were received for\nthe calculations.\nCalculations are provided in the Excel spreadsheet.\nPV of DCF = PV of After-tax earnings minus Increase in Required Capital\nDCF = premium + investment income – benefits – expenses – commissions –\nincrease in statutory reserves – taxes – increase in required capital\n(i)\nPV of DCF = Appraisal value = 101.15\n(ii)\nPV of DCF = NB = 23.17\nEV = Appraisal value – NB = 77.98\n(c) Critique the decision to set the bid price for this block of business at the actuarial\nappraisal value.\nCommentary on Question:\nCandidates generally recognized that AAV is not the most appropriate for bid\nprice. Many candidates provide 1 or 2 adjustments outside the scope of AAV. Full\nmarks received if 3 or more adjustments were provided.\nThe total value for a company will reflect adjustments for items outside the scope\nof the appraisal that increase or reduce value such as:\n• Value associated with branding or market position\n• A buyer’s synergies\n• Or general market conditions\nTherefore, AAV is not the most appropriate for bid price, as it does not reflect\nthese important items.\nILA LFMC Spring 2024 Solutions Page 24\n\n--- Page 25 ---\n",
        "commentary": ""
    },
    {
        "question_id": "7",
        "solutions": "Learning Objectives:\n1. The candidate will understand and apply pre-IFRS 17 valuation principles to\nindividual life insurance and annuity products issued by Canadian life insurance\ncompanies.\n4. The candidate will understand how to explain and apply the methods, approaches\nand tools of financial management in a life insurance company context.\nLearning Outcomes:\n(1a) The Candidate will be able to:\n• The Candidate will be able to describe, apply and evaluate the appropriate\nIFRS 17 accounting and valuation standards for life insurance and annuity\nproducts\n• Compare and apply methods for life and annuity product reserves\n• Evaluate, calculate, and interpret liabilities\n• Recommend and justify appropriate valuation assumptions\n(4a) The Candidate will be able to:\n• Explain and apply methods in determining regulatory capital and economic\ncapital\n• Explain and evaluate the respective perspectives of regulators, investors,\npolicyholders and insurance company management regarding the role and\ndetermination of capital\n• Explain Canadian regulatory capital framework and principles\n• Explain and apply methods in capital management\nSources:\nCIA Educational Note: Estimates of Future Cash Flows under IFRS 17\nCIA Educational Note: Risk Adjustment under IFRS 17\nCIA Educational Note - Market Consistent Valuation of Financial Guarantees for Life\nand Health Insurance Contracts\nCommentary on Question:\nThis question tested the candidates’ knowledge of IFRS17\nSolution:\n(a) Critique the following statements with respect to IFRS 17. Justify your response.\nA. For products with asymmetrical cash flows, the risk adjustment should\ninclude a provision to account for this risk.\nILA LFMC Spring 2024 Solutions Page 25\n\n--- Page 26 ---\n",
        "commentary": ""
    },
    {
        "question_id": "7",
        "solutions": "Continued\nB. Cash flows that are assumed to vary with assumptions related to financial\nrisk should be projected using returns on assets backing the cash flows.\nC. Insurance contracts have the same contractual service margin (CSM) at\ninitial recognition when measured with either the variable fee approach or\nthe general measurement model. The CSM will be different in subsequent\nperiods under the two approaches.\nD. The ceded risk adjustment will always be proportional to the direct risk\nadjustment.\nCommentary on Question:\nFor statement A, most candidates correctly identified that risk adjustment is for\nnon-financial risks only; however, most candidates did not identify that the\nasymmetry of cashflows should not be part of risk adjustments.\nFor statement B, most candidates did not identify that returns on assets backing\nthe cashflows should not be used under IFRS 17.\nMost candidates correctly critiqued statement C.\nMost candidates did not correctly critique statement D. Most candidates\nmentioned some high-level differences such as risk of non-performance or\naccounting mismatches without adequately explaining how it would affect the\nproportionality of the reinsurance.\nA. Incorrect.\nUnder IFRS 17, it would be included in the estimate of future fulfillment cash\nflows rather than the risk adjustment under IFRS 17. Risk adjustment is for\nnon-financial risks under IFRS 17. The actuary should also determine if the\nadjustment due to asymmetry of the cashflows is material or not.\nB. Incorrect.\nThese cash flows would be projected consistent with observable market prices\nunder IFRS 17 and reported as part of the estimates of future cash flows.\nPossible approaches include deterministic projection with implied market\nrates, or stochastic modelling under either a risk-neutral or real world with\ndeflators framework.\nIFRS 17 does not prescribe the methodology to value the cost of options and\nguarantees. judgement is required to determine the technique that best meets\nthe objective of consistency with observable market variables in specific\ncircumstances.\nILA LFMC Spring 2024 Solutions Page 26\n\n--- Page 27 ---\n",
        "commentary": ""
    },
    {
        "question_id": "7",
        "solutions": "Continued\nC. Correct.\nSubsequent measurement differs under the two approaches: GMM recognizes\nthe interest accretion on the CSM measured using locked-in rates. VFA\nadjusts the CSM for changes in the entity’s share of fair value, which\nimplicitly reflects interest accretion, and is measured using current rates.\nD. Partially correct.\nWhere the price of reinsurance is proportional to the level of risk being ceded\nfrom the direct entity’s perspective, the ceded RA would be proportional to\nthe direct RA, and the direct RA would be unaffected by the presence of\nreinsurance unless the reinsurance affects the level of compensation required\non the direct contract.\nWhen the price of reinsurance is not proportional to the level of risk being\nceded from the direct entity’s perspective, then the ceded RA may not be\nproportional to the direct RA.\n(b) You are given the following information for a potential 50% coinsurance\narrangement.\nAssume the net risk adjustment is calculated and apportioned between the direct\nand ceded amounts on the basis of the amount insured.\n(i) Complete the following chart in the Excel spreadsheet:\nDirect Ceded Net\nPV Premium 1,250 (1,695)\nPV Claims (1,250) 1,250\nBest estimate liability 0\nRisk adjustment (320) 320\nCSM before reinsurance 125\noffset\nReinsurance offset (Loss\nRecovery Component)\nCSM after reinsurance\noffset\nCSM after zero floor\nILA LFMC Spring 2024 Solutions Page 27\n\n--- Page 28 ---\n",
        "commentary": ""
    },
    {
        "question_id": "7",
        "solutions": "Continued\n(ii) Recommend whether to proceed with the 50% coinsurance arrangement.\nJustify your response.\nCommentary on Question:\nMost candidates correctly calculated the Direct PV Premium, Direct PV Claims,\nBEL, RA, and CSM before reinsurance offset.\nMost candidates calculated the reinsurance offset incorrectly. The most common\nmistake was to set the Ceded reinsurance offset to be 50% of Direct CSM, when\nthe correct calculation should be: Direct reins offset = 50%*direct CSM = 97.7.\nCeded reins offset = net - direct = 0 - 97.7 = (97.7).\nAnother common mistake was that the Net CSM after zero floor was set equal to\nthe Net CSM after reins offset when the correct calculation should be that Net\nCSM after zero floor = Ceded CSM after zero floor.\nMost candidates’ calculations led to them correctly stating that the reinsurance\narrangement is beneficial to the company, but to receive full credit, candidates\nmust also identify that the reinsurance turned the contract from onerous to\nprofitable.\n(i)\nDirect Ceded Net\nPV Premium (2,945) 1,250 (1,695)\nPV Claims 2,500 (1,250) 1,250\nBEL (445) 0 (445)\nRA 641 (320) 320\nCSM before reinsurance offset (195) 320 125\nReinsurance Offset 98 (98) 0\nCSM after reinsurance offset (98) 223 125\nCSM after zero floor 0 223 223\nPV direct premium = net prem - ceded prem = (1,695) - 1,250 = (2,945)\nPV direct claims = net claim - ceded claim = 1,250 - (1,250) = 2,500\nDirect BEL = net - ceded = net prem + net claim - ceded = (1,695) + 1,250 - 0 =\n(445)\nDirect RA = net RA - ceded RA = 320 - (320) = 640\nDirect CSM before reins offset = net - ceded = 125 - (RA) = 125 - 320 = (195)\nDirect reins offset = 50%*direct CSM = 98\nCeded reins offset = net - direct = 0 - 98 = (98)\nDirect CSM after reins = CSM before reins – reins offset = (195)- 98 = (98)\nCeded CSM after reins = CSM before reins – reins offset = 320- (98) = 223\nDirect CSM after zero floor = 0\nCeded CSM after zero floor = Ceded CSM after reins offset = 223\nNet CSM after zero floor = ceded CSM after zero floor = 223\nILA LFMC Spring 2024 Solutions Page 28\n\n--- Page 29 ---\n",
        "commentary": ""
    },
    {
        "question_id": "7",
        "solutions": "Continued\n(ii)\nThe company should proceed, as the reinsurance arrangement changes the\ncontract from onerous to profitable.\nILA LFMC Spring 2024 Solutions Page 29\n\n--- Page 30 ---\n",
        "commentary": ""
    },
    {
        "question_id": "8",
        "solutions": "Learning Objectives:\n1. The candidate will understand and apply pre-IFRS 17 valuation principles to\nindividual life insurance and annuity products issued by Canadian life insurance\ncompanies.\n4. The candidate will understand how to explain and apply the methods, approaches\nand tools of financial management in a life insurance company context.\nLearning Outcomes:\n(1a) The Candidate will be able to:\n• The Candidate will be able to describe, apply and evaluate the appropriate\nIFRS 17 accounting and valuation standards for life insurance and annuity\nproducts\n• Compare and apply methods for life and annuity product reserves\n• Evaluate, calculate, and interpret liabilities\n• Recommend and justify appropriate valuation assumptions\n(4a) The Candidate will be able to:\n• Explain and apply methods in determining regulatory capital and economic\ncapital\n• Explain and evaluate the respective perspectives of regulators, investors,\npolicyholders and insurance company management regarding the role and\ndetermination of capital\n• Explain Canadian regulatory capital framework and principles\n• Explain and apply methods in capital management\nSources:\nLFM-151-22: IAIS—International Capital Standard, ComFrame, Holistic Framework for\nSystemic Risk in the Insurance Sector, Sullivan & Cromwell LLP, Dec 2019, Only pages\n1-3, 8-28\nLFM-620-24: OSFI Guideline E15: Appointed Actuary - Legal Requirements,\nQualification and External Review (Aug 2023)\nLFM-635-24: OSFI Guideline E16: Participating Account Management and Disclosure to\nParticipating Policyholders and Adjustable Policyholders, OSFI, 2023\nLFM-632-23: OSFI B-3 Sound Reinsurance Practices and Procedures\nCommentary on Question:\nThis question tested the candidates’ knowledge of international capital standards and\nvaluation principles.\nILA LFMC Spring 2024 Solutions Page 30\n\n--- Page 31 ---\n",
        "commentary": ""
    },
    {
        "question_id": "8",
        "solutions": "Continued\nSolution:\n(a) You are given:\n• Five years ago, MLL introduced a life insurance product, Super Life\n(SL), with high guaranteed cash surrender values, targeting the top 5%\nof income-earners in Canada.\n• No other insurers offer a similar product to SL in the market.\n• Approximately half of all Canadians in the target demographic have\npurchased an SL policy from MLL.\n• MLL cedes 80% of SL’s mortality risk to a single Canadian reinsurer\nand retains the remaining 20%.\n• MLL follows a very low risk investment strategy with 70% invested in\nfixed income assets and the remaining 30% held in cash.\n(i) Describe the three key exposures that can lead to systemic risk for MLL under\nthe Holistic Framework from the IAIS.\n(ii) Recommend an approach for applying each of the three key elements of the\nHolistic Framework to manage systemic risk.\nCommentary on Question:\nCandidates generally received partial credit for part (i). Few candidates\nsuccessfully stated the 3 key exposures with sufficient detail.\nCandidates generally did not do well on part (ii). Most candidates confused key\nelements for key exposures.\nThree key exposures leading to systemic risk for MLL:\nExposure 1: Liquidity Risk\n• The risk an insurer is unable to realize its investments/assets when financial\nobligations come due\n• Risk is higher if assets backing liabilities are illiquid\n• Maple Leaf Life's investment strategy is very liquid (70% FI, 30% cash), so\nrisk is low\nILA LFMC Spring 2024 Solutions Page 31\n\n--- Page 32 ---\n",
        "commentary": ""
    },
    {
        "question_id": "8",
        "solutions": "Continued\nExposure 2: Interconnectedness\n• How connected the financial system and real economy are\n• Macroeconomic exposure (i.e. correlation with the economy)\nInvestment strategy is fixed income assets, but the exact holdings are\no\nunknown\nThe product is sold to half of the top 5% income earners in Canada, so the\no\nproduct's failure could have unknown impacts on the economy since many\nof the wealthiest Canadians own it\n• Counterparty exposure (i.e. reliance on counterparties sharing correlated risk\namong each other)\n80% of the mortality risk is reinsured, so there is a dependency on the\no\nreinsurer to fulfil its obligations to MLL and its other clients\nExposure 3: Limited Substitutability\n• Inability to continue the supply of insurance products if one insurer fails\n• If MLL were to fail, there's no guarantee another insurer would launch a\nsimilar product (though they could), and currently 2.5% of all Canadians are\nbenefiting from the product\nApproach for applying the three key elements of the Holistic Framework:\nElement 1 – an enhanced set of supervisory policy measures to prevent systemic\nrisk, including supervisory powers of intervention to respond when a potential\nrisk is identified\n• MLL can enhance their ERM policies to include risk identification of\nsystemic risk, including governance, liquidity stress testing, liquidity\nportfolio, contingency fund planning, or liquidity risk management report\n• MLL can develop a counterparty risk appetite statement\nElement 2 – a global monitoring exercise to assess global trends and detect build-\nup of systemic risk\n• MLL can implement \"Individual Insurer Monitoring\" of their own,\nfocusing on the key elements of that framework (including size, global\nactivity, etc.)\n• MLL can also monitor global trends where they may have exposure to\nchanges in economic environment and the associated potential risks\nILA LFMC Spring 2024 Solutions Page 32\n\n--- Page 33 ---\n",
        "commentary": ""
    },
    {
        "question_id": "8",
        "solutions": "Continued\nElement 3 – an implementation assessment, where the IAIS will assess the\nimplementation of enhanced supervisory policy measures and powers of\nintervention\n• - Internally, Maple Leaf Life can establish an auditing process to ensure\nthe measures identified (in Step 1) are monitored and implemented\ncorrectly\n(b) MLL is launching a new participating whole life product.\n• The launch date is January 1, 2025.\n• MLL requires the project manager to secure reinsurance.\n• The project manager has decided the following:\nReinsurers should provide quotes by the launch date\no\nReinsurers to be selected no later than January 31, 2025\no\nReinsurance treaties are to be fully executed by June 30, 2025\no\n• Senior management will recommend to the Board a policy for determining\ndividends and managing the participating account\n• As part of the annual year-end President’s Report to the board, the CEO will\ninclude a disclosure on the fairness of proposed policyholder dividends and\nthe allocation of investment income and expenses\n• The Appointed Actuary will perform a triennial review of the fairness of any\nchanges made to the participating product\n• Policyholder disclosures on the management of the participating account will\nbe based on excerpts taken from internal company documentation, with\nredactions from the legal team to remove proprietary details\nCritique the proposed product development decisions with respect to the relevant\nOSFI guidelines. Justify your answer.\nCommentary on Question:\nThis part of the question tested the candidates’ understanding of how reinsurance\ncontracts are established and the role of the appointed actuary. Most candidates\nperformed well on this part of the question.\nBased on how the project manager appears to have official responsibility for\ndetermining when reinsurance is secured during the product development process,\nMLL may need to establish a Reinsurance Risk Management Policy or revise it to\nensure better oversight over this aspect of product development. This is also\napparent as the proposed timelines do not comply with OSFI Guideline B-3. A\nbinding \"summary document\" (e.g. letter of intent) should be in place by the\nlaunch date (i.e. when the reinsurance becomes effective) which doesn't appear to\nbe the case, and the fully executed treaty should be signed within 120 days; June\n30 is therefore too late.\nILA LFMC Spring 2024 Solutions Page 33\n\n--- Page 34 ---\n",
        "commentary": ""
    },
    {
        "question_id": "8",
        "solutions": "Continued\nMLL is correct to develop a policy for managing dividends and the par fund\nwhich must be approved by the board of directors. However, the annual\ndisclosure must come from the Appointed Actuary, not the President/CEO. In\nmost cases, the CEO may not be the Appointed Actuary.\nWhile the Appointed Actuary must periodically opine on the impact to fairness of\nproduct changes, it must be at least annual rather than triennial.\nAlthough MLL is required to provide certain disclosures to policyholder including\non how the participating account is managed, taking excerpts from technical\ndocumentation may not satisfy the requirement to be understandable with a\nrudimentary knowledge of life insurance (i.e. not being a technical expert).\nMoreover, by having the legal team redact the language, it may lead to the\ndisclosure being too generic or boilerplate.\nILA LFMC Spring 2024 Solutions Page 34\n\n--- Page 35 ---\n",
        "commentary": ""
    },
    {
        "question_id": "9",
        "solutions": "Learning Objectives:\n4. The candidate will understand how to explain and apply the methods, approaches\nand tools of financial management in a life insurance company context.\nLearning Outcomes:\n(4a) The Candidate will be able to:\n• Explain and apply methods in determining regulatory capital and economic\ncapital\n• Explain and evaluate the respective perspectives of regulators, investors,\npolicyholders and insurance company management regarding the role and\ndetermination of capital\n• Explain Canadian regulatory capital framework and principles\n• Explain and apply methods in capital management\nSources:\nEconomic Capital for life Insurance Companies, SOA Research paper, Oct 2016 (only\nsections 2 and 6)\nCommentary on Question:\nThis question tested the candidates’ understanding of economic capital and the Canadian\nregulatory capital framework. Overall, candidates demonstrated a moderate\nunderstanding on part (a) and a good understanding on parts (b) and (c).\nSolution:\n(a)\n(i) Describe the components of an economic capital calculation\n(ii) Describe the economic capital considerations pertaining to the term life\nacquisition.\nCommentary on Question:\nFor part (i) of the question, most candidates were able to identify that economic\ncapital is determined from the point of view of the company which; however, most\ncandidates did not describe the components of the calculation sufficiently to\ndemonstrate full knowledge. Some candidates confused economic capital with the\nCanadian regulatory capital framework (LICAT) which resulted in no credit.\nFor part (ii) of the question, candidates did well to describe the diversification\nbenefit that would be realized from the term life acquisition, but few candidates\nwere able to provide sufficient considerations.\nILA LFMC Spring 2024 Solutions Page 35\n\n--- Page 36 ---\n",
        "commentary": ""
    },
    {
        "question_id": "9",
        "solutions": "Continued\nPart (i):\n- Important to distinguish between the available capital (excess of assets over\nliabilities held by the insurer) and the required capital (the amount of assets in\nexcess of liabilities needed to withstand future adverse outcomes)\n- The accounting valuation of assets and liabilities used will not necessarily agree\nwith the baseline valuation that is preferred for EC\n- The most important feature is that the correct total asset requirement (liabilities\nplus required capital) at time 0 is derived\n- EC attempts to measure a capital requirement based on the most realistic\nassessment of future economic risks\n- The effect of real world risks is measured and the capital required to cover these\noutcomes with a specified degree of security is then calculated\n- EC is measured consistently with the economics of the company\n- The valuation basis should allow a realistic assessment of the risks in a way that\nprovides a meaningful perspective across a potentially diverse set of exposures\nPart (ii):\n- Need to consider the EC requirements of the target company from XYZ Life’s\nperspective\n- Need to consider the result of aggregating the acquired block on XYZ’s own\ncapital requirements\n- Diversification impacts of the acquisition when appropriate should be taken into\nconsideration\n- Can be EC offsets when combining different aspects of the same risk\n- An increase in capital may be required if acquired business is lower than XYZ’s\ntarget\n(b) Critique each of the following statements pertaining to LICAT required capital.\nJustify your answer.\nA. XYZ’s lapse risk required capital component will decrease due to the\nacquisition.\nB. For the purpose of determining the lapse designation, XYZ will test whole\nlife and term life on a combined basis.\nC. XYZ is not allowed by regulation to acquire the term block if it would\ncause capital to decrease below the Internal Capital Target.\nCommentary on Question:\nMost candidates were able to receive partial credit for each of the three statement\ncritiques s by providing a valid explanation for each statement. No credit was\nreceived if candidates did not provide proper justification.\nILA LFMC Spring 2024 Solutions Page 36\n\n--- Page 37 ---\n",
        "commentary": ""
    },
    {
        "question_id": "9",
        "solutions": "Continued\nA. Disagree\n- Lapse risk component applies to both lapse-supported & lapse-sensitive\nproducts.\n- Since the new business is being added, the risk will increase, and this\nrequired capital component would increase.\nB. Disagree\n- Lapse supported and lapse sensitive products are assumed to be negatively\ncorrelated for LICAT.\n- Lapse supported products should be shocked with a decrease in lapse rates\nwhile lapse sensitive products should be shocked with an increase in lapse\nrates.\nC. Disagree\n- Internal Capital Target is not a regulatory requirement.\n- Capital resources may fall below the Internal Target, the insurer has to\ninform OSFI promptly along with a plan on how it expects to manage the risks\nand/or restore its Capital Resources to its internal targets levels within a\nrelatively short period of time.\n(c) Premium data, required capital components and capital factors are given in the\nExcel spreadsheet.\nCalculate the Total Operational Risk Capital for XYZ as of December 31,\n2024. Show all work.\nCommentary on Question:\nMost candidates provided the formula for the calculation of the operational risk\nrequired capital. The business volume required capital calculation and the general\nrequired capital calculation were performed well in general. However, the\ncalculation for the large increase in business volume required capital was not well\napplied by most of the candidates. Even if they were able to demonstrate the\nknowledge that the exposure is the excess of current year’s premiums over 120%\nof the prior year’s premiums, which provided them with partial credit, most\ncandidates did not split the businesses between the individual and group business\nsegments. Another common mistake for this calculation was including the 2023\npremiums for the Term Life that were not part of XYZ’s business in that year.\n1) General formula for the calculation of the operational risk required capital\n𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂 𝑅𝑅𝑂𝑂𝑅𝑅𝑅𝑅 𝑅𝑅𝑅𝑅\n= 𝐵𝐵𝐵𝐵𝑅𝑅𝑂𝑂𝑂𝑂𝑂𝑂𝑅𝑅𝑅𝑅 𝑉𝑉𝑂𝑂𝑉𝑉𝐵𝐵𝑉𝑉𝑂𝑂 𝑅𝑅𝑅𝑅\n+𝐿𝐿𝑂𝑂𝑂𝑂𝐿𝐿𝑂𝑂 𝐼𝐼𝑂𝑂𝐼𝐼𝑂𝑂𝑂𝑂𝑂𝑂𝑅𝑅𝑂𝑂 𝑂𝑂𝑂𝑂 𝐵𝐵𝐵𝐵𝑅𝑅𝑂𝑂𝑂𝑂𝑂𝑂𝑅𝑅𝑅𝑅 𝑉𝑉𝑂𝑂𝑉𝑉𝐵𝐵𝑉𝑉𝑂𝑂 𝑅𝑅𝑅𝑅 +𝐺𝐺𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑉𝑉 𝑅𝑅𝑅𝑅\nILA LFMC Spring 2024 Solutions Page 37\n\n--- Page 38 ---\n",
        "commentary": ""
    },
    {
        "question_id": "9",
        "solutions": "Continued\n2) Calculate the business volume required capital\n𝐵𝐵 𝐵𝐵𝑅𝑅𝑂𝑂𝑂𝑂𝑂𝑂𝑅𝑅𝑅𝑅 𝑉𝑉𝑂𝑂𝑉𝑉𝐵𝐵𝑉𝑉𝑂𝑂 𝑅𝑅𝑅𝑅 = 𝐹𝐹𝑂𝑂𝐼𝐼𝑂𝑂𝑂𝑂𝑂𝑂∗𝑃𝑃𝑂𝑂𝑂𝑂𝑉𝑉𝑂𝑂𝐵𝐵𝑉𝑉𝑅𝑅 (𝑂𝑂𝑜𝑜𝑂𝑂𝑂𝑂 𝑉𝑉𝑂𝑂𝑅𝑅𝑂𝑂 𝑦𝑦𝑂𝑂𝑂𝑂𝑂𝑂)\n𝐵𝐵3)𝐵𝐵 C𝑅𝑅𝑂𝑂a𝑂𝑂lc𝑂𝑂u𝑅𝑅l𝑅𝑅a t𝑉𝑉e 𝑂𝑂th𝑉𝑉𝐵𝐵e𝑉𝑉 la𝑂𝑂rg 𝑅𝑅e𝑅𝑅 in=cre2a.5se0 %in b∗u(s4in0e0ss+ v2o5lu0m+e 2re5q0u)ir=ed 2c2a.p5i0tal\n𝐿𝐿𝑂𝑂𝑂𝑂𝐿𝐿𝑂𝑂 𝐼𝐼𝑂𝑂𝐼𝐼𝑂𝑂𝑂𝑂𝑂𝑂𝑅𝑅𝑂𝑂 𝑂𝑂𝑂𝑂 𝐵𝐵𝐵𝐵𝑅𝑅𝑂𝑂𝑂𝑂𝑂𝑂𝑅𝑅𝑅𝑅 𝑉𝑉𝑂𝑂 𝑉𝑉𝐵𝐵𝑉𝑉𝑂𝑂 𝑅𝑅𝑅𝑅\n This formula= s𝐹𝐹ho𝑂𝑂u𝐼𝐼l𝑂𝑂d𝑂𝑂 𝑂𝑂be∗ a[p𝑃𝑃p𝑂𝑂l𝑂𝑂ie𝑉𝑉d 𝑂𝑂s𝐵𝐵e𝑉𝑉pa𝑅𝑅r a𝑂𝑂𝑂𝑂te l𝑂𝑂y𝑒𝑒 f𝐼𝐼o𝑂𝑂r𝑅𝑅 I𝑅𝑅n 𝑂𝑂d𝑜𝑜iv i𝑂𝑂d u2a0l% L i𝑦𝑦fe𝑂𝑂,𝑂𝑂 G𝑂𝑂r−ou𝑂𝑂p𝑜𝑜 L𝑂𝑂i𝑂𝑂fe and\nOther business.− 𝑦𝑦𝑂𝑂𝑂𝑂𝑂𝑂 𝑂𝑂𝑂𝑂𝐼𝐼𝑂𝑂𝑂𝑂𝑂𝑂𝑅𝑅𝑂𝑂]\n𝐿𝐿𝑂𝑂𝑂𝑂𝐿𝐿𝑂𝑂 𝐼𝐼𝑂𝑂𝐼𝐼𝑂𝑂𝑂𝑂𝑂𝑂𝑅𝑅𝑂𝑂 𝑂𝑂𝑂𝑂 𝐵𝐵𝐵𝐵𝑅𝑅𝑂𝑂𝑂𝑂𝑂𝑂𝑅𝑅𝑅𝑅 𝑉𝑉𝑂𝑂𝑉𝑉𝐵𝐵𝑉𝑉𝑂𝑂 𝑅𝑅𝑅𝑅 (𝐼𝐼𝑂𝑂𝐼𝐼𝑂𝑂𝑜𝑜𝑂𝑂𝐼𝐼𝐵𝐵𝑂𝑂𝑉𝑉)\n= 𝑀𝑀𝑂𝑂𝑒𝑒(0;2.50%∗{(400+250)−1.2∗(500+0)}) = 1.25\n𝐿𝐿𝑂𝑂𝑂𝑂𝐿𝐿𝑂𝑂 𝐼𝐼𝑂𝑂𝐼𝐼𝑂𝑂𝑂𝑂𝑂𝑂𝑅𝑅𝑂𝑂 𝑂𝑂𝑂𝑂 𝐵𝐵𝐵𝐵𝑅𝑅𝑂𝑂𝑂𝑂𝑂𝑂𝑅𝑅𝑅𝑅 𝑉𝑉𝑂𝑂𝑉𝑉𝐵𝐵𝑉𝑉𝑂𝑂 𝑅𝑅𝑅𝑅 (𝐺𝐺𝑂𝑂𝑂𝑂𝐵𝐵𝑂𝑂)\n= 𝑀𝑀𝑂𝑂𝑒𝑒(0;2.50%∗{250−1.2∗200}) = 0.25\n𝐿𝐿4)𝑂𝑂 𝑂𝑂C𝐿𝐿a𝑂𝑂lc 𝐼𝐼u𝑂𝑂la𝐼𝐼t𝑂𝑂e𝑂𝑂 t𝑂𝑂h𝑅𝑅e𝑂𝑂 g 𝑂𝑂e𝑂𝑂n e𝐵𝐵ra𝐵𝐵l𝑅𝑅 r𝑂𝑂e𝑂𝑂q𝑂𝑂u𝑅𝑅i𝑅𝑅re 𝑉𝑉d𝑂𝑂 c𝑉𝑉a𝐵𝐵p𝑉𝑉ita𝑂𝑂l 𝑅𝑅𝑅𝑅 = 1.25+0.25 = 1.50\n𝐺𝐺𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑉𝑉 𝑅𝑅𝑅𝑅\n= 𝐹𝐹𝑂𝑂𝐼𝐼𝑂𝑂𝑂𝑂𝑂𝑂1 ∗[𝑅𝑅𝑂𝑂𝑂𝑂𝐼𝐼𝑂𝑂𝑂𝑂,𝑀𝑀𝑂𝑂𝑂𝑂𝑅𝑅𝑂𝑂𝑂𝑂,𝐼𝐼𝑂𝑂𝑅𝑅𝐵𝐵𝑂𝑂𝑂𝑂𝑂𝑂𝐼𝐼𝑂𝑂 𝑅𝑅𝑅𝑅 𝑂𝑂𝑂𝑂𝑂𝑂 𝑂𝑂𝑜𝑜 𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑅𝑅𝐵𝐵𝑂𝑂𝑂𝑂𝑂𝑂𝐼𝐼𝑂𝑂 & 𝐼𝐼𝑂𝑂𝑂𝑂𝐼𝐼𝑂𝑂𝑂𝑂]\n+𝐹𝐹𝑂𝑂𝐼𝐼𝑂𝑂𝑂𝑂𝑂𝑂2 ∗[𝑆𝑆𝑂𝑂𝐿𝐿 𝐹𝐹𝐵𝐵𝑂𝑂 𝐺𝐺𝐵𝐵𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂 𝑅𝑅𝑅𝑅]+ 𝐹𝐹𝑂𝑂𝐼𝐼𝑂𝑂𝑂𝑂𝑂𝑂3\n∗ [𝑃𝑃𝑂𝑂𝑂𝑂𝑉𝑉𝑂𝑂𝐵𝐵𝑉𝑉𝑅𝑅 𝑜𝑜𝑂𝑂𝑂𝑂 𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑅𝑅𝐵𝐵𝑂𝑂𝑂𝑂𝑂𝑂𝐼𝐼𝑂𝑂 ℎ𝑂𝑂𝑉𝑉𝐼𝐼 𝐼𝐼𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝐼𝐼𝑂𝑂𝑅𝑅]\n𝐺𝐺5)𝑂𝑂 C𝑂𝑂𝑂𝑂a𝑂𝑂lc𝑂𝑂u𝑉𝑉l a𝑅𝑅te𝑅𝑅 t=he 5o.p7e5r%ati∗on(a1l0 r0isk+ r3eq2u0ir+ed1 c3a0pi−ta2l 0) = 30.475\n𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂𝑂 𝑅𝑅𝑂𝑂𝑅𝑅𝑅𝑅 𝑅𝑅𝑅𝑅 = 22.50+1.50+30.475 = 54.475\nILA LFMC Spring 2024 Solutions Page 38\n\n",
        "commentary": ""
    }
]