[
    {
        "question_id": "1",
        "solutions": "Learning Objectives:\n1. The candidate will understand the designs and risks of the common life and\nannuity products and features, as well as the methods and metrics used to design\nand price these products.\nLearning Outcomes:\n(1a) Describe the designs of the common life and annuity products and evaluate their\nassociated features and inherent risks.\n(1m) Describe and evaluate the types of assumptions commonly used in actuarial\npricing and product development.\n(1n) Describe and evaluate the role of Behavioral Economics in understanding and\nmodeling policyholder behavior in the life and annuity context.\nSources:\nStructured Settlement Annuities, SOA Research Institute, Sklar, 2022\nPension Risk Transfer in Canada and the U.S., SOA Research Institute, Simmons, 2022\nMarket Trends and Product Designs: Considerations when Interest Rates are Rising, Sun,\nMoench, Strother, Lee, and Mu, 2021\nCommentary on Question:\nThe question was to test the candidate’s knowledge of pension risk transfer (PRT) and\nstructured settlement (SS)products. For part (a), Most candidates demonstrated their\nknowledge about the SS, some candidates lost some points as they mixed the concept\nbetween PRT and FA. For part (b), most candidates didn’t receive the full marks as they\nonly described the impacts from policyholder behavior under the different interest\nenvironments, very few candidates mentioned the pricing strategy and product design\nunder the low/high interest scenarios. For part (c), most candidates made the\nrecommendation with reasonable justifications.\nILA LPM Spring 2024 Solutions Page 1\n\n--- Page 2 ---\n",
        "commentary": ""
    },
    {
        "question_id": "1",
        "solutions": "\nSolution:\n(a) Compare and contrast the following pricing considerations for retirement\nannuities and structured settlements.\n(i) Asset Return/Interest Rates\n(ii) Longevity/Mortality\n(iii) Annuitant Behavior\n(iv) Expenses\n(v) Liquidity\nCommentary on Question:\nMost candidates were able to provide reasonable considerations for these items,\nexcept for Expenses – The candidates were expected to understand the types of\ndifferent expense items, the difference of how they are determined from pricing\nbetween these two, i.e. SS is priced individually, while PRT it is a group contract.\nSome candidates also lost points on the annuitant behavior as they treated the\npensioner as a general holder of fixed annuity ( and even variable annuity from\nsome candidates) instead of retirement-specific products.\n• Assets Return/Interest Rates:\nBoth types of annuities are long-duration products, so insurers often use illiquid\nassets in their portfolios.\nThe inability to match all the projected long duration cash flows with equally\nlong duration assets creates reinvestment risk for both products.\n• Longevity/Mortality\nThe insured populations for retirement annuities and SS is vastly different which\ncreates different types of longevity risk.\nFor PRT, insurers often use several data points in their underwriting such as ZIP\ncode, job type, and other experience data.\nSS insureds tend to be much younger than retirements annuities at issue, and\nunderwriting is a challenge for SS due to physical and medical impairments of\nmany annuitants which impacts the shape of the mortality curve.\nILA LPM Spring 2024 Solutions Page 2\n\n--- Page 3 ---\n",
        "commentary": ""
    },
    {
        "question_id": "1",
        "solutions": "\n• Annuitant Behavior\nDeferred annuitants are able to choose their retirement date and form of pension.\nIf these options are subsidized (as opposed to being actuarial equivalent) then\npricing needs to reflect an assumed retirement date and pension form for each\ndeferred annuitant.\nSince SS are used to fund a tort settlement and are not individually purchased by\nthe annuitant, there isn’t the type of longevity-related anti-selection or behavior\nrisk that exists with other life annuities.\n• Expenses\nFor SS, expenses such as maintenance, overhead, commission, and other\nacquisition expenses must be factored into the pricing of the product. Most\nexpenses can be covered by adding a fixed percentage to the premium.\nFor PRT, similar expense categories apply but at a larger scale. While SS are\ngenerally individually priced, PRT's are group annuity contracts that can be\nthought of as a mini-M&A transaction. The pricing for each quote is highly\ncustomizable and expenses are of larger scale and are less fixed than SS.\n• Liquidity:\nFor PRT, deferred annuitants sometimes have the option to commute their\npension, so pricing needs to reflect the proportion of annuitants expected to\nchoose a pension versus lump sum commuted value. The asset portfolio should\nhave enough liquid assets to cover these amounts.\nFor SS, the benefit payments (annuity certain, single life annuity, temp life\nannuity, lump sum) are fixed and determinable at issue so there is no uncertainty\nof when benefits will be due, only for how long.\n(b) Compare the impact of a sustained low interest rate environment against a rising\ninterest rate environment for each of the following:\n(i) ABC Life’s inforce FA block\n(ii) ABC Life’s inforce life insurance block\n(iii) Pricing of future PRT deals and structured settlements\nILA LPM Spring 2024 Solutions Page 3\n\n--- Page 4 ---\n",
        "commentary": ""
    },
    {
        "question_id": "1",
        "solutions": "\nCommentary on Question:\nMany candidates were unable to cover all the aspects as presented in this model\nsolution, but points were given to answers that had reasonable justification. Many\ncandidates mainly focused on the impacts due to the policyholder behavior under\nthe low/high interest environment, and failed to touch on other aspects. Very few\ncandidates mentioned what the company could do to actively manage the inforce\nblocks to react to these interest scenarios.\n• Fixed Annuity:\nIn the sustained low interest rate environment, fixed annuity writers have\nincreased the use of reinsurance to provide surplus relief or to allow for\naccess to a broader range of investment options.\nFA sales growth has occurred during periods of credit spread widening,\nflow reinsurance mechanics and new capital injection from PE backed\ncompanies.\n• Whole Life and UL:\nThe sustained low interest rate environment in recent years followed by\nincreases since late-2020 has been less impactful on WL than UL. WL\nproducts are generally more stable in changing interest rate environments,\nlikely due to the simple design of the product.\nIn contrast, products that are more interest rate sensitive, including UL\nproducts, tend to have lower sales as these products are more expensive\nfor policyholders to keep in force when interest rates are low.\nIn the current interest rate environment, insurers must participate in active\nmanagement on non-guaranteed elements, including raising COI charges\non UL products, to ensure profitability. Management also need to maintain\na reasonable level of profitability and minimize market value loss on the\nsale of fixed income by adjusting crediting rate.\n• PRT and SS:\nPRT and SS are both long duration products. The inability to match all the\nprojected long duration cash flows with equally long duration assets\ncreates “reinvestment risk” for both products.\nAs interest rates start to slowly rise, carriers in the long-duration insurance\nmarket may be prudent to react given past interest rate trends to be\ncompetitive in the annuity market. Leveraging lessons learned during prior\nperiods of rising interest rates can better position carriers for long-term\ncompetitiveness and profitability, particularly for PRT cases.\nILA LPM Spring 2024 Solutions Page 4\n\n--- Page 5 ---\n",
        "commentary": ""
    },
    {
        "question_id": "1",
        "solutions": "\n(c) Recommend one of the following business strategies for ABC Life. Justify your\nresponse.\nStrategy A: Enter the PRT market\nStrategy B: Enter the structured settlement market\nStrategy C: Focus on growing the WL business\nStrategy D: Focus on growing the FA business\nCommentary on Question:\nMost candidates made a recommendation with appropriate justifications. Partial\ncredits were given to candidates who provided reasonable analysis but did not get\nto enough details. No points were given if the candidate made a recommendation\nwithout explaining the reasons, or the reasons given were not correct.\nOption 1 - Enter the PRT market:\nI recommend that the company enter the PRT market.\nThe PRT market is a massive opportunity for expansion for ABC with PRT\ntransactions often worth premiums of hundreds of millions or even billions of\ndollars. Additionally, ABC may be average to leverage some of its experience on\nfixed annuities to developed customized mortality assumptions for each PRT\ntransaction.\nIn contrast, the SS market is a niche market. Additionally, the complexities of\nsetting unique mortality assumptions, factoring in level of impairment, may be a\nchallenge for ABC since the mortality curve of structured settlements can differ\nthan traditional annuities or retirement annuities.\nOption 2 - Enter the SS market:\nI recommend that the company enter the SS market.\nOf the two new markets proposed, SS is more appropriate for ABC due to the size\nof the company. PRTs are generally large deals which can be thought of as mini-\nM&As. ABC may not have the infrastructure to handle such a financially large\nblock of business.\nIn contrast, SS is a niche market with annuities used to fund tort settlements.\nABC's experience with fixed annuities would be a benefit while entering the SS\nmarket.\nILA LPM Spring 2024 Solutions Page 5\n\n--- Page 6 ---\n",
        "commentary": ""
    },
    {
        "question_id": "1",
        "solutions": "\nOption 3 - Focus on growth of WL business:\nI recommend that the company grow its WL business.\nIn a period of sustained low interest rates followed by a moderate increase in\nrecent years, ABC should focus on product designs that perform well in rising\ninterest rate environments, such as Whole Life. Historically, WL products have\nperformed well in dramatically changing interest rate environments due to their\nsimple design.\nThe company should focus on WL over UL because it is less interest sensitive. In\nthe UL line, the company may need to adjust COIs to stay profitable.\nOption 4 - Focus on growth of FA business:\nI recommend that the company grow its FA business.\nAs a small company, ABC may not have the appropriate infrastructure to expand\nits product offerings; however, in the current period of heightened mortality, the\ncompany may be able to see profits on their annuity business.\nWhile expanding its FA business, ABC should increase the use of reinsurance to\naid profitability, provide reserve relief, and to use offshore reinsurance\ntransactions utilized to better recognize asset-liability-management and allow for\naccess to a broader range of investment options.\nILA LPM Spring 2024 Solutions Page 6\n\n--- Page 7 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "Learning Objectives:\n4. The candidate will understand the various forms of traditional reinsurance, will be\nable to assess how and when they are effectively used, and will be able to perform\nthe associated accounting (from both ceding and assuming perspectives) for basic\nreinsurance transactions.\nLearning Outcomes:\n(4a) Evaluate and analyze traditional and advanced reinsurance transactions, and\nprepare related financial statement entries.\n(4b) Describe and evaluate indemnity reinsurance and evaluate its use, forms, and\nrequirements.\n(4c) Describe risk transfer considerations, and evaluate their impact on reinsurance\nagreement provisions.\n(4d) Describe and evaluate nonproportional reinsurance arrangements and their use.\n(4e) Describe and evaluate how strategic/customized reinsurance solutions may\nenhance insurer prospects.\nSources:\nLife, Health & Annuity Reinsurance, Tiller, John E. and Tiller, Denise, 4th Edition, 2015\n- Ch. 5-7, 9, 17\nCommentary on Question:\nThe question tested the candidate’s understanding of a variety of types of reinsurance\ntransactions, how to prepare financial statement entries, and the NAIC’s model\nregulations on acceptable risk transfer. Overall, candidates did reasonably well on this\nquestion. Candidates performed the best on part a.\nSolution:\n(a) Recommend a method of reinsurance for each of the following. Justify your\nanswers.\n(i) Company A is looking to free up surplus for the issuance of a new line of\nuniversal life (UL) products. Company A would like to run off its old\nwhole life (WL) block and is looking to reduce the size of its balance sheet\nimmediately.\n(ii) Company B is looking to mitigate its lapse risk on the fixed annuity\nbusiness by transferring 30% of its lapse risk exposure using reinsurance\nwithout reducing its total invested assets or reserves. Company B also\nprefers to have frequent cash flow settlements.\nILA LPM Spring 2024 Solutions Page 7\n\n--- Page 8 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "\n(iii) Company C would like to reduce 90% of its mortality risk on its UL\nbusiness while retaining all other risk. Company C is looking for a fast and\nefficient solution.\n(iv) Company D discovered if the surrender rate on their whole life block were\nto exceed 35% in any given year, the company may not have sufficient\ncash on hand to pay out the surrender benefits. The block has profitable\nexperience with surrender rates around 3%, and Company D does not seek\nto give up much profit generated from the mortality and investment\nexperience.\n(v) Company E’s investment yield ranks among the highest in the industry\ndue to its aggressive investment strategy and utilization of alternative\nassets, but its mortality and lapse experience has been undesirable on its\nWL, term, and UL business. Company E would like to transfer 40% of its\nunderwriting risk using reinsurance without altering its investment\nportfolio.\nCommentary on Question:\nCandidates performed well on this question. Candidates who selected the\nappropriate method of reinsurance and described why the method was the best\nchoice received full credit. Credit was also given for other methods of\nreinsurance that were appropriately justified. Many candidates did not recognize\nthat part (iv) was a non-proportional reinsurance structure.\n(i) Recommend coinsurance. Coinsurance will reduce the balance sheet and free\nup surplus. It is also efficient and quick to administer. Assumption reinsurance is\nnot appropriate in this scenario because Company A wishes to reduce the size of\nthe balance sheet immediately.\n(ii) Recommend modified coinsurance. Modified coinsurance allows Company B\nto mitigate its lapse risk without reducing its total invested assets or reserves, as\nopposed to coinsurance. Company B also prefers to have frequent cash flow\nsettlements, which would happen with modified coinsurance, but not with funds\nwithheld modified coinsurance.\n(iii) Recommend YRT. This will allow the ceding company to reduce their\nexposure to mortality risk. YRT is also a fast and efficient solution and is low\ncost.\n(iv) Recommend stop loss reinsurance. Company D seeks to reduce excess risk,\nwhich is best handled by stop loss reinsurance. This type of reinsurance will also\nbe low cost, which will allow Company D to retain profit generated from\nmortality and investment experience.\nILA LPM Spring 2024 Solutions Page 8\n\n--- Page 9 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "\n(v) Recommend modified coinsurance. Modified coinsurance will not alter the\nasset positions of the ceding company and thus not affect the portfolio. Although\na funds withheld could also aim to achieve this, the alternative assets may cause\nadditional regulatory scrutiny under this structure. Thus, modified coinsurance is\nthe best choice.\n(b) Calculate the following for each of the three quotes above:\n(i) Initial reinsurance premium\n(ii) Initial amount due from UWU Life to the reinsurer\n(iii) UWU Life’s net reserve as of the reinsurance effective date\n(iv) UWU Life’s invested assets as of the reinsurance effective date\nCommentary on Question:\nCandidates needed to be able to demonstrate their understanding of how\nreinsurance of in-force business is calculated. Full credit was awarded for a\ncorrect response to each part, including work shown. Candidates received partial\ncredit for each result they correctly calculated for a particular quote.\n(i) The initial premium is based on a pro-rata share of the reserve backing the\npolicies to be reinsured.\nInitial Premium = quota share * reserve inforce\nQuote # Initial Premium\nQuote 1 =80% * 2,200,000,000 = 1,760,000,000\nQuote 2 =75% * 2,200,000,000 = 1,650,000,000\nQuote 3 =75% * 2,200,000,000 = 1,650,000,000\n(ii) For Quote 1, the initial amount is equal to the ceded premium less allowance\nless the modco reserve adjustment. Thus,\ninitial amount due = initial premium - initial allowance – modco reserve\nadjustment\ninitial amount due = 1,760,000,000 – 1,760,000,000 * 9% – 1,760,000,000\n= -158,400,000\nILA LPM Spring 2024 Solutions Page 9\n\n--- Page 10 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "\nFor Quote 2, the initial amount is equal to the ceded premium less allowance.\nThus,\ninitial amount due = initial premium - initial allowance\n= 1,650,000,000 – 1,650,000,000 * 10%\n= 1,485,000,000\nFor Quote 3, the initial amount due is 0 because it is a funds withheld basis where\nthe new position is reflected via payable / receivable. Thus,\ninitial amount due = 0\n(iii) On a Coinsurance or Funds Withheld Coinsurance basis, the net reserve is\nsimply the pro-rata share of the gross reserve (i.e., 25% of 2,200,000,000), while\non a Modified Coinsurance basis, all assets are retained by the ceding company\nand therefore the net reserve is equal to the gross reserve. Thus,\nQuote # Net reserve at reinsurance effective date\nQuote 1 = 2,200,000,000\nQuote 2 = 2,200,000,000 * 25% = 550,000,000\nQuote 3 = 2,200,000,000 * 25% = 550,000,000\n(iv) In general, the invested assets are equal to the surplus and reserve, plus the\ninitial gain (allowance) from the reinsurer. However, on a Funds Withheld\nCoinsurance basis, a paper liability (accounts payable) results in the invested\nassets remaining the same since no funds physically change hands.\nFirst, the surplus = total invested asset – reserve inforce = 200,000,000\nQuote # Net reserve at reinsurance effective date\nQuote 1 Invested assets = surplus + reserve from (iii) + allowance\n= 200,000,000 + 2,200,000,000 + 1,760,000,000 *\n9%\n= 2,558,400,000\nQuote 2 Invested assets = surplus + reserve from (iii) + allowance\n= 200,000,000 + 550,000,000 + 1,650,000,000 *\n10%\n= 915,000,000\nQuote 3 invested assets = original total invested assets = 2,400,000,000\nILA LPM Spring 2024 Solutions Page 10\n\n--- Page 11 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "\n(c) XYZ is considering reinsurance to improve capital efficiency on their long term\ncare block. XYZ is evaluating the use of the following reinsurance structure\nwhich combines modified coinsurance and coinsurance:\nModified Coinsurance Coinsurance\nComponent Component\nInitial Quota Share 90% 10%\nInitial Allowance 10% 10%\nCritique the following characteristics of the proposed reinsurance structure with\nrespect to the NAIC’s model regulations on acceptable risk transfer:\n(i) Based on recent asset performance, XYZ will use a constant modified\ncoinsurance interest rate of 5%.\n(ii) XYZ will use assumption reinsurance to maximize the value of the\ntransaction but seeks the option to recapture the business in 5 to 10 years\nif experience improves.\n(iii) XYZ is looking to receive an experience refund at the end of every month,\nsettled on a cash basis.\n(iv) XYZ will adjust the quota shares of modified coinsurance and coinsurance\nto minimize the size of periodic cash settlements.\nCommentary on Question:\nTo receive full credit, candidates needed to not only say if they agreed or\ndisagreed with the statement, but needed to explain why the statement was correct\nor incorrect. For statements that could violate model regulations, alternative\noptions were required for full credit. Credit was also given for other reasonable\nresponses.\n(i) The constant modified coinsurance interest rate is inappropriate. XYZ should\nuse a rate that references actual asset performance, otherwise risk transfer will not\nbe met.\n(ii) Assumption reinsurance transfers policy obligations directly to the assuming\ninsurer, and therefore would not permit recapture. Indemnity reinsurance should\nbe used if recapture is a requirement.\n(iii) There is nothing wrong with the structure in settlement frequency as it is\nmore frequent than quarterly. The experience refund is also acceptable since it\nappears that the risk to the reinsurer is not eliminated (e.g., by requiring the\nceding company to subsidize losses)\nILA LPM Spring 2024 Solutions Page 11\n\n--- Page 12 ---\n",
        "commentary": ""
    },
    {
        "question_id": "2",
        "solutions": "\n(iv) This structure is also known as partially modified coinsurance. An increase in\nquota share when reserves increase may not be appropriate as some states may not\nallow it, thereby losing any reserve/surplus credit. It would be preferable to\nchoose a reinsurance method with clearer risk transfer that requires the reinsurer\nto pay for its share of cash losses, such as traditional modified coinsurance.\nILA LPM Spring 2024 Solutions Page 12\n\n--- Page 13 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "Learning Objectives:\n1. The candidate will understand the designs and risks of the common life and\nannuity products and features, as well as the methods and metrics used to design\nand price these products.\n2. The candidate will understand the theory of \"Value Creation\" for life and annuity\nproducts and how to evaluate the patterns of earnings emergence under various\nregulatory regimes.\nLearning Outcomes:\n(1h) Describe what is meant by Life Settlements and assess their impact on insurance\nproduct pricing/management.\n(1j) Describe and apply the requirements of applicable ASOPs on Life and Annuity\nProduct Pricing and Assumptions\n(2c) Describe and evaluate fundamental strategies for enhancing value through active\nin-force and operational management.\nSources:\nASOP 24: Compliance with the NAIC Life Illustrations Model Regulation , December\n2016\nThe Response of Life Insurance Pricing to Life Settlements, Product Matters, Sep 2006\nLPM-153-19: Life in-force Management: Improving Consumer Value and Long-Term\nProfitability\nCommentary on Question:\nCommentary listed underneath question component.\nSolution:\n(a) Critique each of the following statements with respect to ASOP 24: Compliance\nwith the NAIC Life Illustrations Model Regulation.\nA. The illustration actuary can assume expense improvement into the future if\nthe improvement is proved to be significant and ongoing.\nB. Any experience factor needs to be based on actual experience, either the\ncompany’s own experience or a combination of industry experience and\nthe company experience, and changes to the company’s business practice\nmay not be considered.\nILA LPM Spring 2024 Solutions Page 13\n\n--- Page 14 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "\nC. The requirement for the self-support test is that, at every illustrated point\nin time starting at a policy anniversary specified by the NAIC Life\nIllustrations Model Regulation, the accumulated value of all policy cash\nflows, when using experience assumptions underlying the currently\npayable scale, should be equal to or greater than the illustrated\npolicyholder value.\nD. Policy forms that can never develop nonforfeiture values are exempt from\nboth the self-support test and the lapse-support test.\nCommentary on Question:\nThis question required that candidates understood all aspects of the statement\nand how it related to ASOP 24. In many of the statements, some of the\ninformation was correct, but each of the four statements had a component that\nwas not correct. To receive full credit, candidates needed to identify the\ncomponent of the statement which was not correct, and provide a correction to\nthe statement.\nCandidates generally received full credit for statements A. and B. On statement\nC., many candidates focused on defining the requirements of the self-support test,\nbut were not able to identify the incorrect wording of using assumptions\nunderlying the disciplined current scale, rather than the currently payable scale.\nOn statement D., many candidates failed to acknowledge that the policy forms are\nexempt from the lapse-support test but still need to pass the self-support\nrequirement.\nA. This statement is false. It is not acceptable to assume future experience\nimprovements beyond the effective date of the disciplined current scale\nunderlying the illustration.\nB. This statement is false. Significant changes to the company's business practice\nmay be reflected in the experience factors underlying the disciplined current scale.\nThe change in business practice should have already been made, not planned in\nthe future.\nC. This statement is false. The experience assumptions must be underlying the\ndisciplined current scale, not the currently payable scale.\nD. This statement is false. These policy forms are exempt from the lapse-support test\nbut still need to pass the self-support requirement.\nILA LPM Spring 2024 Solutions Page 14\n\n--- Page 15 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "\n(b) Describe three specific actions PQR could take to improve profitability of the\ninforce UL block.\nCommentary on Question:\nThis question tested candidates’ understanding of the inforce management of UL\nproduct. To receive full credit, candidates had to demonstrate knowledge of\nspecific actions to improve profitability on an inforce UL block. Candidates who\nprovided at least three specific actions, of which there were more than three\npossibilities, with justification received full credit. Candidates who provided\nspecific actions without extensive justification received partial credit.\nCandidates generally performed well on this question, as they were able to\nidentify and justify three specific actions. However, some candidates did not\nreceive credit because their responses focused on actions that could be taken to\nimprove the profitability of new business, not of the inforce block.\n• PQR could improve persistency, as low persistency from healthy policyholders\ncan lead to a higher mortality rate from the remaining unhealthy policyholders.\nBy increasing customer engagement, offering premium holidays or discounts\nwhen necessary, PQR will be able to improve persistency.\n• PQR could increase its operational efficiency, as expenses often represent a\nsignificant cost for a life insurance company. By overhauling its IT core systems,\nimproving process automation, or by outsourcing business to lower-cost\nproviders, operational efficiency can be improved, which will reduce expenses\nand thus increase profitability.\n• PQR could improve its capital position, which can be done by reinsuring the\nblock of business. They could consider reinsuring mortality and lapse risk\nthrough these reinsurance agreements, as reinsuring a block of business can\noptimize the capital allocation, and thus improve returns.\n(c) PQR found that some inforce policies have been sold to life settlement\ncompanies. Describe two reasons such sales could negatively impact PQR’s\nprofitability.\nCommentary on Question:\nThe question tested the candidates' knowledge of life insurance pricing to product\nsettlements and how they impact a life insurance company's profitability. This\nquestion was generally well done, as many candidates were able to identify and\nexplain the reasons that life settlements negatively affect the PQR's profitability.\nSome candidates did not receive the full credit because they provided a\ndownstream impact of the inforce policies being sold but did not adequately\nexplain how profitability would be impacted.\nILA LPM Spring 2024 Solutions Page 15\n\n--- Page 16 ---\n",
        "commentary": ""
    },
    {
        "question_id": "3",
        "solutions": "\n• These policies will exhibit higher than assumed persistency, which will be\nparticularly noticeable at older attained ages. With the increase in persistency,\nthere will be higher than assumed mortality at these older ages, which will lead to\nmore claims being paid out than originally anticipated, hurting profitability.\n• The life settlement companies will often decide to pay the minimum amount of\npremiums needed to keep the policies in force, since the focus is now on the death\nbenefit rather than the accumulation value. There will be less inflow of\npremiums, which makes it more challenging to cover expenses and death benefits,\nand will reduce profitability.\nILA LPM Spring 2024 Solutions Page 16\n\n--- Page 17 ---\n",
        "commentary": ""
    },
    {
        "question_id": "4",
        "solutions": "Learning Objectives:\n3. The candidate will understand common issues and practices related to In Force\nand New Business Product Management, and how experience studies are\ndesigned and used for evaluating past experience and for setting assumptions.\nLearning Outcomes:\n(3e) Describe how experience studies are designed and used for evaluating past\nexperience, and for setting assumptions.\nSources:\nExperience Study Calculations, Oct 2016, sections 2-4, 11, 12 15, 17 & 18 (excluding\n18.2, 18.8 & 18.9)\nLife Insurance for the Digital Age: An End-to-End View , Product Matters, Nov 2017\nCommentary on Question:\nThis question tested the candidates' knowledge of how experience studies are used for\nevaluating past experience and for setting assumptions. It also tests the candidates’\nknowledge about how an accelerated underwriting (AUW) program helps to achieve\nmortality at a level closer to a fully underwritten process compared to nonmedical\nunderwriting. Most candidates did well on part a). Candidates did not perform as well\non part b).\nSolution:\n(a) DEF Life sells income payout annuities and term life insurance. DEF Life would\nlike to leverage the mortality experience from their immediate annuity business to\nprice structured settlements.\nEvaluate this approach.\nCommentary on Question:\nFor part a), candidates were expected to comment on the source of business\ndifferences between immediate annuities and structured settlements – age and\nsignificant impairment of structured settlement lives would be required for full\ncredit.\nMost candidates did well on this part. This included stating the approach was not\nappropriate and providing justification including younger age of structured\nsettlement demographics or injury/impairment creating higher mortality risk\nrelative to demographics purchasing an immediate annuity. The candidates were\nexpected to mention specifically higher mortality from structured settlements\ninstead of simply different mortality compared to immediate annuities.\nILA LPM Spring 2024 Solutions Page 17\n\n--- Page 18 ---\n",
        "commentary": ""
    },
    {
        "question_id": "4",
        "solutions": "\nImmediate annuities often attract buyers who are healthier than average and at\nrisk of outliving their savings:\nAs with life insurance products, larger amounts are often associated with lower\nmortality. In the case of immediate annuities, the best amount to study is the\nmonthly income amount.\nImmediate annuity studies are needed to help quantify historical mortality\nimprovement. This can be difficult because so many variables need to stay\nconstant to develop accurate comparisons. For example, how immediate annuities\nare sold or bought and what competing options are available can vary over time\nand consequently affect the expected mortality of new buyers.\nStructured settlements often arise from injury lawsuits. Their terms are sometimes\ndecreed by a court of law but are more often the result of negotiated settlements.\nTypically, the structure of the payments is not a single monthly amount payable\nfor life. Instead, there may be one or more lump sums and some payments that\nincrease over time, with a goal of providing for the injured person or, in some\ncases, the surviving dependents of the plaintiff.\nMortality levels for structured settlements would normally be higher than those\nfor immediate annuities. The most severely injured payees would be expected to\nlive shorter lives and may thus qualify for substandard underwriting, which would\nprovide greater annuity benefits\nWhen studying mortality by the amount of a structured settlement, reserves are\nnot a perfect choice for the amount but are often a better choice than a monthly\nincome amount that varies. The premium paid to purchase the structured\nsettlement might be a better choice of amount, but most companies don’t store the\npremium in their administration system.\n(b) Explain how each of the following components of an accelerated underwriting\n(AUW) program helps to achieve mortality at a level closer to a fully\nunderwritten process versus nonmedical underwriting:\n• Smoker propensity model\n• Risk score model\n• Prescription (Rx) data\n• Medical records\n• Triage rules\nILA LPM Spring 2024 Solutions Page 18\n\n--- Page 19 ---\n",
        "commentary": ""
    },
    {
        "question_id": "4",
        "solutions": "\nCommentary on Question:\nFor part b), candidates were expected to explain how each component helps to\nachieve mortality at a level closer to a fully underwritten process.\nCandidates had mixed performance on this question, but most had a fundamental\nunderstanding of these AUW components. Points were most frequently missed by\nnot adequately explaining how these AUW components can help get mortality\ncloser to that of fully underwritten business. This includes not only stating that\nsmoker propensity model identifies smoking status, but also an accurate model\nshould lower the cost of misclassifying smokers as non-smokers as smoking status\nis highly correlated with mortality. In terms of triaging rules, to receive full\ncredits, candidates were expected to expand on the desire to reduce mortality\nslippage to get AUW mortality closer to FUW.\nSmoker propensity models – these lower the cost of misclassifying smokers,\nwhose mortality is frequently 3 times as high as nonsmokers. Without such a\nmodel, non-medical underwriting is prone to greater misclassification with the\nloss of ability to detect cotinine in urine or blood.\nRisk score model – risk scores are frequently used to classify risk in much the\nsame way an underwriter would. A better risk scoring model will result in more\ndistinct relative A/E ratios, while a poor model will fail to adequately distinguish\nrelative risk.\nPrescription / Rx data – Rx data is frequently an input into a risk scoring model\nthat helps identify potential impairments requiring drugs to treat that could\nexplain or predict higher mortality associated with that impairment.\nMedical records / Dx data – Dx data, similarly to Rx data, may be used by a rules\nengine or as an input into a risk scoring model to predict relative mortality in\nrelation to health insurance claims and other data embedded in medical records.\nTriage rules – these rules help determine the optimal amount of screening for a\ngiven applicant. It can fast track good risks, but arguably more importantly, has\ncriteria determining which applicants must be referred to an underwriter for a\nmore traditional underwriting experience. For applicants whose predicted\nmortality is more uncertain or more likely to be higher than can be tolerated, this\nhelps reduce mortality slippage in an AUW program.\nILA LPM Spring 2024 Solutions Page 19\n\n--- Page 20 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "Learning Objectives:\n1. The candidate will understand the designs and risks of the common life and\nannuity products and features, as well as the methods and metrics used to design\nand price these products.\nLearning Outcomes:\n(1a) Describe the designs of the common life and annuity products and evaluate their\nassociated features and inherent risks.\n(1b) Describe and evaluate methods and metrics used to design and price these\nproducts, and assess their profitability.\n(1d) Describe considerations and practices related to \"Lapse-Supported\" insurance.\n(1m) Describe and evaluate the types of assumptions commonly used in actuarial\npricing and product development.\nSources:\nPension Risk Transfer in Canada and the U.S., SOA Research Institute, Simmons, 2022\nASOP 54: Pricing of Life and Annuity Products, Jun 2018\nLong-Term Care Insurance: The SOA Pricing Project, 2016\nUnderstanding the Volatility Experience and Pricing Assumptions in Long-Term Care\nInsurance, 2014, pp. 4-46\nCommentary on Question:\nCandidates were generally able to list much of the appropriate content and showed\nknowledge of the concepts making the question reasonably well done overall. Few were\nable to demonstrate a complete depth of understanding which was needed to get full\nmarks.\nSolution:\n(a) List four reasons that the group annuity proposal could be advantageous to DNS.\nCommentary on Question:\nMany were able to list 2 or 3 solid reasons. Often candidates repeated the same\nitem twice but in different words or gave a reason quite similar to one they had\nalready given which was not sufficient for full marks.\nILA LPM Spring 2024 Solutions Page 20\n\n--- Page 21 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "\n-It would transfer investment and longevity risk from DNS to ONA which are\nsignificant components in the cost of a benefit plan. ONA has more experience\nmanaging these type of risks.\n-If a buy-out transaction was used this would also transfer a lot of administrative\nand operational work to ONA allowing DNS to focus on their specialty of legal\nwork.\n-Life insurers are well-regulated and the plan members generally have increased\nconfidence in their benefit payments being made when pensions are transferred to\ninsurers. So a plus for the DNS plan members.\n-Insurers have access to their interest and industry experience data which may\nallow ONA to offer a more competitive quote.\n(b) Critique each of the following statements from the proposal to DNS:\n(i) ONA Life plans to use individual annuity experience to price the group\nannuity.\n(ii) The best way to mitigate longevity risk is to fully reinsure the business.\n(iii) Since this is an established block of business for ONA Life, a deterministic\nmodel with a single set of assumptions would be sufficient.\nCommentary on Question:\nCandidates typically showed understanding of the concepts and could respond to\nthe statements. A proper critique or opinion was required for full markets. Listing\nsome relevant content but leaving the response too open ended only earned\npartial credit. For part (iii) some candidates simply stated stochastic models as\nthe better approach but without giving some context or justification.\n(i) This is not an appropriate plan. Individual and Group annuity experience\nare often different due to the nature of who uses each product. Individual\nannuities are selected by individual customers where group contracts are\ngenerally based on the customers type of employment. This can cause\ndifferences in data. ONA would be better to look at internal group data\nand supplement it with relevant industry data for group products.\n(ii) This is not the case. For a well established life insurer typically the best\nway is to naturally hedge longevity risk with products containing mortality\nrisk like permanent life insurance or term insurance. It does not appear\nONA has mortality risk products based on their specialties listed, but this\nis the first suggestion. Reinsurance can still be a tool but not the best way\nto mitigate longevity risk.\nILA LPM Spring 2024 Solutions Page 21\n\n--- Page 22 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "\n(iii) A deterministic model with a single set of assumptions is not sufficient.\nExperience can vary and it is unlikely that one model will have every\nassumption precisely accurate. Sensitivity testing a variety of assumptions\nin a deterministic model can work to assess the range and magnitude of\npossible risks. Depending on the size of risk and length of contract a\nstochastic model for interest rates or mortality may also be appropriate.\nBut either way a deterministic model with one set of assumptions will not\nsuffice to assess the potential risks.\n(c) DNS is interested in providing long term care insurance for their employees, but\nis concerned about recent premium increases.\n(i) Describe four challenges that the long term care insurance industry has\nfaced that has led to premium rate increases.\n(ii) Propose a strategy to address one of the challenges.\nCommentary on Question:\nMany candidates could list 3 or 4 key challenges but often missed some points in\nnot truly describing them and why they caused premium rate increases. Part (ii)\nwas not well done. Many candidates listed a solution but did not connect it to\nwhat challenge it was trying to address or give sufficient detail to support why\ntheir proposed strategy would be beneficial.\n(i)\n1. Lapse rates were much lower than expected. Because there was no benefit from\nsurrendering policyholders developed a ‘use it or lose it’ mentality and held onto\nthe policies longer than expected or even incentivized them to go on claim\nresulting in higher likelihood of claims payout.\n2. Mortality improvement was higher than expected and mortality lower than\nexpected. People living longer led to longer time when on claim, and less\nterminations due to death, and thus higher amount of benefits being paid\n3. Interest rates turned out to be much lower than originally forecasted when the\nproducts were initially priced. The investment return was a large component of\nthe product as the product is a longer duration product. The expectation was\ninvestment returns would support the pricing but low interest rates led to low\ninvestment returns.\n4. Inflation and long-term care costs were higher than expected. The cost of LTC\nincreased substantially between when the products were initially priced and when\nthe majority of people started making claims. There was no mitigation for\ninflation in the premiums.\nILA LPM Spring 2024 Solutions Page 22\n\n--- Page 23 ---\n",
        "commentary": ""
    },
    {
        "question_id": "5",
        "solutions": "\n(ii)\nTo address that lapse rates were much lower than expected and that policyholders\ndeveloped a ‘use it or lose it mentality’ the company could add a return of\npremium or non-forfeiture benefit. The price of the benefit would need to be\nincluded in the overall price meaning customers would still have higher\npremiums, but a return of premium or other non-forfeiture benefit can encourage\nthe policyholder to consider lapsing the policy if they haven’t made a claim by a\ncertain time period and thus reduce the risk of policies staying on longer than\nexpected. Encouraging some lapsation shortens the overall duration of the\nproduct.\nILA LPM Spring 2024 Solutions Page 23\n\n--- Page 24 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "Learning Objectives:\n1. The candidate will understand the designs and risks of the common life and\nannuity products and features, as well as the methods and metrics used to design\nand price these products.\nLearning Outcomes:\n(1l) Describe and apply methods for pricing term conversions.\n(1m) Describe and evaluate the types of assumptions commonly used in actuarial\npricing and product development.\n(1n) Describe and evaluate the role of Behavioral Economics in understanding and\nmodeling policyholder behavior in the life and annuity context.\nSources:\nTerm Conversions: Pricing and Reserving, Product Matters, Mar 2017\nLPM-107-07: Experience Assumptions for Individual Life Insurance and Annuities\nPredictive Models on Conversion Studies for the Level Term Premium Plans, Society of\nActuaries, March 2022\nCommentary on Question:\nThis question tested candidates’ knowledge on various aspects of term conversions.\nCandidates were also required to understand the impact on mortality assumptions for\nconverted policies. Overall, candidates performed better on the first part of the question\ncompared to the second part.\nSolution:\n(a) Critique the following statements on term conversions:\nA. The converted policy is perfectly priced if, at conversion, the slope of the\nexpected mortality is less than the gross premium for a permanent policy.\nB. For a convertible term policy, the costs associated with the conversion are\nunrelated to the issue age.\nC. When conversion privileges are shortened, the premium for the\nconvertible term product is expected to increase.\nD. There is no need to charge for a conversion option as part of the term\npremium, because the premium for the permanent products will already\nreflect the additional mortality experience due to conversions.\nILA LPM Spring 2024 Solutions Page 24\n\n--- Page 25 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "\nCommentary on Question:\nCandidates generally did well on this part. For Statement A, full marks were\ngiven for stating either ‘True’ or ‘False’ given reasonable justification. A\ncommon error for Statement D, was describing the different ways the conversion\ncost charge could be distributed. Some candidates did not indicate if they agreed\nor disagreed with the statement so full credit wasn’t given when this happened.\nStatement A – This statement is partially true.\nAlthough this situation is ideal in theory, based on the nature of mortality\nselection on converted policies, the rate scales would likely need to be separate\nfrom other permanent products and create administrative complexity that may be\ndifficult to manage.\nStatement B – This statement is false.\nGenerally speaking, the older the issue age, the higher the excess mortality.\nTherefore, policies issued to older people who convert at a later stage of the level\nterm period tend to have higher claims costs.\nStatement C – This statement is false.\nWhen conversion privileges are shortened, it would be reasonable to expect\npolicyholders to accelerate their conversion decisions while they still have the\noption. The earlier the conversion, the younger the policyholder, the lower the\nclaim costs, the lower the premium.\nStatement D – This statement is false.\nIt is more appropriate to separate converted policies’ mortality experience from\nthe permanent products due to the following reasons:\n• Converted permanent products generally have higher mortality experience\nthan permanent policies bought outright.\n• Experience could vary significantly by the motivation of the policyholders\nwho exercise the conversion option. For example, for a 10-year term life\nproduct, the first 9 years of experience would likely see very low\nconversion rates and impact on the permanent policies’ experience will be\nminimal while year 10 could see a jump in conversion rates and cause the\nmortality of permanent products suddenly spike, if blending the two for\nexperience study.\n(b)\n(iv) Describe two approaches for developing the mortality assumption for\nconverted policies.\n(ii) List an advantage and a disadvantage of each of the above approaches.\nILA LPM Spring 2024 Solutions Page 25\n\n--- Page 26 ---\n",
        "commentary": ""
    },
    {
        "question_id": "6",
        "solutions": "\nCommentary on Question:\nMany candidates did not do well on this part of the question as they were unable\nto identify the approaches for developing mortality assumptions for converted\npolicies. Some candidates described options as to where to add the additional\npremium for the conversion option rather than describe methods to develop the\nmortality assumption for converted policies. Many candidates also erroneously\nreferenced Dukes-McDonald or Becker-Kitsos. Although there are three distinct\napproaches, full marks were given to candidates for identifying and explaining\nany two approaches.\nFirst Approach - Estimate the mortality rate on converted policies by making an\nassumption of the degree of anti-selection using the principle of “conservation of\ndeaths”.\nAdvantage – It more accurately reflected the characteristics and risks associated\nwith the converted policies.\nDisadvantage – An assumption about the degree of anti-selection is required.\nAnti-selection refers to those insured whose health has deteriorated are more\nlikely to convert in order to maintain their insurance coverage since they cannot\nqualify for newly underwritten term insurance and the current term insurance may\nexpire or have rapidly rising premiums.\nSecond Approach – Blend the experience of the permanent product and the\nconverted policies and conduct a combined experience study for the two.\nAdvantage – More data will increase creditability; lead to assumption more\ntailored for the company’s experience.\nDisadvantage – Since converted permanent products generally have higher\nmortality experience than permanent policies bought outright, blending the\nexperience of the two might make overall mortality for a given product appear\nartificially high. The premium for permanent products would reflect the excess\ndeath experience due to conversions.\nThird Approach – Conduct a separate mortality study for converted policies, if\nthere is adequate data.\nAdvantage – More accurately reflected the characteristics and risks associated\nwith the converted policies.\nDisadvantage – If there is inadequate data, will need to determine the credibility.\nILA LPM Spring 2024 Solutions Page 26\n\n--- Page 27 ---\n",
        "commentary": ""
    },
    {
        "question_id": "7",
        "solutions": "Learning Objectives:\n1. The candidate will understand the designs and risks of the common life and\nannuity products and features, as well as the methods and metrics used to design\nand price these products.\n2. The candidate will understand the theory of \"Value Creation\" for life and annuity\nproducts and how to evaluate the patterns of earnings emergence under various\nregulatory regimes.\n4. The candidate will understand the various forms of traditional reinsurance, will be\nable to assess how and when they are effectively used, and will be able to perform\nthe associated accounting (from both ceding and assuming perspectives) for basic\nreinsurance transactions.\nLearning Outcomes:\n(1d) Describe considerations and practices related to \"Lapse-Supported\" insurance.\n(2b) Describe and apply the common profit metrics (IRR, Value of New Business,\nEmbedded Value, ROE) used in pricing insurance products.\n(2c) Describe and evaluate fundamental strategies for enhancing value through active\nin-force and operational management.\n(4a) Evaluate and analyze traditional and advanced reinsurance transactions, and\nprepare related financial statement entries.\nSources:\nLPM-155-19: Understanding Profitability in Life Insurance;\nLPM-153-19: Life in-force Management: Improving Consumer Value and Long-Term\nProfitability;\nLPM-152-19: Lapse Supported Insurance Analysis; LPM-107-07: Experience\nAssumptions for Individual Life Insurance and Annuities; Life, Health & Annuity\nReinsurance, Tiller, John E. and Tiller, Denise, 4th Edition, 2015 - Ch. 4: Basic Methods\nof Reinsurance\nCommentary on Question:\nThe candidates did an average job answering this question. In section (a) and (c), most\nanswers relied on overall actuarial knowledge, which was duly rewarded. However,\nconsidering the intent of these exams, the better answers drew upon the readings from the\nsyllabus. Section (b) was a bit surprising due to the difficulty a fair number of candidates\nhad in identifying the MCEV formula, a key concept.\nSolution:\n(a) Evaluate the advantages and disadvantages of an Embedded Value (EV) approach\nto measuring profitability versus accounting-based metrics.\nILA LPM Spring 2024 Solutions Page 27\n\n--- Page 28 ---\n",
        "commentary": ""
    },
    {
        "question_id": "7",
        "solutions": "\nCommentary on Question:\nPartial credit was given if the answer was actuarially sound but did not appear in\nthe solution. Optimal answers discussed both advantages and disadvantages. At\ntimes the key aspects of MCEV vs accounting based metrics were switched.\nAdvantages:\n• MCEV recognizes the relative riskiness of different business lines better\nthan accounting based metrics.\n• MCEV better addresses the long-term nature of the life insurance\nbusiness.\n• MCEV values assets and liabilities on a market-consistent basis to capture\ntheir value at the time of valuation.\n• MCEV provides a common methodology for comparison that is missing\ndue to the differences in rules and practices between statutory, local\nGAAP, and IFRS accounting.\nDisadvantages:\n• Accounting based metrics provide more transparent profit indicators.\n• Accounting-based metrics are straightforward and easy to access.\n• MCEV has lost some steam after the financial crisis as investors\nconcentrate less on long term cash flows and become more concerned with\ncurrent cash generating power.\n(b) Calculate the Market Consistent Embedded Value (MCEV) of each product.\nShow all work.\nCommentary on Question:\nStraightforward calculation question that required the candidate to properly use\nMarket Consistent Economic Value (MCEV) and Value In Force (VIF) equations.\nPartial credit given if the correct equation was listed and the numerical answer\nwas not correct. A common error was that candidates confused required capital\nand frictional costs of required capital in the equations.\nVIF=Present Value of Future Profits-Time MCEV=VIF +\nvalue of financial options and guarantees- Required Capital + Free\nCost of residual non-hedgeable financial and surplus\ninsurance risks-Frictional costs of required\ncapital\nWhole Life =3000-100-250-50-40=2560 =2560+900+200=3660\nTerm Life =1500-2000-200-500-20=-1220 =-1220+500+500=-220\nUniversal =2000-120-150-50-30=1650 =1650+700+300=2650\nLife\nILA LPM Spring 2024 Solutions Page 28\n\n--- Page 29 ---\n",
        "commentary": ""
    },
    {
        "question_id": "7",
        "solutions": "\n(c) Critique each of the following proposals to improve profitability of the inforce\nproducts:\n(i) Increase persistency on the universal life block by sending annual\nreminders about all the benefits of holding a policy\n(ii) Up-sell term life policyholders by providing annual reminders that they\nmay convert to a permanent policy which will have higher premiums\n(iii) Recapture whole life policies following a series of YRT reinsurance rate\nincreases which have made the reinsurance more expensive than the\nbenefit provided.\nCommentary on Question:\nPartial credit was once again given for actuarial sound analysis with the better\nanswers using insight directly form the syllabus.\n(i) While improving customer service may improve customer persistency, it\nis important to realize that if this is a lapse supported product, it would\nharm profitability. Answers that mentioned the generally superior\nprofitability of a Universal/Whole Life product compared to Term Life\nproducts, also received some credit.\n(ii) Anti-selection should be a key concern when upselling policyholders to a\npermanent policy due to high risk policyholders oversubscribing to this\nconversion. Additional underwriting or data analytics may diminish this\nrisk. Reputational risk may also be an issue if a policyholder denied the\noption to convert was to find out about the missed opportunity.\n(iii) Before recapturing a reinsurance block of business, it is important to\nunderstand the implications of any recapture fees. It is also important that\nthe ceding company understands the causes of the higher mortality found\nin the reinsurance agreement. The reinsurer may have additional insight\ninto the block of business the ceding company does not have.\nILA LPM Spring 2024 Solutions Page 29\n\n",
        "commentary": ""
    }
]